; ModuleID = 'libc.7a53854ec7447607-cgu.0'
source_filename = "libc.7a53854ec7447607-cgu.0"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"unix::group" = type { ptr, ptr, i32, [1 x i32], ptr }
%"unix::rusage" = type { %"unix::timeval", %"unix::timeval", i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64, i64 }
%"unix::timeval" = type { i64, i64 }
%"unix::ipv6_mreq" = type { %"unix::align::in6_addr", i32 }
%"unix::align::in6_addr" = type { [16 x i8] }
%"unix::hostent" = type { ptr, ptr, i32, i32, ptr }
%"unix::pollfd" = type { i32, i16, i16 }
%"unix::winsize" = type { i16, i16, i16, i16 }
%"unix::sigval" = type { ptr }
%"unix::itimerval" = type { %"unix::timeval", %"unix::timeval" }
%"unix::tms" = type { i64, i64, i64, i64 }
%"unix::servent" = type { ptr, ptr, i32, [1 x i32], ptr }
%"unix::protoent" = type { ptr, ptr, i32, [1 x i32] }
%"unix::linux_like::in_addr" = type { i32 }
%"unix::linux_like::ip_mreq" = type { %"unix::linux_like::in_addr", %"unix::linux_like::in_addr" }
%"unix::linux_like::ip_mreqn" = type { %"unix::linux_like::in_addr", %"unix::linux_like::in_addr", i32 }
%"unix::linux_like::ip_mreq_source" = type { %"unix::linux_like::in_addr", %"unix::linux_like::in_addr", %"unix::linux_like::in_addr" }
%"unix::linux_like::sockaddr" = type { i16, [14 x i8] }
%"unix::linux_like::sockaddr_in" = type { i16, i16, %"unix::linux_like::in_addr", [8 x i8] }

!0 = !{i32 8, !"PIC Level", i32 2}
!1 = !{i32 2, !"RtLibUseGOT", i32 1}
!2 = !{i32 2, !"Dwarf Version", i32 4}
!3 = !{i32 2, !"Debug Info Version", i32 3}
!4 = !{!"rustc version 1.77.0 (aedd173a2 2024-03-17)"}
!5 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !6, producer: "clang LLVM (rustc version 1.77.0 (aedd173a2 2024-03-17))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !7, splitDebugInlining: false, nameTableKind: None)
!6 = !DIFile(filename: "/users/zyuxuan/.cargo/registry/src/index.crates.io-6f17d22bba15001f/libc-0.2.153/src/lib.rs/@/libc.7a53854ec7447607-cgu.0", directory: "/users/zyuxuan/.cargo/registry/src/index.crates.io-6f17d22bba15001f/libc-0.2.153")
!7 = !{!8}
!8 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_void", scope: !10, file: !9, baseType: !12, size: 8, align: 8, flags: DIFlagEnumClass, elements: !13)
!9 = !DIFile(filename: "<unknown>", directory: "")
!10 = !DINamespace(name: "ffi", scope: !11)
!11 = !DINamespace(name: "core", scope: null)
!12 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!13 = !{!14, !15}
!14 = !DIEnumerator(name: "__variant1", value: 0, isUnsigned: true)
!15 = !DIEnumerator(name: "__variant2", value: 1, isUnsigned: true)
!16 = distinct !DISubprogram(name: "clone", linkageName: "_ZN56_$LT$libc..unix..group$u20$as$u20$core..clone..Clone$GT$5clone17h244c1cb8665fe950E", scope: !18, file: !17, line: 83, type: !21, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, templateParams: !33, retainedNodes: !35)
!17 = !DIFile(filename: "src/macros.rs", directory: "/users/zyuxuan/.cargo/registry/src/index.crates.io-6f17d22bba15001f/libc-0.2.153", checksumkind: CSK_MD5, checksum: "796806da1a42f7ae26415c7276ee62b1")
!18 = !DINamespace(name: "{impl#1}", scope: !19)
!19 = !DINamespace(name: "unix", scope: !20)
!20 = !DINamespace(name: "libc", scope: null)
!21 = !DISubroutineType(types: !22)
!22 = !{!23, !34}
!23 = !DICompositeType(tag: DW_TAG_structure_type, name: "group", scope: !19, file: !9, size: 256, align: 64, flags: DIFlagPublic, elements: !24, templateParams: !33, identifier: "ec983a55f29fbd0ebcacff16fa3e5f27")
!24 = !{!25, !28, !29, !31}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "gr_name", scope: !23, file: !9, baseType: !26, size: 64, align: 64, flags: DIFlagPublic)
!26 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut i8", baseType: !27, size: 64, align: 64, dwarfAddressSpace: 0)
!27 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!28 = !DIDerivedType(tag: DW_TAG_member, name: "gr_passwd", scope: !23, file: !9, baseType: !26, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "gr_gid", scope: !23, file: !9, baseType: !30, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!30 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "gr_mem", scope: !23, file: !9, baseType: !32, size: 64, align: 64, offset: 192, flags: DIFlagPublic)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut *mut i8", baseType: !26, size: 64, align: 64, dwarfAddressSpace: 0)
!33 = !{}
!34 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::group", baseType: !23, size: 64, align: 64, dwarfAddressSpace: 0)
!35 = !{!36}
!36 = !DILocalVariable(name: "self", arg: 1, scope: !16, file: !17, line: 83, type: !34)
!37 = !DILocation(line: 83, column: 22, scope: !16)
!38 = !DILocation(line: 83, column: 37, scope: !16)
!39 = !DILocation(line: 83, column: 44, scope: !16)
!40 = distinct !DISubprogram(name: "clone", linkageName: "_ZN58_$LT$libc..unix..utimbuf$u20$as$u20$core..clone..Clone$GT$5clone17h68dc581f98bcc704E", scope: !41, file: !17, line: 83, type: !42, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, templateParams: !33, retainedNodes: !50)
!41 = !DINamespace(name: "{impl#3}", scope: !19)
!42 = !DISubroutineType(types: !43)
!43 = !{!44, !49}
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "utimbuf", scope: !19, file: !9, size: 128, align: 64, flags: DIFlagPublic, elements: !45, templateParams: !33, identifier: "f21325609d257e6fa2ed5ae9f4e5d5b8")
!45 = !{!46, !48}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "actime", scope: !44, file: !9, baseType: !47, size: 64, align: 64, flags: DIFlagPublic)
!47 = !DIBasicType(name: "i64", size: 64, encoding: DW_ATE_signed)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "modtime", scope: !44, file: !9, baseType: !47, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::utimbuf", baseType: !44, size: 64, align: 64, dwarfAddressSpace: 0)
!50 = !{!51}
!51 = !DILocalVariable(name: "self", arg: 1, scope: !40, file: !17, line: 83, type: !49)
!52 = !DILocation(line: 83, column: 22, scope: !40)
!53 = !DILocation(line: 83, column: 37, scope: !40)
!54 = !DILocation(line: 83, column: 44, scope: !40)
!55 = distinct !DISubprogram(name: "clone", linkageName: "_ZN58_$LT$libc..unix..timeval$u20$as$u20$core..clone..Clone$GT$5clone17h2d70929b22373a38E", scope: !56, file: !17, line: 83, type: !57, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, templateParams: !33, retainedNodes: !64)
!56 = !DINamespace(name: "{impl#5}", scope: !19)
!57 = !DISubroutineType(types: !58)
!58 = !{!59, !63}
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "timeval", scope: !19, file: !9, size: 128, align: 64, flags: DIFlagPublic, elements: !60, templateParams: !33, identifier: "7e1ea4da4dcb58b1897092dc39bc5742")
!60 = !{!61, !62}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !59, file: !9, baseType: !47, size: 64, align: 64, flags: DIFlagPublic)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "tv_usec", scope: !59, file: !9, baseType: !47, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::timeval", baseType: !59, size: 64, align: 64, dwarfAddressSpace: 0)
!64 = !{!65}
!65 = !DILocalVariable(name: "self", arg: 1, scope: !55, file: !17, line: 83, type: !63)
!66 = !DILocation(line: 83, column: 22, scope: !55)
!67 = !DILocation(line: 83, column: 37, scope: !55)
!68 = !DILocation(line: 83, column: 44, scope: !55)
!69 = distinct !DISubprogram(name: "clone", linkageName: "_ZN59_$LT$libc..unix..timespec$u20$as$u20$core..clone..Clone$GT$5clone17h1d559fcb683e27aaE", scope: !70, file: !17, line: 83, type: !71, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, templateParams: !33, retainedNodes: !78)
!70 = !DINamespace(name: "{impl#7}", scope: !19)
!71 = !DISubroutineType(types: !72)
!72 = !{!73, !77}
!73 = !DICompositeType(tag: DW_TAG_structure_type, name: "timespec", scope: !19, file: !9, size: 128, align: 64, flags: DIFlagPublic, elements: !74, templateParams: !33, identifier: "d8f4cfb2a29e6f3fdb87c6b687b53e5b")
!74 = !{!75, !76}
!75 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !73, file: !9, baseType: !47, size: 64, align: 64, flags: DIFlagPublic)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !73, file: !9, baseType: !47, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::timespec", baseType: !73, size: 64, align: 64, dwarfAddressSpace: 0)
!78 = !{!79}
!79 = !DILocalVariable(name: "self", arg: 1, scope: !69, file: !17, line: 83, type: !77)
!80 = !DILocation(line: 83, column: 22, scope: !69)
!81 = !DILocation(line: 83, column: 37, scope: !69)
!82 = !DILocation(line: 83, column: 44, scope: !69)
!83 = distinct !DISubprogram(name: "clone", linkageName: "_ZN57_$LT$libc..unix..rlimit$u20$as$u20$core..clone..Clone$GT$5clone17hb6d1c8233824c8fbE", scope: !84, file: !17, line: 83, type: !85, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, templateParams: !33, retainedNodes: !93)
!84 = !DINamespace(name: "{impl#9}", scope: !19)
!85 = !DISubroutineType(types: !86)
!86 = !{!87, !92}
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "rlimit", scope: !19, file: !9, size: 128, align: 64, flags: DIFlagPublic, elements: !88, templateParams: !33, identifier: "e13fe41f4bf29c0fc721ada122029eda")
!88 = !{!89, !91}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "rlim_cur", scope: !87, file: !9, baseType: !90, size: 64, align: 64, flags: DIFlagPublic)
!90 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "rlim_max", scope: !87, file: !9, baseType: !90, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!92 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::rlimit", baseType: !87, size: 64, align: 64, dwarfAddressSpace: 0)
!93 = !{!94}
!94 = !DILocalVariable(name: "self", arg: 1, scope: !83, file: !17, line: 83, type: !92)
!95 = !DILocation(line: 83, column: 22, scope: !83)
!96 = !DILocation(line: 83, column: 37, scope: !83)
!97 = !DILocation(line: 83, column: 44, scope: !83)
!98 = distinct !DISubprogram(name: "clone", linkageName: "_ZN57_$LT$libc..unix..rusage$u20$as$u20$core..clone..Clone$GT$5clone17h6840675990037ea1E", scope: !99, file: !17, line: 83, type: !100, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, templateParams: !33, retainedNodes: !121)
!99 = !DINamespace(name: "{impl#11}", scope: !19)
!100 = !DISubroutineType(types: !101)
!101 = !{!102, !120}
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "rusage", scope: !19, file: !9, size: 1152, align: 64, flags: DIFlagPublic, elements: !103, templateParams: !33, identifier: "e4855fc15c6074084d54d7240d87d0de")
!103 = !{!104, !105, !106, !107, !108, !109, !110, !111, !112, !113, !114, !115, !116, !117, !118, !119}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "ru_utime", scope: !102, file: !9, baseType: !59, size: 128, align: 64, flags: DIFlagPublic)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "ru_stime", scope: !102, file: !9, baseType: !59, size: 128, align: 64, offset: 128, flags: DIFlagPublic)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "ru_maxrss", scope: !102, file: !9, baseType: !47, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "ru_ixrss", scope: !102, file: !9, baseType: !47, size: 64, align: 64, offset: 320, flags: DIFlagPublic)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "ru_idrss", scope: !102, file: !9, baseType: !47, size: 64, align: 64, offset: 384, flags: DIFlagPublic)
!109 = !DIDerivedType(tag: DW_TAG_member, name: "ru_isrss", scope: !102, file: !9, baseType: !47, size: 64, align: 64, offset: 448, flags: DIFlagPublic)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "ru_minflt", scope: !102, file: !9, baseType: !47, size: 64, align: 64, offset: 512, flags: DIFlagPublic)
!111 = !DIDerivedType(tag: DW_TAG_member, name: "ru_majflt", scope: !102, file: !9, baseType: !47, size: 64, align: 64, offset: 576, flags: DIFlagPublic)
!112 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nswap", scope: !102, file: !9, baseType: !47, size: 64, align: 64, offset: 640, flags: DIFlagPublic)
!113 = !DIDerivedType(tag: DW_TAG_member, name: "ru_inblock", scope: !102, file: !9, baseType: !47, size: 64, align: 64, offset: 704, flags: DIFlagPublic)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "ru_oublock", scope: !102, file: !9, baseType: !47, size: 64, align: 64, offset: 768, flags: DIFlagPublic)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "ru_msgsnd", scope: !102, file: !9, baseType: !47, size: 64, align: 64, offset: 832, flags: DIFlagPublic)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "ru_msgrcv", scope: !102, file: !9, baseType: !47, size: 64, align: 64, offset: 896, flags: DIFlagPublic)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nsignals", scope: !102, file: !9, baseType: !47, size: 64, align: 64, offset: 960, flags: DIFlagPublic)
!118 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nvcsw", scope: !102, file: !9, baseType: !47, size: 64, align: 64, offset: 1024, flags: DIFlagPublic)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "ru_nivcsw", scope: !102, file: !9, baseType: !47, size: 64, align: 64, offset: 1088, flags: DIFlagPublic)
!120 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::rusage", baseType: !102, size: 64, align: 64, dwarfAddressSpace: 0)
!121 = !{!122}
!122 = !DILocalVariable(name: "self", arg: 1, scope: !98, file: !17, line: 83, type: !120)
!123 = !DILocation(line: 83, column: 22, scope: !98)
!124 = !DILocation(line: 83, column: 37, scope: !98)
!125 = !DILocation(line: 83, column: 44, scope: !98)
!126 = distinct !DISubprogram(name: "clone", linkageName: "_ZN60_$LT$libc..unix..ipv6_mreq$u20$as$u20$core..clone..Clone$GT$5clone17hae8c47b1ff2debeeE", scope: !127, file: !17, line: 83, type: !128, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, templateParams: !33, retainedNodes: !142)
!127 = !DINamespace(name: "{impl#13}", scope: !19)
!128 = !DISubroutineType(types: !129)
!129 = !{!130, !141}
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "ipv6_mreq", scope: !19, file: !9, size: 160, align: 32, flags: DIFlagPublic, elements: !131, templateParams: !33, identifier: "42d1ecf976efb086f0cbcf186d44320c")
!131 = !{!132, !140}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6mr_multiaddr", scope: !130, file: !9, baseType: !133, size: 128, align: 32, flags: DIFlagPublic)
!133 = !DICompositeType(tag: DW_TAG_structure_type, name: "in6_addr", scope: !134, file: !9, size: 128, align: 32, flags: DIFlagPublic, elements: !135, templateParams: !33, identifier: "b2cc6f36ad68d4788cd1dfa601846657")
!134 = !DINamespace(name: "align", scope: !19)
!135 = !{!136}
!136 = !DIDerivedType(tag: DW_TAG_member, name: "s6_addr", scope: !133, file: !9, baseType: !137, size: 128, align: 8, flags: DIFlagPublic)
!137 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 128, align: 8, elements: !138)
!138 = !{!139}
!139 = !DISubrange(count: 16, lowerBound: 0)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "ipv6mr_interface", scope: !130, file: !9, baseType: !30, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::ipv6_mreq", baseType: !130, size: 64, align: 64, dwarfAddressSpace: 0)
!142 = !{!143}
!143 = !DILocalVariable(name: "self", arg: 1, scope: !126, file: !17, line: 83, type: !141)
!144 = !DILocation(line: 83, column: 22, scope: !126)
!145 = !DILocation(line: 83, column: 37, scope: !126)
!146 = !DILocation(line: 83, column: 44, scope: !126)
!147 = distinct !DISubprogram(name: "clone", linkageName: "_ZN58_$LT$libc..unix..hostent$u20$as$u20$core..clone..Clone$GT$5clone17h660bbb8b5ddda4faE", scope: !148, file: !17, line: 83, type: !149, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, templateParams: !33, retainedNodes: !160)
!148 = !DINamespace(name: "{impl#15}", scope: !19)
!149 = !DISubroutineType(types: !150)
!150 = !{!151, !159}
!151 = !DICompositeType(tag: DW_TAG_structure_type, name: "hostent", scope: !19, file: !9, size: 256, align: 64, flags: DIFlagPublic, elements: !152, templateParams: !33, identifier: "6392d84ad03d20ff972030458665af31")
!152 = !{!153, !154, !155, !157, !158}
!153 = !DIDerivedType(tag: DW_TAG_member, name: "h_name", scope: !151, file: !9, baseType: !26, size: 64, align: 64, flags: DIFlagPublic)
!154 = !DIDerivedType(tag: DW_TAG_member, name: "h_aliases", scope: !151, file: !9, baseType: !32, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!155 = !DIDerivedType(tag: DW_TAG_member, name: "h_addrtype", scope: !151, file: !9, baseType: !156, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!156 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!157 = !DIDerivedType(tag: DW_TAG_member, name: "h_length", scope: !151, file: !9, baseType: !156, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "h_addr_list", scope: !151, file: !9, baseType: !32, size: 64, align: 64, offset: 192, flags: DIFlagPublic)
!159 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::hostent", baseType: !151, size: 64, align: 64, dwarfAddressSpace: 0)
!160 = !{!161}
!161 = !DILocalVariable(name: "self", arg: 1, scope: !147, file: !17, line: 83, type: !159)
!162 = !DILocation(line: 83, column: 22, scope: !147)
!163 = !DILocation(line: 83, column: 37, scope: !147)
!164 = !DILocation(line: 83, column: 44, scope: !147)
!165 = distinct !DISubprogram(name: "clone", linkageName: "_ZN56_$LT$libc..unix..iovec$u20$as$u20$core..clone..Clone$GT$5clone17h89220a5f7458e816E", scope: !166, file: !17, line: 83, type: !167, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, templateParams: !33, retainedNodes: !176)
!166 = !DINamespace(name: "{impl#17}", scope: !19)
!167 = !DISubroutineType(types: !168)
!168 = !{!169, !175}
!169 = !DICompositeType(tag: DW_TAG_structure_type, name: "iovec", scope: !19, file: !9, size: 128, align: 64, flags: DIFlagPublic, elements: !170, templateParams: !33, identifier: "f268754b86898d077288efd24d71f580")
!170 = !{!171, !173}
!171 = !DIDerivedType(tag: DW_TAG_member, name: "iov_base", scope: !169, file: !9, baseType: !172, size: 64, align: 64, flags: DIFlagPublic)
!172 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut core::ffi::c_void", baseType: !8, size: 64, align: 64, dwarfAddressSpace: 0)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "iov_len", scope: !169, file: !9, baseType: !174, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!174 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!175 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::iovec", baseType: !169, size: 64, align: 64, dwarfAddressSpace: 0)
!176 = !{!177}
!177 = !DILocalVariable(name: "self", arg: 1, scope: !165, file: !17, line: 83, type: !175)
!178 = !DILocation(line: 83, column: 22, scope: !165)
!179 = !DILocation(line: 83, column: 37, scope: !165)
!180 = !DILocation(line: 83, column: 44, scope: !165)
!181 = distinct !DISubprogram(name: "clone", linkageName: "_ZN57_$LT$libc..unix..pollfd$u20$as$u20$core..clone..Clone$GT$5clone17hb9df20627461a5c6E", scope: !182, file: !17, line: 83, type: !183, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, templateParams: !33, retainedNodes: !192)
!182 = !DINamespace(name: "{impl#19}", scope: !19)
!183 = !DISubroutineType(types: !184)
!184 = !{!185, !191}
!185 = !DICompositeType(tag: DW_TAG_structure_type, name: "pollfd", scope: !19, file: !9, size: 64, align: 32, flags: DIFlagPublic, elements: !186, templateParams: !33, identifier: "cb6ab7240d2ae69ad3c2422bae303128")
!186 = !{!187, !188, !190}
!187 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !185, file: !9, baseType: !156, size: 32, align: 32, flags: DIFlagPublic)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !185, file: !9, baseType: !189, size: 16, align: 16, offset: 32, flags: DIFlagPublic)
!189 = !DIBasicType(name: "i16", size: 16, encoding: DW_ATE_signed)
!190 = !DIDerivedType(tag: DW_TAG_member, name: "revents", scope: !185, file: !9, baseType: !189, size: 16, align: 16, offset: 48, flags: DIFlagPublic)
!191 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::pollfd", baseType: !185, size: 64, align: 64, dwarfAddressSpace: 0)
!192 = !{!193}
!193 = !DILocalVariable(name: "self", arg: 1, scope: !181, file: !17, line: 83, type: !191)
!194 = !DILocation(line: 83, column: 22, scope: !181)
!195 = !DILocation(line: 83, column: 37, scope: !181)
!196 = !DILocation(line: 83, column: 44, scope: !181)
!197 = distinct !DISubprogram(name: "clone", linkageName: "_ZN58_$LT$libc..unix..winsize$u20$as$u20$core..clone..Clone$GT$5clone17h3474fee6fbdac1d3E", scope: !198, file: !17, line: 83, type: !199, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, templateParams: !33, retainedNodes: !209)
!198 = !DINamespace(name: "{impl#21}", scope: !19)
!199 = !DISubroutineType(types: !200)
!200 = !{!201, !208}
!201 = !DICompositeType(tag: DW_TAG_structure_type, name: "winsize", scope: !19, file: !9, size: 64, align: 16, flags: DIFlagPublic, elements: !202, templateParams: !33, identifier: "e0afa21ae5573b7f55c891bfe981b859")
!202 = !{!203, !205, !206, !207}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "ws_row", scope: !201, file: !9, baseType: !204, size: 16, align: 16, flags: DIFlagPublic)
!204 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "ws_col", scope: !201, file: !9, baseType: !204, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!206 = !DIDerivedType(tag: DW_TAG_member, name: "ws_xpixel", scope: !201, file: !9, baseType: !204, size: 16, align: 16, offset: 32, flags: DIFlagPublic)
!207 = !DIDerivedType(tag: DW_TAG_member, name: "ws_ypixel", scope: !201, file: !9, baseType: !204, size: 16, align: 16, offset: 48, flags: DIFlagPublic)
!208 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::winsize", baseType: !201, size: 64, align: 64, dwarfAddressSpace: 0)
!209 = !{!210}
!210 = !DILocalVariable(name: "self", arg: 1, scope: !197, file: !17, line: 83, type: !208)
!211 = !DILocation(line: 83, column: 22, scope: !197)
!212 = !DILocation(line: 83, column: 37, scope: !197)
!213 = !DILocation(line: 83, column: 44, scope: !197)
!214 = distinct !DISubprogram(name: "clone", linkageName: "_ZN57_$LT$libc..unix..linger$u20$as$u20$core..clone..Clone$GT$5clone17hc6b95756537d32a7E", scope: !215, file: !17, line: 83, type: !216, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, templateParams: !33, retainedNodes: !223)
!215 = !DINamespace(name: "{impl#23}", scope: !19)
!216 = !DISubroutineType(types: !217)
!217 = !{!218, !222}
!218 = !DICompositeType(tag: DW_TAG_structure_type, name: "linger", scope: !19, file: !9, size: 64, align: 32, flags: DIFlagPublic, elements: !219, templateParams: !33, identifier: "433ff38e447da308c135a0a446c7239f")
!219 = !{!220, !221}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "l_onoff", scope: !218, file: !9, baseType: !156, size: 32, align: 32, flags: DIFlagPublic)
!221 = !DIDerivedType(tag: DW_TAG_member, name: "l_linger", scope: !218, file: !9, baseType: !156, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!222 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linger", baseType: !218, size: 64, align: 64, dwarfAddressSpace: 0)
!223 = !{!224}
!224 = !DILocalVariable(name: "self", arg: 1, scope: !214, file: !17, line: 83, type: !222)
!225 = !DILocation(line: 83, column: 22, scope: !214)
!226 = !DILocation(line: 83, column: 37, scope: !214)
!227 = !DILocation(line: 83, column: 44, scope: !214)
!228 = distinct !DISubprogram(name: "clone", linkageName: "_ZN57_$LT$libc..unix..sigval$u20$as$u20$core..clone..Clone$GT$5clone17h86bfbe239a8bddccE", scope: !229, file: !17, line: 83, type: !230, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, templateParams: !33, retainedNodes: !236)
!229 = !DINamespace(name: "{impl#25}", scope: !19)
!230 = !DISubroutineType(types: !231)
!231 = !{!232, !235}
!232 = !DICompositeType(tag: DW_TAG_structure_type, name: "sigval", scope: !19, file: !9, size: 64, align: 64, flags: DIFlagPublic, elements: !233, templateParams: !33, identifier: "588f238dd00d5182538032eec15bf809")
!233 = !{!234}
!234 = !DIDerivedType(tag: DW_TAG_member, name: "sival_ptr", scope: !232, file: !9, baseType: !172, size: 64, align: 64, flags: DIFlagPublic)
!235 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::sigval", baseType: !232, size: 64, align: 64, dwarfAddressSpace: 0)
!236 = !{!237}
!237 = !DILocalVariable(name: "self", arg: 1, scope: !228, file: !17, line: 83, type: !235)
!238 = !DILocation(line: 83, column: 22, scope: !228)
!239 = !DILocation(line: 83, column: 37, scope: !228)
!240 = !DILocation(line: 83, column: 44, scope: !228)
!241 = distinct !DISubprogram(name: "clone", linkageName: "_ZN60_$LT$libc..unix..itimerval$u20$as$u20$core..clone..Clone$GT$5clone17h4e64efac44b8c938E", scope: !242, file: !17, line: 83, type: !243, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, templateParams: !33, retainedNodes: !250)
!242 = !DINamespace(name: "{impl#27}", scope: !19)
!243 = !DISubroutineType(types: !244)
!244 = !{!245, !249}
!245 = !DICompositeType(tag: DW_TAG_structure_type, name: "itimerval", scope: !19, file: !9, size: 256, align: 64, flags: DIFlagPublic, elements: !246, templateParams: !33, identifier: "455790014dcc19e478baaddb12ab343b")
!246 = !{!247, !248}
!247 = !DIDerivedType(tag: DW_TAG_member, name: "it_interval", scope: !245, file: !9, baseType: !59, size: 128, align: 64, flags: DIFlagPublic)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "it_value", scope: !245, file: !9, baseType: !59, size: 128, align: 64, offset: 128, flags: DIFlagPublic)
!249 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::itimerval", baseType: !245, size: 64, align: 64, dwarfAddressSpace: 0)
!250 = !{!251}
!251 = !DILocalVariable(name: "self", arg: 1, scope: !241, file: !17, line: 83, type: !249)
!252 = !DILocation(line: 83, column: 22, scope: !241)
!253 = !DILocation(line: 83, column: 37, scope: !241)
!254 = !DILocation(line: 83, column: 44, scope: !241)
!255 = distinct !DISubprogram(name: "clone", linkageName: "_ZN54_$LT$libc..unix..tms$u20$as$u20$core..clone..Clone$GT$5clone17hdfe11705de206575E", scope: !256, file: !17, line: 83, type: !257, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, templateParams: !33, retainedNodes: !266)
!256 = !DINamespace(name: "{impl#29}", scope: !19)
!257 = !DISubroutineType(types: !258)
!258 = !{!259, !265}
!259 = !DICompositeType(tag: DW_TAG_structure_type, name: "tms", scope: !19, file: !9, size: 256, align: 64, flags: DIFlagPublic, elements: !260, templateParams: !33, identifier: "e92dbee87184a54891dc37d2949d8cbd")
!260 = !{!261, !262, !263, !264}
!261 = !DIDerivedType(tag: DW_TAG_member, name: "tms_utime", scope: !259, file: !9, baseType: !47, size: 64, align: 64, flags: DIFlagPublic)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "tms_stime", scope: !259, file: !9, baseType: !47, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "tms_cutime", scope: !259, file: !9, baseType: !47, size: 64, align: 64, offset: 128, flags: DIFlagPublic)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "tms_cstime", scope: !259, file: !9, baseType: !47, size: 64, align: 64, offset: 192, flags: DIFlagPublic)
!265 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::tms", baseType: !259, size: 64, align: 64, dwarfAddressSpace: 0)
!266 = !{!267}
!267 = !DILocalVariable(name: "self", arg: 1, scope: !255, file: !17, line: 83, type: !265)
!268 = !DILocation(line: 83, column: 22, scope: !255)
!269 = !DILocation(line: 83, column: 37, scope: !255)
!270 = !DILocation(line: 83, column: 44, scope: !255)
!271 = distinct !DISubprogram(name: "clone", linkageName: "_ZN58_$LT$libc..unix..servent$u20$as$u20$core..clone..Clone$GT$5clone17h9748f1cc49782a2fE", scope: !272, file: !17, line: 83, type: !273, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, templateParams: !33, retainedNodes: !282)
!272 = !DINamespace(name: "{impl#31}", scope: !19)
!273 = !DISubroutineType(types: !274)
!274 = !{!275, !281}
!275 = !DICompositeType(tag: DW_TAG_structure_type, name: "servent", scope: !19, file: !9, size: 256, align: 64, flags: DIFlagPublic, elements: !276, templateParams: !33, identifier: "b80062706eb0ae08c3eaea855db3c034")
!276 = !{!277, !278, !279, !280}
!277 = !DIDerivedType(tag: DW_TAG_member, name: "s_name", scope: !275, file: !9, baseType: !26, size: 64, align: 64, flags: DIFlagPublic)
!278 = !DIDerivedType(tag: DW_TAG_member, name: "s_aliases", scope: !275, file: !9, baseType: !32, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "s_port", scope: !275, file: !9, baseType: !156, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "s_proto", scope: !275, file: !9, baseType: !26, size: 64, align: 64, offset: 192, flags: DIFlagPublic)
!281 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::servent", baseType: !275, size: 64, align: 64, dwarfAddressSpace: 0)
!282 = !{!283}
!283 = !DILocalVariable(name: "self", arg: 1, scope: !271, file: !17, line: 83, type: !281)
!284 = !DILocation(line: 83, column: 22, scope: !271)
!285 = !DILocation(line: 83, column: 37, scope: !271)
!286 = !DILocation(line: 83, column: 44, scope: !271)
!287 = distinct !DISubprogram(name: "clone", linkageName: "_ZN59_$LT$libc..unix..protoent$u20$as$u20$core..clone..Clone$GT$5clone17hd641fccfe35ebef0E", scope: !288, file: !17, line: 83, type: !289, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, templateParams: !33, retainedNodes: !297)
!288 = !DINamespace(name: "{impl#33}", scope: !19)
!289 = !DISubroutineType(types: !290)
!290 = !{!291, !296}
!291 = !DICompositeType(tag: DW_TAG_structure_type, name: "protoent", scope: !19, file: !9, size: 192, align: 64, flags: DIFlagPublic, elements: !292, templateParams: !33, identifier: "ab7f54a1a7ffe81f4b6ad78513202a41")
!292 = !{!293, !294, !295}
!293 = !DIDerivedType(tag: DW_TAG_member, name: "p_name", scope: !291, file: !9, baseType: !26, size: 64, align: 64, flags: DIFlagPublic)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "p_aliases", scope: !291, file: !9, baseType: !32, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!295 = !DIDerivedType(tag: DW_TAG_member, name: "p_proto", scope: !291, file: !9, baseType: !156, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!296 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::protoent", baseType: !291, size: 64, align: 64, dwarfAddressSpace: 0)
!297 = !{!298}
!298 = !DILocalVariable(name: "self", arg: 1, scope: !287, file: !17, line: 83, type: !296)
!299 = !DILocation(line: 83, column: 22, scope: !287)
!300 = !DILocation(line: 83, column: 37, scope: !287)
!301 = !DILocation(line: 83, column: 44, scope: !287)
!302 = distinct !DISubprogram(name: "clone", linkageName: "_ZN70_$LT$libc..unix..linux_like..in_addr$u20$as$u20$core..clone..Clone$GT$5clone17h2e494273789ea04aE", scope: !303, file: !17, line: 83, type: !305, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, templateParams: !33, retainedNodes: !311)
!303 = !DINamespace(name: "{impl#1}", scope: !304)
!304 = !DINamespace(name: "linux_like", scope: !19)
!305 = !DISubroutineType(types: !306)
!306 = !{!307, !310}
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "in_addr", scope: !304, file: !9, size: 32, align: 32, flags: DIFlagPublic, elements: !308, templateParams: !33, identifier: "474c8526c54bdc1bec9a80ea4a1492c4")
!308 = !{!309}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "s_addr", scope: !307, file: !9, baseType: !30, size: 32, align: 32, flags: DIFlagPublic)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::in_addr", baseType: !307, size: 64, align: 64, dwarfAddressSpace: 0)
!311 = !{!312}
!312 = !DILocalVariable(name: "self", arg: 1, scope: !302, file: !17, line: 83, type: !310)
!313 = !DILocation(line: 83, column: 22, scope: !302)
!314 = !DILocation(line: 83, column: 37, scope: !302)
!315 = !DILocation(line: 83, column: 44, scope: !302)
!316 = distinct !DISubprogram(name: "clone", linkageName: "_ZN70_$LT$libc..unix..linux_like..ip_mreq$u20$as$u20$core..clone..Clone$GT$5clone17h1c85230011c15beaE", scope: !317, file: !17, line: 83, type: !318, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, templateParams: !33, retainedNodes: !325)
!317 = !DINamespace(name: "{impl#3}", scope: !304)
!318 = !DISubroutineType(types: !319)
!319 = !{!320, !324}
!320 = !DICompositeType(tag: DW_TAG_structure_type, name: "ip_mreq", scope: !304, file: !9, size: 64, align: 32, flags: DIFlagPublic, elements: !321, templateParams: !33, identifier: "cf36ea15ab9ea19add13a2d663442dc")
!321 = !{!322, !323}
!322 = !DIDerivedType(tag: DW_TAG_member, name: "imr_multiaddr", scope: !320, file: !9, baseType: !307, size: 32, align: 32, flags: DIFlagPublic)
!323 = !DIDerivedType(tag: DW_TAG_member, name: "imr_interface", scope: !320, file: !9, baseType: !307, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!324 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::ip_mreq", baseType: !320, size: 64, align: 64, dwarfAddressSpace: 0)
!325 = !{!326}
!326 = !DILocalVariable(name: "self", arg: 1, scope: !316, file: !17, line: 83, type: !324)
!327 = !DILocation(line: 83, column: 22, scope: !316)
!328 = !DILocation(line: 83, column: 37, scope: !316)
!329 = !DILocation(line: 83, column: 44, scope: !316)
!330 = distinct !DISubprogram(name: "clone", linkageName: "_ZN71_$LT$libc..unix..linux_like..ip_mreqn$u20$as$u20$core..clone..Clone$GT$5clone17hfa09e70a4cfd76faE", scope: !331, file: !17, line: 83, type: !332, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, templateParams: !33, retainedNodes: !340)
!331 = !DINamespace(name: "{impl#5}", scope: !304)
!332 = !DISubroutineType(types: !333)
!333 = !{!334, !339}
!334 = !DICompositeType(tag: DW_TAG_structure_type, name: "ip_mreqn", scope: !304, file: !9, size: 96, align: 32, flags: DIFlagPublic, elements: !335, templateParams: !33, identifier: "a72546a47c65dd98b6ed54ecf3a94dc1")
!335 = !{!336, !337, !338}
!336 = !DIDerivedType(tag: DW_TAG_member, name: "imr_multiaddr", scope: !334, file: !9, baseType: !307, size: 32, align: 32, flags: DIFlagPublic)
!337 = !DIDerivedType(tag: DW_TAG_member, name: "imr_address", scope: !334, file: !9, baseType: !307, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!338 = !DIDerivedType(tag: DW_TAG_member, name: "imr_ifindex", scope: !334, file: !9, baseType: !156, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::ip_mreqn", baseType: !334, size: 64, align: 64, dwarfAddressSpace: 0)
!340 = !{!341}
!341 = !DILocalVariable(name: "self", arg: 1, scope: !330, file: !17, line: 83, type: !339)
!342 = !DILocation(line: 83, column: 22, scope: !330)
!343 = !DILocation(line: 83, column: 37, scope: !330)
!344 = !DILocation(line: 83, column: 44, scope: !330)
!345 = distinct !DISubprogram(name: "clone", linkageName: "_ZN77_$LT$libc..unix..linux_like..ip_mreq_source$u20$as$u20$core..clone..Clone$GT$5clone17h5ca3dac7c1600377E", scope: !346, file: !17, line: 83, type: !347, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, templateParams: !33, retainedNodes: !355)
!346 = !DINamespace(name: "{impl#7}", scope: !304)
!347 = !DISubroutineType(types: !348)
!348 = !{!349, !354}
!349 = !DICompositeType(tag: DW_TAG_structure_type, name: "ip_mreq_source", scope: !304, file: !9, size: 96, align: 32, flags: DIFlagPublic, elements: !350, templateParams: !33, identifier: "587c4d397e5a4db152b13642a38fd7bf")
!350 = !{!351, !352, !353}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "imr_multiaddr", scope: !349, file: !9, baseType: !307, size: 32, align: 32, flags: DIFlagPublic)
!352 = !DIDerivedType(tag: DW_TAG_member, name: "imr_interface", scope: !349, file: !9, baseType: !307, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!353 = !DIDerivedType(tag: DW_TAG_member, name: "imr_sourceaddr", scope: !349, file: !9, baseType: !307, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!354 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::ip_mreq_source", baseType: !349, size: 64, align: 64, dwarfAddressSpace: 0)
!355 = !{!356}
!356 = !DILocalVariable(name: "self", arg: 1, scope: !345, file: !17, line: 83, type: !354)
!357 = !DILocation(line: 83, column: 22, scope: !345)
!358 = !DILocation(line: 83, column: 37, scope: !345)
!359 = !DILocation(line: 83, column: 44, scope: !345)
!360 = distinct !DISubprogram(name: "clone", linkageName: "_ZN71_$LT$libc..unix..linux_like..sockaddr$u20$as$u20$core..clone..Clone$GT$5clone17hdfaabb3a224c98ffE", scope: !361, file: !17, line: 83, type: !362, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, templateParams: !33, retainedNodes: !372)
!361 = !DINamespace(name: "{impl#9}", scope: !304)
!362 = !DISubroutineType(types: !363)
!363 = !{!364, !371}
!364 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr", scope: !304, file: !9, size: 128, align: 16, flags: DIFlagPublic, elements: !365, templateParams: !33, identifier: "9117d47757db9063e4af8edb3a8c891c")
!365 = !{!366, !367}
!366 = !DIDerivedType(tag: DW_TAG_member, name: "sa_family", scope: !364, file: !9, baseType: !204, size: 16, align: 16, flags: DIFlagPublic)
!367 = !DIDerivedType(tag: DW_TAG_member, name: "sa_data", scope: !364, file: !9, baseType: !368, size: 112, align: 8, offset: 16, flags: DIFlagPublic)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 112, align: 8, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 14, lowerBound: 0)
!371 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::sockaddr", baseType: !364, size: 64, align: 64, dwarfAddressSpace: 0)
!372 = !{!373}
!373 = !DILocalVariable(name: "self", arg: 1, scope: !360, file: !17, line: 83, type: !371)
!374 = !DILocation(line: 83, column: 22, scope: !360)
!375 = !DILocation(line: 83, column: 37, scope: !360)
!376 = !DILocation(line: 83, column: 44, scope: !360)
!377 = distinct !DISubprogram(name: "clone", linkageName: "_ZN74_$LT$libc..unix..linux_like..sockaddr_in$u20$as$u20$core..clone..Clone$GT$5clone17h5d13b251cd2dbecdE", scope: !378, file: !17, line: 83, type: !379, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, templateParams: !33, retainedNodes: !391)
!378 = !DINamespace(name: "{impl#11}", scope: !304)
!379 = !DISubroutineType(types: !380)
!380 = !{!381, !390}
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in", scope: !304, file: !9, size: 128, align: 32, flags: DIFlagPublic, elements: !382, templateParams: !33, identifier: "d71c0ca606b1a91a22646dff8c22959")
!382 = !{!383, !384, !385, !386}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "sin_family", scope: !381, file: !9, baseType: !204, size: 16, align: 16, flags: DIFlagPublic)
!384 = !DIDerivedType(tag: DW_TAG_member, name: "sin_port", scope: !381, file: !9, baseType: !204, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "sin_addr", scope: !381, file: !9, baseType: !307, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!386 = !DIDerivedType(tag: DW_TAG_member, name: "sin_zero", scope: !381, file: !9, baseType: !387, size: 64, align: 8, offset: 64, flags: DIFlagPublic)
!387 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 64, align: 8, elements: !388)
!388 = !{!389}
!389 = !DISubrange(count: 8, lowerBound: 0)
!390 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::sockaddr_in", baseType: !381, size: 64, align: 64, dwarfAddressSpace: 0)
!391 = !{!392}
!392 = !DILocalVariable(name: "self", arg: 1, scope: !377, file: !17, line: 83, type: !390)
!393 = !DILocation(line: 83, column: 22, scope: !377)
!394 = !DILocation(line: 83, column: 37, scope: !377)
!395 = !DILocation(line: 83, column: 44, scope: !377)
!396 = distinct !DISubprogram(name: "clone", linkageName: "_ZN75_$LT$libc..unix..linux_like..sockaddr_in6$u20$as$u20$core..clone..Clone$GT$5clone17hda5f5bb53fd578bdE", scope: !397, file: !17, line: 83, type: !398, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, templateParams: !33, retainedNodes: !408)
!397 = !DINamespace(name: "{impl#13}", scope: !304)
!398 = !DISubroutineType(types: !399)
!399 = !{!400, !407}
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_in6", scope: !304, file: !9, size: 224, align: 32, flags: DIFlagPublic, elements: !401, templateParams: !33, identifier: "d478a60b99cca1760946d6eb48f79d2")
!401 = !{!402, !403, !404, !405, !406}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_family", scope: !400, file: !9, baseType: !204, size: 16, align: 16, flags: DIFlagPublic)
!403 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_port", scope: !400, file: !9, baseType: !204, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_flowinfo", scope: !400, file: !9, baseType: !30, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_addr", scope: !400, file: !9, baseType: !133, size: 128, align: 32, offset: 64, flags: DIFlagPublic)
!406 = !DIDerivedType(tag: DW_TAG_member, name: "sin6_scope_id", scope: !400, file: !9, baseType: !30, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!407 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::sockaddr_in6", baseType: !400, size: 64, align: 64, dwarfAddressSpace: 0)
!408 = !{!409}
!409 = !DILocalVariable(name: "self", arg: 1, scope: !396, file: !17, line: 83, type: !407)
!410 = !DILocation(line: 83, column: 22, scope: !396)
!411 = !DILocation(line: 83, column: 37, scope: !396)
!412 = !DILocation(line: 83, column: 44, scope: !396)
!413 = distinct !DISubprogram(name: "clone", linkageName: "_ZN71_$LT$libc..unix..linux_like..addrinfo$u20$as$u20$core..clone..Clone$GT$5clone17h23a4ddfd611ea590E", scope: !414, file: !17, line: 83, type: !415, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, templateParams: !33, retainedNodes: !430)
!414 = !DINamespace(name: "{impl#15}", scope: !304)
!415 = !DISubroutineType(types: !416)
!416 = !{!417, !429}
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "addrinfo", scope: !304, file: !9, size: 384, align: 64, flags: DIFlagPublic, elements: !418, templateParams: !33, identifier: "b28fac1a2476466ffa57fe2d10560a97")
!418 = !{!419, !420, !421, !422, !423, !424, !426, !427}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "ai_flags", scope: !417, file: !9, baseType: !156, size: 32, align: 32, flags: DIFlagPublic)
!420 = !DIDerivedType(tag: DW_TAG_member, name: "ai_family", scope: !417, file: !9, baseType: !156, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "ai_socktype", scope: !417, file: !9, baseType: !156, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "ai_protocol", scope: !417, file: !9, baseType: !156, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addrlen", scope: !417, file: !9, baseType: !30, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "ai_addr", scope: !417, file: !9, baseType: !425, size: 64, align: 64, offset: 192, flags: DIFlagPublic)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut libc::unix::linux_like::sockaddr", baseType: !364, size: 64, align: 64, dwarfAddressSpace: 0)
!426 = !DIDerivedType(tag: DW_TAG_member, name: "ai_canonname", scope: !417, file: !9, baseType: !26, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "ai_next", scope: !417, file: !9, baseType: !428, size: 64, align: 64, offset: 320, flags: DIFlagPublic)
!428 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut libc::unix::linux_like::addrinfo", baseType: !417, size: 64, align: 64, dwarfAddressSpace: 0)
!429 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::addrinfo", baseType: !417, size: 64, align: 64, dwarfAddressSpace: 0)
!430 = !{!431}
!431 = !DILocalVariable(name: "self", arg: 1, scope: !413, file: !17, line: 83, type: !429)
!432 = !DILocation(line: 83, column: 22, scope: !413)
!433 = !DILocation(line: 83, column: 37, scope: !413)
!434 = !DILocation(line: 83, column: 44, scope: !413)
!435 = distinct !DISubprogram(name: "clone", linkageName: "_ZN74_$LT$libc..unix..linux_like..sockaddr_ll$u20$as$u20$core..clone..Clone$GT$5clone17hc3afa2b79145214dE", scope: !436, file: !17, line: 83, type: !437, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, templateParams: !33, retainedNodes: !449)
!436 = !DINamespace(name: "{impl#17}", scope: !304)
!437 = !DISubroutineType(types: !438)
!438 = !{!439, !448}
!439 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_ll", scope: !304, file: !9, size: 160, align: 32, flags: DIFlagPublic, elements: !440, templateParams: !33, identifier: "148d798077ab7e0f2d44dd4fa9d4683f")
!440 = !{!441, !442, !443, !444, !445, !446, !447}
!441 = !DIDerivedType(tag: DW_TAG_member, name: "sll_family", scope: !439, file: !9, baseType: !204, size: 16, align: 16, flags: DIFlagPublic)
!442 = !DIDerivedType(tag: DW_TAG_member, name: "sll_protocol", scope: !439, file: !9, baseType: !204, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "sll_ifindex", scope: !439, file: !9, baseType: !156, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "sll_hatype", scope: !439, file: !9, baseType: !204, size: 16, align: 16, offset: 64, flags: DIFlagPublic)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "sll_pkttype", scope: !439, file: !9, baseType: !12, size: 8, align: 8, offset: 80, flags: DIFlagPublic)
!446 = !DIDerivedType(tag: DW_TAG_member, name: "sll_halen", scope: !439, file: !9, baseType: !12, size: 8, align: 8, offset: 88, flags: DIFlagPublic)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "sll_addr", scope: !439, file: !9, baseType: !387, size: 64, align: 8, offset: 96, flags: DIFlagPublic)
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::sockaddr_ll", baseType: !439, size: 64, align: 64, dwarfAddressSpace: 0)
!449 = !{!450}
!450 = !DILocalVariable(name: "self", arg: 1, scope: !435, file: !17, line: 83, type: !448)
!451 = !DILocation(line: 83, column: 22, scope: !435)
!452 = !DILocation(line: 83, column: 37, scope: !435)
!453 = !DILocation(line: 83, column: 44, scope: !435)
!454 = distinct !DISubprogram(name: "clone", linkageName: "_ZN69_$LT$libc..unix..linux_like..fd_set$u20$as$u20$core..clone..Clone$GT$5clone17h9892aec1a603f5b2E", scope: !455, file: !17, line: 83, type: !456, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, templateParams: !33, retainedNodes: !463)
!455 = !DINamespace(name: "{impl#19}", scope: !304)
!456 = !DISubroutineType(types: !457)
!457 = !{!458, !462}
!458 = !DICompositeType(tag: DW_TAG_structure_type, name: "fd_set", scope: !304, file: !9, size: 1024, align: 64, flags: DIFlagPublic, elements: !459, templateParams: !33, identifier: "ce803cfe2d493ba3707dfc6cd064ad66")
!459 = !{!460}
!460 = !DIDerivedType(tag: DW_TAG_member, name: "fds_bits", scope: !458, file: !9, baseType: !461, size: 1024, align: 64, flags: DIFlagPrivate)
!461 = !DICompositeType(tag: DW_TAG_array_type, baseType: !90, size: 1024, align: 64, elements: !138)
!462 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::fd_set", baseType: !458, size: 64, align: 64, dwarfAddressSpace: 0)
!463 = !{!464}
!464 = !DILocalVariable(name: "self", arg: 1, scope: !454, file: !17, line: 83, type: !462)
!465 = !DILocation(line: 83, column: 22, scope: !454)
!466 = !DILocation(line: 83, column: 37, scope: !454)
!467 = !DILocation(line: 83, column: 44, scope: !454)
!468 = distinct !DISubprogram(name: "clone", linkageName: "_ZN65_$LT$libc..unix..linux_like..tm$u20$as$u20$core..clone..Clone$GT$5clone17h5f2ccfdfeb56a0a0E", scope: !469, file: !17, line: 83, type: !470, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, templateParams: !33, retainedNodes: !487)
!469 = !DINamespace(name: "{impl#21}", scope: !304)
!470 = !DISubroutineType(types: !471)
!471 = !{!472, !486}
!472 = !DICompositeType(tag: DW_TAG_structure_type, name: "tm", scope: !304, file: !9, size: 448, align: 64, flags: DIFlagPublic, elements: !473, templateParams: !33, identifier: "5d74163d4a7af893eda1e317005f8be4")
!473 = !{!474, !475, !476, !477, !478, !479, !480, !481, !482, !483, !484}
!474 = !DIDerivedType(tag: DW_TAG_member, name: "tm_sec", scope: !472, file: !9, baseType: !156, size: 32, align: 32, flags: DIFlagPublic)
!475 = !DIDerivedType(tag: DW_TAG_member, name: "tm_min", scope: !472, file: !9, baseType: !156, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "tm_hour", scope: !472, file: !9, baseType: !156, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mday", scope: !472, file: !9, baseType: !156, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "tm_mon", scope: !472, file: !9, baseType: !156, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "tm_year", scope: !472, file: !9, baseType: !156, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "tm_wday", scope: !472, file: !9, baseType: !156, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!481 = !DIDerivedType(tag: DW_TAG_member, name: "tm_yday", scope: !472, file: !9, baseType: !156, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "tm_isdst", scope: !472, file: !9, baseType: !156, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!483 = !DIDerivedType(tag: DW_TAG_member, name: "tm_gmtoff", scope: !472, file: !9, baseType: !47, size: 64, align: 64, offset: 320, flags: DIFlagPublic)
!484 = !DIDerivedType(tag: DW_TAG_member, name: "tm_zone", scope: !472, file: !9, baseType: !485, size: 64, align: 64, offset: 384, flags: DIFlagPublic)
!485 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const i8", baseType: !27, size: 64, align: 64, dwarfAddressSpace: 0)
!486 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::tm", baseType: !472, size: 64, align: 64, dwarfAddressSpace: 0)
!487 = !{!488}
!488 = !DILocalVariable(name: "self", arg: 1, scope: !468, file: !17, line: 83, type: !486)
!489 = !DILocation(line: 83, column: 22, scope: !468)
!490 = !DILocation(line: 83, column: 37, scope: !468)
!491 = !DILocation(line: 83, column: 44, scope: !468)
!492 = distinct !DISubprogram(name: "clone", linkageName: "_ZN74_$LT$libc..unix..linux_like..sched_param$u20$as$u20$core..clone..Clone$GT$5clone17hf6574159e0186fafE", scope: !493, file: !17, line: 83, type: !494, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, templateParams: !33, retainedNodes: !500)
!493 = !DINamespace(name: "{impl#23}", scope: !304)
!494 = !DISubroutineType(types: !495)
!495 = !{!496, !499}
!496 = !DICompositeType(tag: DW_TAG_structure_type, name: "sched_param", scope: !304, file: !9, size: 32, align: 32, flags: DIFlagPublic, elements: !497, templateParams: !33, identifier: "1175ffcc9855951e37b5b8b6243b301c")
!497 = !{!498}
!498 = !DIDerivedType(tag: DW_TAG_member, name: "sched_priority", scope: !496, file: !9, baseType: !156, size: 32, align: 32, flags: DIFlagPublic)
!499 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::sched_param", baseType: !496, size: 64, align: 64, dwarfAddressSpace: 0)
!500 = !{!501}
!501 = !DILocalVariable(name: "self", arg: 1, scope: !492, file: !17, line: 83, type: !499)
!502 = !DILocation(line: 83, column: 22, scope: !492)
!503 = !DILocation(line: 83, column: 37, scope: !492)
!504 = !DILocation(line: 83, column: 44, scope: !492)
!505 = distinct !DISubprogram(name: "clone", linkageName: "_ZN70_$LT$libc..unix..linux_like..Dl_info$u20$as$u20$core..clone..Clone$GT$5clone17hc214689aa67eac78E", scope: !506, file: !17, line: 83, type: !507, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, templateParams: !33, retainedNodes: !516)
!506 = !DINamespace(name: "{impl#25}", scope: !304)
!507 = !DISubroutineType(types: !508)
!508 = !{!509, !515}
!509 = !DICompositeType(tag: DW_TAG_structure_type, name: "Dl_info", scope: !304, file: !9, size: 256, align: 64, flags: DIFlagPublic, elements: !510, templateParams: !33, identifier: "cec9c2077726a8f5687e5236ee8e785c")
!510 = !{!511, !512, !513, !514}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "dli_fname", scope: !509, file: !9, baseType: !485, size: 64, align: 64, flags: DIFlagPublic)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "dli_fbase", scope: !509, file: !9, baseType: !172, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "dli_sname", scope: !509, file: !9, baseType: !485, size: 64, align: 64, offset: 128, flags: DIFlagPublic)
!514 = !DIDerivedType(tag: DW_TAG_member, name: "dli_saddr", scope: !509, file: !9, baseType: !172, size: 64, align: 64, offset: 192, flags: DIFlagPublic)
!515 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::Dl_info", baseType: !509, size: 64, align: 64, dwarfAddressSpace: 0)
!516 = !{!517}
!517 = !DILocalVariable(name: "self", arg: 1, scope: !505, file: !17, line: 83, type: !515)
!518 = !DILocation(line: 83, column: 22, scope: !505)
!519 = !DILocation(line: 83, column: 37, scope: !505)
!520 = !DILocation(line: 83, column: 44, scope: !505)
!521 = distinct !DISubprogram(name: "clone", linkageName: "_ZN68_$LT$libc..unix..linux_like..lconv$u20$as$u20$core..clone..Clone$GT$5clone17hba1341670469f395E", scope: !522, file: !17, line: 83, type: !523, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, templateParams: !33, retainedNodes: !552)
!522 = !DINamespace(name: "{impl#27}", scope: !304)
!523 = !DISubroutineType(types: !524)
!524 = !{!525, !551}
!525 = !DICompositeType(tag: DW_TAG_structure_type, name: "lconv", scope: !304, file: !9, size: 768, align: 64, flags: DIFlagPublic, elements: !526, templateParams: !33, identifier: "68ea7d6a9dbbc687be2af9cc718f858a")
!526 = !{!527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550}
!527 = !DIDerivedType(tag: DW_TAG_member, name: "decimal_point", scope: !525, file: !9, baseType: !26, size: 64, align: 64, flags: DIFlagPublic)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "thousands_sep", scope: !525, file: !9, baseType: !26, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "grouping", scope: !525, file: !9, baseType: !26, size: 64, align: 64, offset: 128, flags: DIFlagPublic)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "int_curr_symbol", scope: !525, file: !9, baseType: !26, size: 64, align: 64, offset: 192, flags: DIFlagPublic)
!531 = !DIDerivedType(tag: DW_TAG_member, name: "currency_symbol", scope: !525, file: !9, baseType: !26, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!532 = !DIDerivedType(tag: DW_TAG_member, name: "mon_decimal_point", scope: !525, file: !9, baseType: !26, size: 64, align: 64, offset: 320, flags: DIFlagPublic)
!533 = !DIDerivedType(tag: DW_TAG_member, name: "mon_thousands_sep", scope: !525, file: !9, baseType: !26, size: 64, align: 64, offset: 384, flags: DIFlagPublic)
!534 = !DIDerivedType(tag: DW_TAG_member, name: "mon_grouping", scope: !525, file: !9, baseType: !26, size: 64, align: 64, offset: 448, flags: DIFlagPublic)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "positive_sign", scope: !525, file: !9, baseType: !26, size: 64, align: 64, offset: 512, flags: DIFlagPublic)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "negative_sign", scope: !525, file: !9, baseType: !26, size: 64, align: 64, offset: 576, flags: DIFlagPublic)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "int_frac_digits", scope: !525, file: !9, baseType: !27, size: 8, align: 8, offset: 640, flags: DIFlagPublic)
!538 = !DIDerivedType(tag: DW_TAG_member, name: "frac_digits", scope: !525, file: !9, baseType: !27, size: 8, align: 8, offset: 648, flags: DIFlagPublic)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "p_cs_precedes", scope: !525, file: !9, baseType: !27, size: 8, align: 8, offset: 656, flags: DIFlagPublic)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "p_sep_by_space", scope: !525, file: !9, baseType: !27, size: 8, align: 8, offset: 664, flags: DIFlagPublic)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "n_cs_precedes", scope: !525, file: !9, baseType: !27, size: 8, align: 8, offset: 672, flags: DIFlagPublic)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "n_sep_by_space", scope: !525, file: !9, baseType: !27, size: 8, align: 8, offset: 680, flags: DIFlagPublic)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "p_sign_posn", scope: !525, file: !9, baseType: !27, size: 8, align: 8, offset: 688, flags: DIFlagPublic)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "n_sign_posn", scope: !525, file: !9, baseType: !27, size: 8, align: 8, offset: 696, flags: DIFlagPublic)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_cs_precedes", scope: !525, file: !9, baseType: !27, size: 8, align: 8, offset: 704, flags: DIFlagPublic)
!546 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sep_by_space", scope: !525, file: !9, baseType: !27, size: 8, align: 8, offset: 712, flags: DIFlagPublic)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_cs_precedes", scope: !525, file: !9, baseType: !27, size: 8, align: 8, offset: 720, flags: DIFlagPublic)
!548 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sep_by_space", scope: !525, file: !9, baseType: !27, size: 8, align: 8, offset: 728, flags: DIFlagPublic)
!549 = !DIDerivedType(tag: DW_TAG_member, name: "int_p_sign_posn", scope: !525, file: !9, baseType: !27, size: 8, align: 8, offset: 736, flags: DIFlagPublic)
!550 = !DIDerivedType(tag: DW_TAG_member, name: "int_n_sign_posn", scope: !525, file: !9, baseType: !27, size: 8, align: 8, offset: 744, flags: DIFlagPublic)
!551 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::lconv", baseType: !525, size: 64, align: 64, dwarfAddressSpace: 0)
!552 = !{!553}
!553 = !DILocalVariable(name: "self", arg: 1, scope: !521, file: !17, line: 83, type: !551)
!554 = !DILocation(line: 83, column: 22, scope: !521)
!555 = !DILocation(line: 83, column: 37, scope: !521)
!556 = !DILocation(line: 83, column: 44, scope: !521)
!557 = distinct !DISubprogram(name: "clone", linkageName: "_ZN73_$LT$libc..unix..linux_like..in_pktinfo$u20$as$u20$core..clone..Clone$GT$5clone17h9585e67db8ebe73dE", scope: !558, file: !17, line: 83, type: !559, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, templateParams: !33, retainedNodes: !567)
!558 = !DINamespace(name: "{impl#29}", scope: !304)
!559 = !DISubroutineType(types: !560)
!560 = !{!561, !566}
!561 = !DICompositeType(tag: DW_TAG_structure_type, name: "in_pktinfo", scope: !304, file: !9, size: 96, align: 32, flags: DIFlagPublic, elements: !562, templateParams: !33, identifier: "422365eae094e832588f4ffe66cc9d18")
!562 = !{!563, !564, !565}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "ipi_ifindex", scope: !561, file: !9, baseType: !156, size: 32, align: 32, flags: DIFlagPublic)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "ipi_spec_dst", scope: !561, file: !9, baseType: !307, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "ipi_addr", scope: !561, file: !9, baseType: !307, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::in_pktinfo", baseType: !561, size: 64, align: 64, dwarfAddressSpace: 0)
!567 = !{!568}
!568 = !DILocalVariable(name: "self", arg: 1, scope: !557, file: !17, line: 83, type: !566)
!569 = !DILocation(line: 83, column: 22, scope: !557)
!570 = !DILocation(line: 83, column: 37, scope: !557)
!571 = !DILocation(line: 83, column: 44, scope: !557)
!572 = distinct !DISubprogram(name: "clone", linkageName: "_ZN70_$LT$libc..unix..linux_like..ifaddrs$u20$as$u20$core..clone..Clone$GT$5clone17he6920648f9d28625E", scope: !573, file: !17, line: 83, type: !574, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, templateParams: !33, retainedNodes: !587)
!573 = !DINamespace(name: "{impl#31}", scope: !304)
!574 = !DISubroutineType(types: !575)
!575 = !{!576, !586}
!576 = !DICompositeType(tag: DW_TAG_structure_type, name: "ifaddrs", scope: !304, file: !9, size: 448, align: 64, flags: DIFlagPublic, elements: !577, templateParams: !33, identifier: "f4db071a4e3e09846b6223607d1f7457")
!577 = !{!578, !580, !581, !582, !583, !584, !585}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_next", scope: !576, file: !9, baseType: !579, size: 64, align: 64, flags: DIFlagPublic)
!579 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut libc::unix::linux_like::ifaddrs", baseType: !576, size: 64, align: 64, dwarfAddressSpace: 0)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_name", scope: !576, file: !9, baseType: !26, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_flags", scope: !576, file: !9, baseType: !30, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!582 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_addr", scope: !576, file: !9, baseType: !425, size: 64, align: 64, offset: 192, flags: DIFlagPublic)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_netmask", scope: !576, file: !9, baseType: !425, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_ifu", scope: !576, file: !9, baseType: !425, size: 64, align: 64, offset: 320, flags: DIFlagPublic)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "ifa_data", scope: !576, file: !9, baseType: !172, size: 64, align: 64, offset: 384, flags: DIFlagPublic)
!586 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::ifaddrs", baseType: !576, size: 64, align: 64, dwarfAddressSpace: 0)
!587 = !{!588}
!588 = !DILocalVariable(name: "self", arg: 1, scope: !572, file: !17, line: 83, type: !586)
!589 = !DILocation(line: 83, column: 22, scope: !572)
!590 = !DILocation(line: 83, column: 37, scope: !572)
!591 = !DILocation(line: 83, column: 44, scope: !572)
!592 = distinct !DISubprogram(name: "clone", linkageName: "_ZN72_$LT$libc..unix..linux_like..in6_rtmsg$u20$as$u20$core..clone..Clone$GT$5clone17hbd2ab36291bb65d5E", scope: !593, file: !17, line: 83, type: !594, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, templateParams: !33, retainedNodes: !609)
!593 = !DINamespace(name: "{impl#33}", scope: !304)
!594 = !DISubroutineType(types: !595)
!595 = !{!596, !608}
!596 = !DICompositeType(tag: DW_TAG_structure_type, name: "in6_rtmsg", scope: !304, file: !9, size: 640, align: 64, flags: DIFlagPublic, elements: !597, templateParams: !33, identifier: "725d70e2dd81cc4d72227d64ac964792")
!597 = !{!598, !599, !600, !601, !602, !603, !604, !605, !606, !607}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "rtmsg_dst", scope: !596, file: !9, baseType: !133, size: 128, align: 32, flags: DIFlagPrivate)
!599 = !DIDerivedType(tag: DW_TAG_member, name: "rtmsg_src", scope: !596, file: !9, baseType: !133, size: 128, align: 32, offset: 128, flags: DIFlagPrivate)
!600 = !DIDerivedType(tag: DW_TAG_member, name: "rtmsg_gateway", scope: !596, file: !9, baseType: !133, size: 128, align: 32, offset: 256, flags: DIFlagPrivate)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "rtmsg_type", scope: !596, file: !9, baseType: !30, size: 32, align: 32, offset: 384, flags: DIFlagPrivate)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "rtmsg_dst_len", scope: !596, file: !9, baseType: !204, size: 16, align: 16, offset: 416, flags: DIFlagPrivate)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "rtmsg_src_len", scope: !596, file: !9, baseType: !204, size: 16, align: 16, offset: 432, flags: DIFlagPrivate)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "rtmsg_metric", scope: !596, file: !9, baseType: !30, size: 32, align: 32, offset: 448, flags: DIFlagPrivate)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "rtmsg_info", scope: !596, file: !9, baseType: !90, size: 64, align: 64, offset: 512, flags: DIFlagPrivate)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "rtmsg_flags", scope: !596, file: !9, baseType: !30, size: 32, align: 32, offset: 576, flags: DIFlagPrivate)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "rtmsg_ifindex", scope: !596, file: !9, baseType: !156, size: 32, align: 32, offset: 608, flags: DIFlagPrivate)
!608 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::in6_rtmsg", baseType: !596, size: 64, align: 64, dwarfAddressSpace: 0)
!609 = !{!610}
!610 = !DILocalVariable(name: "self", arg: 1, scope: !592, file: !17, line: 83, type: !608)
!611 = !DILocation(line: 83, column: 22, scope: !592)
!612 = !DILocation(line: 83, column: 37, scope: !592)
!613 = !DILocation(line: 83, column: 44, scope: !592)
!614 = distinct !DISubprogram(name: "clone", linkageName: "_ZN69_$LT$libc..unix..linux_like..arpreq$u20$as$u20$core..clone..Clone$GT$5clone17hc243e3493794030bE", scope: !615, file: !17, line: 83, type: !616, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, templateParams: !33, retainedNodes: !627)
!615 = !DINamespace(name: "{impl#35}", scope: !304)
!616 = !DISubroutineType(types: !617)
!617 = !{!618, !626}
!618 = !DICompositeType(tag: DW_TAG_structure_type, name: "arpreq", scope: !304, file: !9, size: 544, align: 32, flags: DIFlagPublic, elements: !619, templateParams: !33, identifier: "dac9681a2fe364ff439bb7c008bb64b2")
!619 = !{!620, !621, !622, !623, !624}
!620 = !DIDerivedType(tag: DW_TAG_member, name: "arp_pa", scope: !618, file: !9, baseType: !364, size: 128, align: 16, flags: DIFlagPublic)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "arp_ha", scope: !618, file: !9, baseType: !364, size: 128, align: 16, offset: 128, flags: DIFlagPublic)
!622 = !DIDerivedType(tag: DW_TAG_member, name: "arp_flags", scope: !618, file: !9, baseType: !156, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "arp_netmask", scope: !618, file: !9, baseType: !364, size: 128, align: 16, offset: 288, flags: DIFlagPublic)
!624 = !DIDerivedType(tag: DW_TAG_member, name: "arp_dev", scope: !618, file: !9, baseType: !625, size: 128, align: 8, offset: 416, flags: DIFlagPublic)
!625 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 128, align: 8, elements: !138)
!626 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::arpreq", baseType: !618, size: 64, align: 64, dwarfAddressSpace: 0)
!627 = !{!628}
!628 = !DILocalVariable(name: "self", arg: 1, scope: !614, file: !17, line: 83, type: !626)
!629 = !DILocation(line: 83, column: 22, scope: !614)
!630 = !DILocation(line: 83, column: 37, scope: !614)
!631 = !DILocation(line: 83, column: 44, scope: !614)
!632 = distinct !DISubprogram(name: "clone", linkageName: "_ZN73_$LT$libc..unix..linux_like..arpreq_old$u20$as$u20$core..clone..Clone$GT$5clone17ha8e0db60d69a2a5bE", scope: !633, file: !17, line: 83, type: !634, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, templateParams: !33, retainedNodes: !643)
!633 = !DINamespace(name: "{impl#37}", scope: !304)
!634 = !DISubroutineType(types: !635)
!635 = !{!636, !642}
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: "arpreq_old", scope: !304, file: !9, size: 416, align: 32, flags: DIFlagPublic, elements: !637, templateParams: !33, identifier: "c719fbd8197c27f8ded1417551da915c")
!637 = !{!638, !639, !640, !641}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "arp_pa", scope: !636, file: !9, baseType: !364, size: 128, align: 16, flags: DIFlagPublic)
!639 = !DIDerivedType(tag: DW_TAG_member, name: "arp_ha", scope: !636, file: !9, baseType: !364, size: 128, align: 16, offset: 128, flags: DIFlagPublic)
!640 = !DIDerivedType(tag: DW_TAG_member, name: "arp_flags", scope: !636, file: !9, baseType: !156, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "arp_netmask", scope: !636, file: !9, baseType: !364, size: 128, align: 16, offset: 288, flags: DIFlagPublic)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::arpreq_old", baseType: !636, size: 64, align: 64, dwarfAddressSpace: 0)
!643 = !{!644}
!644 = !DILocalVariable(name: "self", arg: 1, scope: !632, file: !17, line: 83, type: !642)
!645 = !DILocation(line: 83, column: 22, scope: !632)
!646 = !DILocation(line: 83, column: 37, scope: !632)
!647 = !DILocation(line: 83, column: 44, scope: !632)
!648 = distinct !DISubprogram(name: "clone", linkageName: "_ZN69_$LT$libc..unix..linux_like..arphdr$u20$as$u20$core..clone..Clone$GT$5clone17hb18c12de39441bb7E", scope: !649, file: !17, line: 83, type: !650, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, templateParams: !33, retainedNodes: !660)
!649 = !DINamespace(name: "{impl#39}", scope: !304)
!650 = !DISubroutineType(types: !651)
!651 = !{!652, !659}
!652 = !DICompositeType(tag: DW_TAG_structure_type, name: "arphdr", scope: !304, file: !9, size: 64, align: 16, flags: DIFlagPublic, elements: !653, templateParams: !33, identifier: "95408305a15ca3e9ffd63c03c91570dd")
!653 = !{!654, !655, !656, !657, !658}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "ar_hrd", scope: !652, file: !9, baseType: !204, size: 16, align: 16, flags: DIFlagPublic)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "ar_pro", scope: !652, file: !9, baseType: !204, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!656 = !DIDerivedType(tag: DW_TAG_member, name: "ar_hln", scope: !652, file: !9, baseType: !12, size: 8, align: 8, offset: 32, flags: DIFlagPublic)
!657 = !DIDerivedType(tag: DW_TAG_member, name: "ar_pln", scope: !652, file: !9, baseType: !12, size: 8, align: 8, offset: 40, flags: DIFlagPublic)
!658 = !DIDerivedType(tag: DW_TAG_member, name: "ar_op", scope: !652, file: !9, baseType: !204, size: 16, align: 16, offset: 48, flags: DIFlagPublic)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::arphdr", baseType: !652, size: 64, align: 64, dwarfAddressSpace: 0)
!660 = !{!661}
!661 = !DILocalVariable(name: "self", arg: 1, scope: !648, file: !17, line: 83, type: !659)
!662 = !DILocation(line: 83, column: 22, scope: !648)
!663 = !DILocation(line: 83, column: 37, scope: !648)
!664 = !DILocation(line: 83, column: 44, scope: !648)
!665 = distinct !DISubprogram(name: "clone", linkageName: "_ZN70_$LT$libc..unix..linux_like..mmsghdr$u20$as$u20$core..clone..Clone$GT$5clone17h5bc8357bcac08600E", scope: !666, file: !17, line: 83, type: !667, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, templateParams: !33, retainedNodes: !686)
!666 = !DINamespace(name: "{impl#41}", scope: !304)
!667 = !DISubroutineType(types: !668)
!668 = !{!669, !685}
!669 = !DICompositeType(tag: DW_TAG_structure_type, name: "mmsghdr", scope: !304, file: !9, size: 512, align: 64, flags: DIFlagPublic, elements: !670, templateParams: !33, identifier: "b7d1c9a07bb8941c8f2de50106be2b05")
!670 = !{!671, !684}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "msg_hdr", scope: !669, file: !9, baseType: !672, size: 448, align: 64, flags: DIFlagPublic)
!672 = !DICompositeType(tag: DW_TAG_structure_type, name: "msghdr", scope: !673, file: !9, size: 448, align: 64, flags: DIFlagPublic, elements: !675, templateParams: !33, identifier: "2d2e540c661763e32201df0f14fcf473")
!673 = !DINamespace(name: "gnu", scope: !674)
!674 = !DINamespace(name: "linux", scope: !304)
!675 = !{!676, !677, !678, !680, !681, !682, !683}
!676 = !DIDerivedType(tag: DW_TAG_member, name: "msg_name", scope: !672, file: !9, baseType: !172, size: 64, align: 64, flags: DIFlagPublic)
!677 = !DIDerivedType(tag: DW_TAG_member, name: "msg_namelen", scope: !672, file: !9, baseType: !30, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!678 = !DIDerivedType(tag: DW_TAG_member, name: "msg_iov", scope: !672, file: !9, baseType: !679, size: 64, align: 64, offset: 128, flags: DIFlagPublic)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut libc::unix::iovec", baseType: !169, size: 64, align: 64, dwarfAddressSpace: 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "msg_iovlen", scope: !672, file: !9, baseType: !174, size: 64, align: 64, offset: 192, flags: DIFlagPublic)
!681 = !DIDerivedType(tag: DW_TAG_member, name: "msg_control", scope: !672, file: !9, baseType: !172, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!682 = !DIDerivedType(tag: DW_TAG_member, name: "msg_controllen", scope: !672, file: !9, baseType: !174, size: 64, align: 64, offset: 320, flags: DIFlagPublic)
!683 = !DIDerivedType(tag: DW_TAG_member, name: "msg_flags", scope: !672, file: !9, baseType: !156, size: 32, align: 32, offset: 384, flags: DIFlagPublic)
!684 = !DIDerivedType(tag: DW_TAG_member, name: "msg_len", scope: !669, file: !9, baseType: !30, size: 32, align: 32, offset: 448, flags: DIFlagPublic)
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::mmsghdr", baseType: !669, size: 64, align: 64, dwarfAddressSpace: 0)
!686 = !{!687}
!687 = !DILocalVariable(name: "self", arg: 1, scope: !665, file: !17, line: 83, type: !685)
!688 = !DILocation(line: 83, column: 22, scope: !665)
!689 = !DILocation(line: 83, column: 37, scope: !665)
!690 = !DILocation(line: 83, column: 44, scope: !665)
!691 = distinct !DISubprogram(name: "clone", linkageName: "_ZN74_$LT$libc..unix..linux_like..epoll_event$u20$as$u20$core..clone..Clone$GT$5clone17hf02d9702ce41446cE", scope: !692, file: !17, line: 118, type: !693, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, templateParams: !33, retainedNodes: !700)
!692 = !DINamespace(name: "{impl#43}", scope: !304)
!693 = !DISubroutineType(types: !694)
!694 = !{!695, !699}
!695 = !DICompositeType(tag: DW_TAG_structure_type, name: "epoll_event", scope: !304, file: !9, size: 96, align: 8, flags: DIFlagPublic, elements: !696, templateParams: !33, identifier: "d7c41a69e20633f110979de010dc063d")
!696 = !{!697, !698}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "events", scope: !695, file: !9, baseType: !30, size: 32, align: 32, flags: DIFlagPublic)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "u64", scope: !695, file: !9, baseType: !90, size: 64, align: 64, offset: 32, flags: DIFlagPublic)
!699 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::epoll_event", baseType: !695, size: 64, align: 64, dwarfAddressSpace: 0)
!700 = !{!701}
!701 = !DILocalVariable(name: "self", arg: 1, scope: !691, file: !17, line: 118, type: !699)
!702 = !DILocation(line: 118, column: 22, scope: !691)
!703 = !DILocation(line: 118, column: 37, scope: !691)
!704 = !DILocation(line: 118, column: 44, scope: !691)
!705 = distinct !DISubprogram(name: "clone", linkageName: "_ZN74_$LT$libc..unix..linux_like..sockaddr_un$u20$as$u20$core..clone..Clone$GT$5clone17h795dc6dcf8f67fb5E", scope: !706, file: !17, line: 118, type: !707, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, templateParams: !33, retainedNodes: !717)
!706 = !DINamespace(name: "{impl#45}", scope: !304)
!707 = !DISubroutineType(types: !708)
!708 = !{!709, !716}
!709 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_un", scope: !304, file: !9, size: 880, align: 16, flags: DIFlagPublic, elements: !710, templateParams: !33, identifier: "c844da60bd228fd1523944e86aabf027")
!710 = !{!711, !712}
!711 = !DIDerivedType(tag: DW_TAG_member, name: "sun_family", scope: !709, file: !9, baseType: !204, size: 16, align: 16, flags: DIFlagPublic)
!712 = !DIDerivedType(tag: DW_TAG_member, name: "sun_path", scope: !709, file: !9, baseType: !713, size: 864, align: 8, offset: 16, flags: DIFlagPublic)
!713 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 864, align: 8, elements: !714)
!714 = !{!715}
!715 = !DISubrange(count: 108, lowerBound: 0)
!716 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::sockaddr_un", baseType: !709, size: 64, align: 64, dwarfAddressSpace: 0)
!717 = !{!718}
!718 = !DILocalVariable(name: "self", arg: 1, scope: !705, file: !17, line: 118, type: !716)
!719 = !DILocation(line: 118, column: 22, scope: !705)
!720 = !DILocation(line: 118, column: 37, scope: !705)
!721 = !DILocation(line: 118, column: 44, scope: !705)
!722 = distinct !DISubprogram(name: "clone", linkageName: "_ZN79_$LT$libc..unix..linux_like..sockaddr_storage$u20$as$u20$core..clone..Clone$GT$5clone17hb333e922579ac25dE", scope: !723, file: !17, line: 118, type: !724, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, templateParams: !33, retainedNodes: !735)
!723 = !DINamespace(name: "{impl#47}", scope: !304)
!724 = !DISubroutineType(types: !725)
!725 = !{!726, !734}
!726 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", scope: !304, file: !9, size: 1024, align: 64, flags: DIFlagPublic, elements: !727, templateParams: !33, identifier: "ab81e1acecbe261eed662032187935e2")
!727 = !{!728, !729, !733}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !726, file: !9, baseType: !204, size: 16, align: 16, flags: DIFlagPublic)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_pad2", scope: !726, file: !9, baseType: !730, size: 944, align: 8, offset: 16, flags: DIFlagPrivate)
!730 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 944, align: 8, elements: !731)
!731 = !{!732}
!732 = !DISubrange(count: 118, lowerBound: 0)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !726, file: !9, baseType: !174, size: 64, align: 64, offset: 960, flags: DIFlagPrivate)
!734 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::sockaddr_storage", baseType: !726, size: 64, align: 64, dwarfAddressSpace: 0)
!735 = !{!736}
!736 = !DILocalVariable(name: "self", arg: 1, scope: !722, file: !17, line: 118, type: !734)
!737 = !DILocation(line: 118, column: 22, scope: !722)
!738 = !DILocation(line: 118, column: 37, scope: !722)
!739 = !DILocation(line: 118, column: 44, scope: !722)
!740 = distinct !DISubprogram(name: "clone", linkageName: "_ZN70_$LT$libc..unix..linux_like..utsname$u20$as$u20$core..clone..Clone$GT$5clone17h8d56abda66a10287E", scope: !741, file: !17, line: 118, type: !742, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, templateParams: !33, retainedNodes: !756)
!741 = !DINamespace(name: "{impl#49}", scope: !304)
!742 = !DISubroutineType(types: !743)
!743 = !{!744, !755}
!744 = !DICompositeType(tag: DW_TAG_structure_type, name: "utsname", scope: !304, file: !9, size: 3120, align: 8, flags: DIFlagPublic, elements: !745, templateParams: !33, identifier: "c8cebe4a292181002800ed9f7721bf4a")
!745 = !{!746, !750, !751, !752, !753, !754}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "sysname", scope: !744, file: !9, baseType: !747, size: 520, align: 8, flags: DIFlagPublic)
!747 = !DICompositeType(tag: DW_TAG_array_type, baseType: !27, size: 520, align: 8, elements: !748)
!748 = !{!749}
!749 = !DISubrange(count: 65, lowerBound: 0)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "nodename", scope: !744, file: !9, baseType: !747, size: 520, align: 8, offset: 520, flags: DIFlagPublic)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "release", scope: !744, file: !9, baseType: !747, size: 520, align: 8, offset: 1040, flags: DIFlagPublic)
!752 = !DIDerivedType(tag: DW_TAG_member, name: "version", scope: !744, file: !9, baseType: !747, size: 520, align: 8, offset: 1560, flags: DIFlagPublic)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "machine", scope: !744, file: !9, baseType: !747, size: 520, align: 8, offset: 2080, flags: DIFlagPublic)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "domainname", scope: !744, file: !9, baseType: !747, size: 520, align: 8, offset: 2600, flags: DIFlagPublic)
!755 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::utsname", baseType: !744, size: 64, align: 64, dwarfAddressSpace: 0)
!756 = !{!757}
!757 = !DILocalVariable(name: "self", arg: 1, scope: !740, file: !17, line: 118, type: !755)
!758 = !DILocation(line: 118, column: 22, scope: !740)
!759 = !DILocation(line: 118, column: 37, scope: !740)
!760 = !DILocation(line: 118, column: 44, scope: !740)
!761 = distinct !DISubprogram(name: "clone", linkageName: "_ZN71_$LT$libc..unix..linux_like..sigevent$u20$as$u20$core..clone..Clone$GT$5clone17h975a6bf1e3f52f6dE", scope: !762, file: !17, line: 118, type: !763, scopeLine: 118, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, templateParams: !33, retainedNodes: !776)
!762 = !DINamespace(name: "{impl#51}", scope: !304)
!763 = !DISubroutineType(types: !764)
!764 = !{!765, !775}
!765 = !DICompositeType(tag: DW_TAG_structure_type, name: "sigevent", scope: !304, file: !9, size: 512, align: 64, flags: DIFlagPublic, elements: !766, templateParams: !33, identifier: "d6de772b859f0a3cf38714f0cbedc647")
!766 = !{!767, !768, !769, !770, !771}
!767 = !DIDerivedType(tag: DW_TAG_member, name: "sigev_value", scope: !765, file: !9, baseType: !232, size: 64, align: 64, flags: DIFlagPublic)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "sigev_signo", scope: !765, file: !9, baseType: !156, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "sigev_notify", scope: !765, file: !9, baseType: !156, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "sigev_notify_thread_id", scope: !765, file: !9, baseType: !156, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "__unused1", scope: !765, file: !9, baseType: !772, size: 352, align: 32, offset: 160, flags: DIFlagPrivate)
!772 = !DICompositeType(tag: DW_TAG_array_type, baseType: !156, size: 352, align: 32, elements: !773)
!773 = !{!774}
!774 = !DISubrange(count: 11, lowerBound: 0)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::sigevent", baseType: !765, size: 64, align: 64, dwarfAddressSpace: 0)
!776 = !{!777}
!777 = !DILocalVariable(name: "self", arg: 1, scope: !761, file: !17, line: 118, type: !775)
!778 = !DILocation(line: 118, column: 22, scope: !761)
!779 = !DILocation(line: 118, column: 37, scope: !761)
!780 = !DILocation(line: 118, column: 44, scope: !761)
!781 = distinct !DISubprogram(name: "FUTEX_OP", linkageName: "_ZN4libc4unix10linux_like5linux8FUTEX_OP17h1a86bcf29f5df91dE", scope: !674, file: !782, line: 4172, type: !783, scopeLine: 4172, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, templateParams: !33, retainedNodes: !785)
!782 = !DIFile(filename: "src/unix/linux_like/linux/mod.rs", directory: "/users/zyuxuan/.cargo/registry/src/index.crates.io-6f17d22bba15001f/libc-0.2.153", checksumkind: CSK_MD5, checksum: "5d07ab1dbfc34593ac003c0b453e4a95")
!783 = !DISubroutineType(types: !784)
!784 = !{!156, !156, !156, !156, !156}
!785 = !{!786, !787, !788, !789}
!786 = !DILocalVariable(name: "op", arg: 1, scope: !781, file: !782, line: 4172, type: !156)
!787 = !DILocalVariable(name: "oparg", arg: 2, scope: !781, file: !782, line: 4172, type: !156)
!788 = !DILocalVariable(name: "cmp", arg: 3, scope: !781, file: !782, line: 4172, type: !156)
!789 = !DILocalVariable(name: "cmparg", arg: 4, scope: !781, file: !782, line: 4172, type: !156)
!790 = !DILocation(line: 4172, column: 17, scope: !781)
!791 = !DILocation(line: 4172, column: 30, scope: !781)
!792 = !DILocation(line: 4172, column: 46, scope: !781)
!793 = !DILocation(line: 4172, column: 60, scope: !781)
!794 = !DILocation(line: 4173, column: 6, scope: !781)
!795 = !DILocation(line: 4173, column: 5, scope: !781)
!796 = !DILocation(line: 4173, column: 27, scope: !781)
!797 = !DILocation(line: 4173, column: 26, scope: !781)
!798 = !DILocation(line: 4173, column: 49, scope: !781)
!799 = !DILocation(line: 4173, column: 48, scope: !781)
!800 = !DILocation(line: 4173, column: 74, scope: !781)
!801 = !DILocation(line: 4174, column: 2, scope: !781)
!802 = distinct !DISubprogram(name: "clone", linkageName: "_ZN76_$LT$libc..unix..linux_like..linux..glob_t$u20$as$u20$core..clone..Clone$GT$5clone17had27f29b7dd65fe5E", scope: !803, file: !17, line: 83, type: !804, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, templateParams: !33, retainedNodes: !818)
!803 = !DINamespace(name: "{impl#1}", scope: !674)
!804 = !DISubroutineType(types: !805)
!805 = !{!806, !817}
!806 = !DICompositeType(tag: DW_TAG_structure_type, name: "glob_t", scope: !674, file: !9, size: 576, align: 64, flags: DIFlagPublic, elements: !807, templateParams: !33, identifier: "f92c5d2e22cff660b9cdf6cd0b63538")
!807 = !{!808, !809, !810, !811, !812, !813, !814, !815, !816}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "gl_pathc", scope: !806, file: !9, baseType: !174, size: 64, align: 64, flags: DIFlagPublic)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "gl_pathv", scope: !806, file: !9, baseType: !32, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "gl_offs", scope: !806, file: !9, baseType: !174, size: 64, align: 64, offset: 128, flags: DIFlagPublic)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "gl_flags", scope: !806, file: !9, baseType: !156, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "__unused1", scope: !806, file: !9, baseType: !172, size: 64, align: 64, offset: 256, flags: DIFlagPrivate)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "__unused2", scope: !806, file: !9, baseType: !172, size: 64, align: 64, offset: 320, flags: DIFlagPrivate)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "__unused3", scope: !806, file: !9, baseType: !172, size: 64, align: 64, offset: 384, flags: DIFlagPrivate)
!815 = !DIDerivedType(tag: DW_TAG_member, name: "__unused4", scope: !806, file: !9, baseType: !172, size: 64, align: 64, offset: 448, flags: DIFlagPrivate)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "__unused5", scope: !806, file: !9, baseType: !172, size: 64, align: 64, offset: 512, flags: DIFlagPrivate)
!817 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::linux::glob_t", baseType: !806, size: 64, align: 64, dwarfAddressSpace: 0)
!818 = !{!819}
!819 = !DILocalVariable(name: "self", arg: 1, scope: !802, file: !17, line: 83, type: !817)
!820 = !DILocation(line: 83, column: 22, scope: !802)
!821 = !DILocation(line: 83, column: 37, scope: !802)
!822 = !DILocation(line: 83, column: 44, scope: !802)
!823 = distinct !DISubprogram(name: "clone", linkageName: "_ZN76_$LT$libc..unix..linux_like..linux..passwd$u20$as$u20$core..clone..Clone$GT$5clone17h018f9ac6641788feE", scope: !824, file: !17, line: 83, type: !825, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, templateParams: !33, retainedNodes: !837)
!824 = !DINamespace(name: "{impl#3}", scope: !674)
!825 = !DISubroutineType(types: !826)
!826 = !{!827, !836}
!827 = !DICompositeType(tag: DW_TAG_structure_type, name: "passwd", scope: !674, file: !9, size: 384, align: 64, flags: DIFlagPublic, elements: !828, templateParams: !33, identifier: "252b0c26315950b5e01154003a8b80f5")
!828 = !{!829, !830, !831, !832, !833, !834, !835}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "pw_name", scope: !827, file: !9, baseType: !26, size: 64, align: 64, flags: DIFlagPublic)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "pw_passwd", scope: !827, file: !9, baseType: !26, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "pw_uid", scope: !827, file: !9, baseType: !30, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gid", scope: !827, file: !9, baseType: !30, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!833 = !DIDerivedType(tag: DW_TAG_member, name: "pw_gecos", scope: !827, file: !9, baseType: !26, size: 64, align: 64, offset: 192, flags: DIFlagPublic)
!834 = !DIDerivedType(tag: DW_TAG_member, name: "pw_dir", scope: !827, file: !9, baseType: !26, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "pw_shell", scope: !827, file: !9, baseType: !26, size: 64, align: 64, offset: 320, flags: DIFlagPublic)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::linux::passwd", baseType: !827, size: 64, align: 64, dwarfAddressSpace: 0)
!837 = !{!838}
!838 = !DILocalVariable(name: "self", arg: 1, scope: !823, file: !17, line: 83, type: !836)
!839 = !DILocation(line: 83, column: 22, scope: !823)
!840 = !DILocation(line: 83, column: 37, scope: !823)
!841 = !DILocation(line: 83, column: 44, scope: !823)
!842 = distinct !DISubprogram(name: "clone", linkageName: "_ZN74_$LT$libc..unix..linux_like..linux..spwd$u20$as$u20$core..clone..Clone$GT$5clone17h8d03e5e8f91e7fcdE", scope: !843, file: !17, line: 83, type: !844, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, templateParams: !33, retainedNodes: !858)
!843 = !DINamespace(name: "{impl#5}", scope: !674)
!844 = !DISubroutineType(types: !845)
!845 = !{!846, !857}
!846 = !DICompositeType(tag: DW_TAG_structure_type, name: "spwd", scope: !674, file: !9, size: 576, align: 64, flags: DIFlagPublic, elements: !847, templateParams: !33, identifier: "2f325e00ec554802c0edc7ead7ca3312")
!847 = !{!848, !849, !850, !851, !852, !853, !854, !855, !856}
!848 = !DIDerivedType(tag: DW_TAG_member, name: "sp_namp", scope: !846, file: !9, baseType: !26, size: 64, align: 64, flags: DIFlagPublic)
!849 = !DIDerivedType(tag: DW_TAG_member, name: "sp_pwdp", scope: !846, file: !9, baseType: !26, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "sp_lstchg", scope: !846, file: !9, baseType: !47, size: 64, align: 64, offset: 128, flags: DIFlagPublic)
!851 = !DIDerivedType(tag: DW_TAG_member, name: "sp_min", scope: !846, file: !9, baseType: !47, size: 64, align: 64, offset: 192, flags: DIFlagPublic)
!852 = !DIDerivedType(tag: DW_TAG_member, name: "sp_max", scope: !846, file: !9, baseType: !47, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "sp_warn", scope: !846, file: !9, baseType: !47, size: 64, align: 64, offset: 320, flags: DIFlagPublic)
!854 = !DIDerivedType(tag: DW_TAG_member, name: "sp_inact", scope: !846, file: !9, baseType: !47, size: 64, align: 64, offset: 384, flags: DIFlagPublic)
!855 = !DIDerivedType(tag: DW_TAG_member, name: "sp_expire", scope: !846, file: !9, baseType: !47, size: 64, align: 64, offset: 448, flags: DIFlagPublic)
!856 = !DIDerivedType(tag: DW_TAG_member, name: "sp_flag", scope: !846, file: !9, baseType: !90, size: 64, align: 64, offset: 512, flags: DIFlagPublic)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::linux::spwd", baseType: !846, size: 64, align: 64, dwarfAddressSpace: 0)
!858 = !{!859}
!859 = !DILocalVariable(name: "self", arg: 1, scope: !842, file: !17, line: 83, type: !857)
!860 = !DILocation(line: 83, column: 22, scope: !842)
!861 = !DILocation(line: 83, column: 37, scope: !842)
!862 = !DILocation(line: 83, column: 44, scope: !842)
!863 = distinct !DISubprogram(name: "clone", linkageName: "_ZN75_$LT$libc..unix..linux_like..linux..dqblk$u20$as$u20$core..clone..Clone$GT$5clone17h4b79593550c55ba2E", scope: !864, file: !17, line: 83, type: !865, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, templateParams: !33, retainedNodes: !879)
!864 = !DINamespace(name: "{impl#7}", scope: !674)
!865 = !DISubroutineType(types: !866)
!866 = !{!867, !878}
!867 = !DICompositeType(tag: DW_TAG_structure_type, name: "dqblk", scope: !674, file: !9, size: 576, align: 64, flags: DIFlagPublic, elements: !868, templateParams: !33, identifier: "e74cd61ec2ab90ff53d794bc5374f58d")
!868 = !{!869, !870, !871, !872, !873, !874, !875, !876, !877}
!869 = !DIDerivedType(tag: DW_TAG_member, name: "dqb_bhardlimit", scope: !867, file: !9, baseType: !90, size: 64, align: 64, flags: DIFlagPublic)
!870 = !DIDerivedType(tag: DW_TAG_member, name: "dqb_bsoftlimit", scope: !867, file: !9, baseType: !90, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!871 = !DIDerivedType(tag: DW_TAG_member, name: "dqb_curspace", scope: !867, file: !9, baseType: !90, size: 64, align: 64, offset: 128, flags: DIFlagPublic)
!872 = !DIDerivedType(tag: DW_TAG_member, name: "dqb_ihardlimit", scope: !867, file: !9, baseType: !90, size: 64, align: 64, offset: 192, flags: DIFlagPublic)
!873 = !DIDerivedType(tag: DW_TAG_member, name: "dqb_isoftlimit", scope: !867, file: !9, baseType: !90, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!874 = !DIDerivedType(tag: DW_TAG_member, name: "dqb_curinodes", scope: !867, file: !9, baseType: !90, size: 64, align: 64, offset: 320, flags: DIFlagPublic)
!875 = !DIDerivedType(tag: DW_TAG_member, name: "dqb_btime", scope: !867, file: !9, baseType: !90, size: 64, align: 64, offset: 384, flags: DIFlagPublic)
!876 = !DIDerivedType(tag: DW_TAG_member, name: "dqb_itime", scope: !867, file: !9, baseType: !90, size: 64, align: 64, offset: 448, flags: DIFlagPublic)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "dqb_valid", scope: !867, file: !9, baseType: !30, size: 32, align: 32, offset: 512, flags: DIFlagPublic)
!878 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&libc::unix::linux_like::linux::dqblk", baseType: !867, size: 64, align: 64, dwarfAddressSpace: 0)
!879 = !{!880}
!880 = !DILocalVariable(name: "self", arg: 1, scope: !863, file: !17, line: 83, type: !878)
!881 = !DILocation(line: 83, column: 22, scope: !863)
!882 = !DILocation(line: 83, column: 37, scope: !863)
!883 = !DILocation(line: 83, column: 44, scope: !863)
!884 = distinct !DISubprogram(name: "clone", linkageName: "_ZN86_$LT$libc..unix..linux_like..linux..signalfd_siginfo$u20$as$u20$core..clone..Clone$GT$5clone17h640d5518f1a97e93E", scope: !885, file: !17, line: 83, type: !886, scopeLine: 83, flags: DIFlagPrototyped, spFlags: DISPFlagDefinition, unit: !5, templateParams: !33, retainedNodes: !916)
!885 = !DINamespace(name: "{impl#9}", scope: !674)
!886 = !DISubroutineType(types: !887)
!887 = !{!888, !915}
!888 = !DICompositeType(tag: DW_TAG_structure_type, name: "signalfd_siginfo", scope: !674, file: !9, size: 1024, align: 64, flags: DIFlagPublic, elements: !889, templateParams: !33, identifier: "d815b83532c78edeafe739c8d6629966")
!889 = !{!890, !891, !892, !893, !894, !895, !896, !897, !898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !908, !909, !910, !911}
!890 = !DIDerivedType(tag: DW_TAG_member, name: "ssi_signo", scope: !888, file: !9, baseType: !30, size: 32, align: 32, flags: DIFlagPublic)
!891 = !DIDerivedType(tag: DW_TAG_member, name: "ssi_errno", scope: !888, file: !9, baseType: !156, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!892 = !DIDerivedType(tag: DW_TAG_member, name: "ssi_code", scope: !888, file: !9, baseType: !156, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "ssi_pid", scope: !888, file: !9, baseType: !30, size: 32, align: 32, offset: 96, flags: DIFlagPublic)
!894 = !DIDerivedType(tag: DW_TAG_member, name: "ssi_uid", scope: !888, file: !9, baseType: !30, size: 32, align: 32, offset: 128, flags: DIFlagPublic)
!895 = !DIDerivedType(tag: DW_TAG_member, name: "ssi_fd", scope: !888, file: !9, baseType: !156, size: 32, align: 32, offset: 160, flags: DIFlagPublic)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "ssi_tid", scope: !888, file: !9, baseType: !30, size: 32, align: 32, offset: 192, flags: DIFlagPublic)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "ssi_band", scope: !888, file: !9, baseType: !30, size: 32, align: 32, offset: 224, flags: DIFlagPublic)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "ssi_overrun", scope: !888, file: !9, baseType: !30, size: 32, align: 32, offset: 256, flags: DIFlagPublic)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "ssi_trapno", scope: !888, file: !9, baseType: !30, size: 32, align: 32, offset: 288, flags: DIFlagPublic)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "ssi_status", scope: !888, file: !9, baseType: !156, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "ssi_int", scope: !888, file: !9, baseType: !156, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "ssi_ptr", scope: !888, file: !9, baseType: !90, size: 64, align: 64, offset: 384, flags: DIFlagPublic)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "ssi_utime", scope: !888, file: !9, baseType: !90, size: 64, align: 64, offset: 448, flags: DIFlagPublic)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "ssi_stime", scope: !888, file: !9, baseType: !90, size: 64, align: 64, offset: 512, flags: DIFlagPublic)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "ssi_addr", scope: !888, file: !9, baseType: !90, size: 64, align: 64, offset: 576, flags: DIFlagPublic)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "ssi_addr_lsb", scope: !888, file: !9, baseType: !204, size: 16, align: 16, offset: 640, flags: DIFlagPublic)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "_pad2", scope: !888, file: !9, baseType: !204, size: 16, align: 16, offset: 656, flags: DIFlagPrivate)
!908 = !DIDerivedType(tag: DW_TAG_member, name: "ssi_syscall", scope: !888, file: !9, baseType: !156, size: 32, align: 32, offset: 672, flags: DIFlagPublic)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "ssi_call_addr", scope: !888, file: !9, baseType: !90, size: 64, align: 64, offset: 704, flags: DIFlagPublic)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "ssi_arch", scope: !888, file: !9, baseType: !30, size: 32, align: 32, offset: 768, flags: DIFlagPublic)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "_pad", scope: !888, file: !9, baseType: !912, size: 224, align: 8, offset: 800, flags: DIFlagPrivate)
!912 = !DICompositeType(tag: DW_TAG_array_type, baseType: !12, size: 224, align: 8, elements: !913)
!913 = !{!914}
