; ModuleID = 'socket2.12f0b0fc8491a94d-cgu.0'
source_filename = "socket2.12f0b0fc8491a94d-cgu.0"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"core::net::ip_addr::Ipv6Addr" = type { [16 x i8] }
%"<alloc::boxed::Box<(dyn core::error::Error + core::marker::Send + core::marker::Sync + 'static)> as core::convert::From<alloc::string::String>>::from::StringError" = type { %"alloc::string::String" }
%"alloc::string::String" = type { %"alloc::vec::Vec<u8>" }
%"alloc::vec::Vec<u8>" = type { %"alloc::raw_vec::RawVec<u8>", i64 }
%"alloc::raw_vec::RawVec<u8>" = type { i64, ptr, %"alloc::alloc::Global" }
%"alloc::alloc::Global" = type {}
%"core::result::Result<usize, std::io::error::Error>" = type { i64, [1 x i64] }
%"core::result::Result<usize, std::io::error::Error>::Err" = type { [1 x i64], ptr }
%"core::result::Result<(usize, RecvFlags, sockaddr::SockAddr), std::io::error::Error>" = type { i64, [19 x i64] }
%"core::result::Result<(usize, RecvFlags, sockaddr::SockAddr), std::io::error::Error>::Err" = type { [1 x i64], ptr }
%"core::result::Result<(usize, RecvFlags), std::io::error::Error>" = type { i64, [2 x i64] }
%"core::result::Result<(usize, RecvFlags), std::io::error::Error>::Err" = type { [1 x i64], ptr }
%"core::result::Result<sockaddr::SockAddr, std::io::error::Error>" = type { i64, [17 x i64] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<alloc::boxed::{impl#68}::from::StringError as core::error::Error>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<alloc::boxed::{impl#68}::from::StringError as core::error::Error>::{vtable_type}", file: !2, size: 704, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !19, templateParams: !55, identifier: "f40f10abbb04be6f8d6008056aa93a0b")
!4 = !{!5, !8, !10, !11, !12, !13, !14, !15, !16, !17, !18}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "__super_trait_ptr5", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!14 = !DIDerivedType(tag: DW_TAG_member, name: "__method6", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 384)
!15 = !DIDerivedType(tag: DW_TAG_member, name: "__method7", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 448)
!16 = !DIDerivedType(tag: DW_TAG_member, name: "__method8", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 512)
!17 = !DIDerivedType(tag: DW_TAG_member, name: "__method9", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 576)
!18 = !DIDerivedType(tag: DW_TAG_member, name: "__method10", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 640)
!19 = !DICompositeType(tag: DW_TAG_structure_type, name: "StringError", scope: !20, file: !2, size: 192, align: 64, flags: DIFlagProtected, elements: !24, templateParams: !55, identifier: "c2c40a0708334f1812ac8e1817328554")
!20 = !DINamespace(name: "from", scope: !21)
!21 = !DINamespace(name: "{impl#68}", scope: !22)
!22 = !DINamespace(name: "boxed", scope: !23)
!23 = !DINamespace(name: "alloc", scope: null)
!24 = !{!25}
!25 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !19, file: !2, baseType: !26, size: 192, align: 64, flags: DIFlagProtected)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "String", scope: !27, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !28, templateParams: !55, identifier: "d327f3abe291f686c850bbe1dfd9d9d0")
!27 = !DINamespace(name: "string", scope: !23)
!28 = !{!29}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !26, file: !2, baseType: !30, size: 192, align: 64, flags: DIFlagPrivate)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<u8, alloc::alloc::Global>", scope: !31, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !32, templateParams: !63, identifier: "c215d12aad764e1a441c461e729f0d2b")
!31 = !DINamespace(name: "vec", scope: !23)
!32 = !{!33, !65}
!33 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !30, file: !2, baseType: !34, size: 128, align: 64, flags: DIFlagPrivate)
!34 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<u8, alloc::alloc::Global>", scope: !35, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !36, templateParams: !63, identifier: "58281329bdf84bea2e13e330aa112831")
!35 = !DINamespace(name: "raw_vec", scope: !23)
!36 = !{!37, !56, !60}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !34, file: !2, baseType: !38, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!38 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<u8>", scope: !39, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !42, templateParams: !50, identifier: "6f6899319271bff9ddd9f7c3bd2cc000")
!39 = !DINamespace(name: "unique", scope: !40)
!40 = !DINamespace(name: "ptr", scope: !41)
!41 = !DINamespace(name: "core", scope: null)
!42 = !{!43, !52}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !38, file: !2, baseType: !44, size: 64, align: 64, flags: DIFlagPrivate)
!44 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !45, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !46, templateParams: !50, identifier: "6ea26407579e5a1c3e59aa6ffc6beb11")
!45 = !DINamespace(name: "non_null", scope: !40)
!46 = !{!47}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !44, file: !2, baseType: !48, size: 64, align: 64, flags: DIFlagPrivate)
!48 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !49, size: 64, align: 64, dwarfAddressSpace: 0)
!49 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!50 = !{!51}
!51 = !DITemplateTypeParameter(name: "T", type: !49)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !38, file: !2, baseType: !53, align: 8, offset: 64, flags: DIFlagPrivate)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<u8>", scope: !54, file: !2, align: 8, flags: DIFlagPublic, elements: !55, templateParams: !50, identifier: "ec273fde36c82807fc48cac6ee5e0e75")
!54 = !DINamespace(name: "marker", scope: !41)
!55 = !{}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !34, file: !2, baseType: !57, size: 64, align: 64, flags: DIFlagPrivate)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cap", scope: !35, file: !2, size: 64, align: 64, flags: DIFlagPrivate, elements: !58, templateParams: !55, identifier: "3fa86bac779c730df09caa2171474e12")
!58 = !{!59}
!59 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !57, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!60 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !34, file: !2, baseType: !61, align: 8, offset: 128, flags: DIFlagPrivate)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !62, file: !2, align: 8, flags: DIFlagPublic, elements: !55, identifier: "a47ca854cde42ea6e8906fe610d99e63")
!62 = !DINamespace(name: "alloc", scope: !23)
!63 = !{!51, !64}
!64 = !DITemplateTypeParameter(name: "A", type: !61)
!65 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !30, file: !2, baseType: !9, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!66 = !DIGlobalVariableExpression(var: !67, expr: !DIExpression())
!67 = distinct !DIGlobalVariable(name: "<&core::mem::maybe_uninit::MaybeUninit<u8> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !68, isLocal: true, isDefinition: true)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&core::mem::maybe_uninit::MaybeUninit<u8> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !69, vtableHolder: !74, templateParams: !55, identifier: "7ced4bbe41225b741a6c8ba08a2a496a")
!69 = !{!70, !71, !72, !73}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !68, file: !2, baseType: !6, size: 64, align: 64)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !68, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !68, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !68, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::mem::maybe_uninit::MaybeUninit<u8>", baseType: !75, size: 64, align: 64, dwarfAddressSpace: 0)
!75 = !DICompositeType(tag: DW_TAG_union_type, name: "MaybeUninit<u8>", scope: !76, file: !2, size: 8, align: 8, elements: !78, templateParams: !50, identifier: "cc8904e1e4448219f8d8c4d752de2acf")
!76 = !DINamespace(name: "maybe_uninit", scope: !77)
!77 = !DINamespace(name: "mem", scope: !41)
!78 = !{!79, !80}
!79 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !75, file: !2, baseType: !7, align: 8)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !75, file: !2, baseType: !81, size: 8, align: 8)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "ManuallyDrop<u8>", scope: !82, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !83, templateParams: !50, identifier: "2d131d18349616c5479d7f3566b075db")
!82 = !DINamespace(name: "manually_drop", scope: !77)
!83 = !{!84}
!84 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !81, file: !2, baseType: !49, size: 8, align: 8, flags: DIFlagPrivate)
!85 = !DIGlobalVariableExpression(var: !86, expr: !DIExpression())
!86 = distinct !DIGlobalVariable(name: "<std::io::error::Error as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !87, isLocal: true, isDefinition: true)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::io::error::Error as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !88, vtableHolder: !93, templateParams: !55, identifier: "e49b7a940105b7cb4fc14f366634b6f7")
!88 = !{!89, !90, !91, !92}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !87, file: !2, baseType: !6, size: 64, align: 64)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !87, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!91 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !87, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!92 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !87, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!93 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !94, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !97, templateParams: !55, identifier: "6f22f4fb3f892f77f346a79d05516aa7")
!94 = !DINamespace(name: "error", scope: !95)
!95 = !DINamespace(name: "io", scope: !96)
!96 = !DINamespace(name: "std", scope: null)
!97 = !{!98}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !93, file: !2, baseType: !99, size: 64, align: 64, flags: DIFlagPrivate)
!99 = !DICompositeType(tag: DW_TAG_structure_type, name: "Repr", scope: !100, file: !2, size: 64, align: 64, flags: DIFlagProtected, elements: !101, templateParams: !55, identifier: "1059627c34666a2c9a678932a62a647d")
!100 = !DINamespace(name: "repr_bitpacked", scope: !94)
!101 = !{!102, !108}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !99, file: !2, baseType: !103, size: 64, align: 64, flags: DIFlagPrivate)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<()>", scope: !45, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !104, templateParams: !106, identifier: "a4fd68cbaa4969a7b2157a0b510d722e")
!104 = !{!105}
!105 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !103, file: !2, baseType: !6, size: 64, align: 64, flags: DIFlagPrivate)
!106 = !{!107}
!107 = !DITemplateTypeParameter(name: "T", type: !7)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !99, file: !2, baseType: !109, align: 8, offset: 64, flags: DIFlagPrivate)
!109 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<std::io::error::ErrorData<alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>>>", scope: !54, file: !2, align: 8, flags: DIFlagPublic, elements: !55, templateParams: !110, identifier: "eede02a3cd6c54b443eeb00661ca671")
!110 = !{!111}
!111 = !DITemplateTypeParameter(name: "T", type: !112)
!112 = !DICompositeType(tag: DW_TAG_structure_type, name: "ErrorData<alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>>", scope: !94, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !113, templateParams: !55, identifier: "6d363f79bb7bdea333125269af0f327e")
!113 = !{!114}
!114 = !DICompositeType(tag: DW_TAG_variant_part, scope: !112, file: !2, size: 128, align: 64, elements: !115, templateParams: !55, identifier: "85c6568cbb7e755d7fa525ba6e2f7ab6", discriminator: !203)
!115 = !{!116, !181, !185, !199}
!116 = !DIDerivedType(tag: DW_TAG_member, name: "Os", scope: !114, file: !2, baseType: !117, size: 128, align: 64, extraData: i128 0)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "Os", scope: !112, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !118, templateParams: !121, identifier: "9d4884fbf7f85a065e8b57c153881a74")
!118 = !{!119}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !117, file: !2, baseType: !120, size: 32, align: 32, offset: 32, flags: DIFlagPrivate)
!120 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!121 = !{!122}
!122 = !DITemplateTypeParameter(name: "C", type: !123)
!123 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>", baseType: !124, size: 64, align: 64, dwarfAddressSpace: 0)
!124 = !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !94, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !125, templateParams: !55, identifier: "3af011b24ed66d4ec38927471ab5dc31")
!125 = !{!126, !170}
!126 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !124, file: !2, baseType: !127, size: 8, align: 8, offset: 128, flags: DIFlagPrivate)
!127 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ErrorKind", scope: !94, file: !2, baseType: !49, size: 8, align: 8, flags: DIFlagEnumClass, elements: !128)
!128 = !{!129, !130, !131, !132, !133, !134, !135, !136, !137, !138, !139, !140, !141, !142, !143, !144, !145, !146, !147, !148, !149, !150, !151, !152, !153, !154, !155, !156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169}
!129 = !DIEnumerator(name: "NotFound", value: 0, isUnsigned: true)
!130 = !DIEnumerator(name: "PermissionDenied", value: 1, isUnsigned: true)
!131 = !DIEnumerator(name: "ConnectionRefused", value: 2, isUnsigned: true)
!132 = !DIEnumerator(name: "ConnectionReset", value: 3, isUnsigned: true)
!133 = !DIEnumerator(name: "HostUnreachable", value: 4, isUnsigned: true)
!134 = !DIEnumerator(name: "NetworkUnreachable", value: 5, isUnsigned: true)
!135 = !DIEnumerator(name: "ConnectionAborted", value: 6, isUnsigned: true)
!136 = !DIEnumerator(name: "NotConnected", value: 7, isUnsigned: true)
!137 = !DIEnumerator(name: "AddrInUse", value: 8, isUnsigned: true)
!138 = !DIEnumerator(name: "AddrNotAvailable", value: 9, isUnsigned: true)
!139 = !DIEnumerator(name: "NetworkDown", value: 10, isUnsigned: true)
!140 = !DIEnumerator(name: "BrokenPipe", value: 11, isUnsigned: true)
!141 = !DIEnumerator(name: "AlreadyExists", value: 12, isUnsigned: true)
!142 = !DIEnumerator(name: "WouldBlock", value: 13, isUnsigned: true)
!143 = !DIEnumerator(name: "NotADirectory", value: 14, isUnsigned: true)
!144 = !DIEnumerator(name: "IsADirectory", value: 15, isUnsigned: true)
!145 = !DIEnumerator(name: "DirectoryNotEmpty", value: 16, isUnsigned: true)
!146 = !DIEnumerator(name: "ReadOnlyFilesystem", value: 17, isUnsigned: true)
!147 = !DIEnumerator(name: "FilesystemLoop", value: 18, isUnsigned: true)
!148 = !DIEnumerator(name: "StaleNetworkFileHandle", value: 19, isUnsigned: true)
!149 = !DIEnumerator(name: "InvalidInput", value: 20, isUnsigned: true)
!150 = !DIEnumerator(name: "InvalidData", value: 21, isUnsigned: true)
!151 = !DIEnumerator(name: "TimedOut", value: 22, isUnsigned: true)
!152 = !DIEnumerator(name: "WriteZero", value: 23, isUnsigned: true)
!153 = !DIEnumerator(name: "StorageFull", value: 24, isUnsigned: true)
!154 = !DIEnumerator(name: "NotSeekable", value: 25, isUnsigned: true)
!155 = !DIEnumerator(name: "FilesystemQuotaExceeded", value: 26, isUnsigned: true)
!156 = !DIEnumerator(name: "FileTooLarge", value: 27, isUnsigned: true)
!157 = !DIEnumerator(name: "ResourceBusy", value: 28, isUnsigned: true)
!158 = !DIEnumerator(name: "ExecutableFileBusy", value: 29, isUnsigned: true)
!159 = !DIEnumerator(name: "Deadlock", value: 30, isUnsigned: true)
!160 = !DIEnumerator(name: "CrossesDevices", value: 31, isUnsigned: true)
!161 = !DIEnumerator(name: "TooManyLinks", value: 32, isUnsigned: true)
!162 = !DIEnumerator(name: "InvalidFilename", value: 33, isUnsigned: true)
!163 = !DIEnumerator(name: "ArgumentListTooLong", value: 34, isUnsigned: true)
!164 = !DIEnumerator(name: "Interrupted", value: 35, isUnsigned: true)
!165 = !DIEnumerator(name: "Unsupported", value: 36, isUnsigned: true)
!166 = !DIEnumerator(name: "UnexpectedEof", value: 37, isUnsigned: true)
!167 = !DIEnumerator(name: "OutOfMemory", value: 38, isUnsigned: true)
!168 = !DIEnumerator(name: "Other", value: 39, isUnsigned: true)
!169 = !DIEnumerator(name: "Uncategorized", value: 40, isUnsigned: true)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !124, file: !2, baseType: !171, size: 128, align: 64, flags: DIFlagPrivate)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<(dyn core::error::Error + core::marker::Send + core::marker::Sync), alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !172, templateParams: !55, identifier: "f877ea4f2f11c48438249ede7554f486")
!172 = !{!173, !176}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !171, file: !2, baseType: !174, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !175, size: 64, align: 64, dwarfAddressSpace: 0)
!175 = !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn core::error::Error + core::marker::Send + core::marker::Sync)", file: !2, align: 8, elements: !55, identifier: "675cfc9cb0e8afe5e680a4b6ce6f2e83")
!176 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !171, file: !2, baseType: !177, size: 64, align: 64, offset: 64)
!177 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !178, size: 64, align: 64, dwarfAddressSpace: 0)
!178 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !179)
!179 = !{!180}
!180 = !DISubrange(count: 3, lowerBound: 0)
!181 = !DIDerivedType(tag: DW_TAG_member, name: "Simple", scope: !114, file: !2, baseType: !182, size: 128, align: 64, extraData: i128 1)
!182 = !DICompositeType(tag: DW_TAG_structure_type, name: "Simple", scope: !112, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !183, templateParams: !121, identifier: "b3997e3f1dcfcf34adc2ed68b34597a2")
!183 = !{!184}
!184 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !182, file: !2, baseType: !127, size: 8, align: 8, offset: 8, flags: DIFlagPrivate)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "SimpleMessage", scope: !114, file: !2, baseType: !186, size: 128, align: 64, extraData: i128 2)
!186 = !DICompositeType(tag: DW_TAG_structure_type, name: "SimpleMessage", scope: !112, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !187, templateParams: !121, identifier: "e9cc399b5e53da7691ff1b52ea7cd1e0")
!187 = !{!188}
!188 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !186, file: !2, baseType: !189, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!189 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::io::error::SimpleMessage", baseType: !190, size: 64, align: 64, dwarfAddressSpace: 0)
!190 = !DICompositeType(tag: DW_TAG_structure_type, name: "SimpleMessage", scope: !94, file: !2, size: 192, align: 64, flags: DIFlagProtected, elements: !191, templateParams: !55, identifier: "5ff54c3b9a61fbe229eabfc231d2e970")
!191 = !{!192, !193}
!192 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !190, file: !2, baseType: !127, size: 8, align: 8, offset: 128, flags: DIFlagPrivate)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !190, file: !2, baseType: !194, size: 128, align: 64, flags: DIFlagPrivate)
!194 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !195, templateParams: !55, identifier: "857c99401054bcaa39f98e6e0c6d74b")
!195 = !{!196, !198}
!196 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !194, file: !2, baseType: !197, size: 64, align: 64)
!197 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !49, size: 64, align: 64, dwarfAddressSpace: 0)
!198 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !194, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "Custom", scope: !114, file: !2, baseType: !200, size: 128, align: 64, extraData: i128 3)
!200 = !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !112, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !201, templateParams: !121, identifier: "10fdb7411a19f1ded04994e9017e9b14")
!201 = !{!202}
!202 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !200, file: !2, baseType: !123, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!203 = !DIDerivedType(tag: DW_TAG_member, scope: !112, file: !2, baseType: !49, size: 8, align: 8, flags: DIFlagArtificial)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "<&usize as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !206, isLocal: true, isDefinition: true)
!206 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&usize as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !207, vtableHolder: !212, templateParams: !55, identifier: "2503e615cbdf9a1b7604d5082a8a40de")
!207 = !{!208, !209, !210, !211}
!208 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !206, file: !2, baseType: !6, size: 64, align: 64)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !206, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!210 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !206, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!211 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !206, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!212 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!213 = !DIGlobalVariableExpression(var: !214, expr: !DIExpression())
!214 = distinct !DIGlobalVariable(name: "<&i32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !215, isLocal: true, isDefinition: true)
!215 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&i32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !216, vtableHolder: !221, templateParams: !55, identifier: "cc564888e66d2b16743b9113ea242502")
!216 = !{!217, !218, !219, !220}
!217 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !215, file: !2, baseType: !6, size: 64, align: 64)
!218 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !215, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!219 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !215, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!220 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !215, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!221 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&i32", baseType: !120, size: 64, align: 64, dwarfAddressSpace: 0)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(name: "<&socket2::sockaddr::SockAddr as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !224, isLocal: true, isDefinition: true)
!224 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&socket2::sockaddr::SockAddr as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !225, vtableHolder: !230, templateParams: !55, identifier: "9bcaa9b2492a8307980c1e34e70628ee")
!225 = !{!226, !227, !228, !229}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !224, file: !2, baseType: !6, size: 64, align: 64)
!227 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !224, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!228 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !224, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!229 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !224, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!230 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&socket2::sockaddr::SockAddr", baseType: !231, size: 64, align: 64, dwarfAddressSpace: 0)
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "SockAddr", scope: !232, file: !2, size: 1088, align: 64, flags: DIFlagPublic, elements: !234, templateParams: !55, identifier: "f6ce04cb9434e1e85d8f1d48c72e7c1b")
!232 = !DINamespace(name: "sockaddr", scope: !233)
!233 = !DINamespace(name: "socket2", scope: null)
!234 = !{!235, !248}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "storage", scope: !231, file: !2, baseType: !236, size: 1024, align: 64, flags: DIFlagPrivate)
!236 = !DICompositeType(tag: DW_TAG_structure_type, name: "sockaddr_storage", scope: !237, file: !2, size: 1024, align: 64, flags: DIFlagPublic, elements: !240, templateParams: !55, identifier: "ab81e1acecbe261eed662032187935e2")
!237 = !DINamespace(name: "linux_like", scope: !238)
!238 = !DINamespace(name: "unix", scope: !239)
!239 = !DINamespace(name: "libc", scope: null)
!240 = !{!241, !243, !247}
!241 = !DIDerivedType(tag: DW_TAG_member, name: "ss_family", scope: !236, file: !2, baseType: !242, size: 16, align: 16, flags: DIFlagPublic)
!242 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_pad2", scope: !236, file: !2, baseType: !244, size: 944, align: 8, offset: 16, flags: DIFlagPrivate)
!244 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 944, align: 8, elements: !245)
!245 = !{!246}
!246 = !DISubrange(count: 118, lowerBound: 0)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "__ss_align", scope: !236, file: !2, baseType: !9, size: 64, align: 64, offset: 960, flags: DIFlagPrivate)
!248 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !231, file: !2, baseType: !249, size: 32, align: 32, offset: 1024, flags: DIFlagPrivate)
!249 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(name: "<u16 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !252, isLocal: true, isDefinition: true)
!252 = !DICompositeType(tag: DW_TAG_structure_type, name: "<u16 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !253, vtableHolder: !242, templateParams: !55, identifier: "1c1842d29c2583c9ae3f6546ece5ae")
!253 = !{!254, !255, !256, !257}
!254 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !252, file: !2, baseType: !6, size: 64, align: 64)
!255 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !252, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!256 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !252, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!257 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !252, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(name: "<u32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !260, isLocal: true, isDefinition: true)
!260 = !DICompositeType(tag: DW_TAG_structure_type, name: "<u32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !261, vtableHolder: !249, templateParams: !55, identifier: "b357be22419027af3cea6c5d4a8014fa")
!261 = !{!262, !263, !264, !265}
!262 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !260, file: !2, baseType: !6, size: 64, align: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !260, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!264 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !260, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!265 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !260, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "<i32 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !268, isLocal: true, isDefinition: true)
!268 = !DICompositeType(tag: DW_TAG_structure_type, name: "<i32 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !269, vtableHolder: !120, templateParams: !55, identifier: "5800bfb1777f45aee32659b1449a60f2")
!269 = !{!270, !271, !272, !273}
!270 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !268, file: !2, baseType: !6, size: 64, align: 64)
!271 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !268, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!272 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !268, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!273 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !268, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "<core::option::Option<socket2::sockaddr::SockAddr> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !276, isLocal: true, isDefinition: true)
!276 = !DICompositeType(tag: DW_TAG_structure_type, name: "<core::option::Option<socket2::sockaddr::SockAddr> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !277, vtableHolder: !282, templateParams: !55, identifier: "cdb219cbe62d7197935fe0c15af27ff6")
!277 = !{!278, !279, !280, !281}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !276, file: !2, baseType: !6, size: 64, align: 64)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !276, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !276, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !276, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!282 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<socket2::sockaddr::SockAddr>", scope: !283, file: !2, size: 1152, align: 64, flags: DIFlagPublic, elements: !284, templateParams: !55, identifier: "f487f6332cef495cbf73f19db69a331a")
!283 = !DINamespace(name: "option", scope: !41)
!284 = !{!285}
!285 = !DICompositeType(tag: DW_TAG_variant_part, scope: !282, file: !2, size: 1152, align: 64, elements: !286, templateParams: !55, identifier: "27e785bba9a181a9f4033bc97a76ab5b", discriminator: !295)
!286 = !{!287, !291}
!287 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !285, file: !2, baseType: !288, size: 1152, align: 64, extraData: i128 0)
!288 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !282, file: !2, size: 1152, align: 64, flags: DIFlagPublic, elements: !55, templateParams: !289, identifier: "3fd676e00efdcb5bb021ca77d54ea9fb")
!289 = !{!290}
!290 = !DITemplateTypeParameter(name: "T", type: !231)
!291 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !285, file: !2, baseType: !292, size: 1152, align: 64, extraData: i128 1)
!292 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !282, file: !2, size: 1152, align: 64, flags: DIFlagPublic, elements: !293, templateParams: !289, identifier: "46771ec429612b8d14e3510d0a12eee4")
!293 = !{!294}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !292, file: !2, baseType: !231, size: 1088, align: 64, offset: 64, flags: DIFlagPublic)
!295 = !DIDerivedType(tag: DW_TAG_member, scope: !282, file: !2, baseType: !296, size: 64, align: 64, flags: DIFlagArtificial)
!296 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!297 = !DIGlobalVariableExpression(var: !298, expr: !DIExpression())
!298 = distinct !DIGlobalVariable(name: "<bool as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !299, isLocal: true, isDefinition: true)
!299 = !DICompositeType(tag: DW_TAG_structure_type, name: "<bool as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !300, vtableHolder: !305, templateParams: !55, identifier: "5272fccc9a848fa558187ad17496247a")
!300 = !{!301, !302, !303, !304}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !299, file: !2, baseType: !6, size: 64, align: 64)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !299, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !299, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!304 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !299, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!305 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!306 = !{i32 8, !"PIC Level", i32 2}
!307 = !{i32 2, !"RtLibUseGOT", i32 1}
!308 = !{i32 2, !"Dwarf Version", i32 4}
!309 = !{i32 2, !"Debug Info Version", i32 3}
!310 = !{!"rustc version 1.77.0 (aedd173a2 2024-03-17)"}
!311 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !312, producer: "clang LLVM (rustc version 1.77.0 (aedd173a2 2024-03-17))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !313, globals: !417, splitDebugInlining: false, nameTableKind: None)
!312 = !DIFile(filename: "/users/zyuxuan/.cargo/registry/src/index.crates.io-6f17d22bba15001f/socket2-0.5.6/src/lib.rs/@/socket2.12f0b0fc8491a94d-cgu.0", directory: "/users/zyuxuan/.cargo/registry/src/index.crates.io-6f17d22bba15001f/socket2-0.5.6")
!313 = !{!127, !314, !322, !328, !335, !340, !407, !411}
!314 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !315, file: !2, baseType: !49, size: 8, align: 8, flags: DIFlagEnumClass, elements: !317)
!315 = !DINamespace(name: "rt", scope: !316)
!316 = !DINamespace(name: "fmt", scope: !41)
!317 = !{!318, !319, !320, !321}
!318 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!319 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!320 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!321 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!322 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AssertKind", scope: !323, file: !2, baseType: !49, size: 8, align: 8, flags: DIFlagEnumClass, elements: !324)
!323 = !DINamespace(name: "panicking", scope: !41)
!324 = !{!325, !326, !327}
!325 = !DIEnumerator(name: "Eq", value: 0, isUnsigned: true)
!326 = !DIEnumerator(name: "Ne", value: 1, isUnsigned: true)
!327 = !DIEnumerator(name: "Match", value: 2, isUnsigned: true)
!328 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Ordering", scope: !329, file: !2, baseType: !330, size: 8, align: 8, flags: DIFlagEnumClass, elements: !331)
!329 = !DINamespace(name: "cmp", scope: !41)
!330 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!331 = !{!332, !333, !334}
!332 = !DIEnumerator(name: "Less", value: -1)
!333 = !DIEnumerator(name: "Equal", value: 0)
!334 = !DIEnumerator(name: "Greater", value: 1)
!335 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_void", scope: !336, file: !2, baseType: !49, size: 8, align: 8, flags: DIFlagEnumClass, elements: !337)
!336 = !DINamespace(name: "ffi", scope: !41)
!337 = !{!338, !339}
!338 = !DIEnumerator(name: "__variant1", value: 0, isUnsigned: true)
!339 = !DIEnumerator(name: "__variant2", value: 1, isUnsigned: true)
!340 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AlignmentEnum64", scope: !341, file: !2, baseType: !296, size: 64, align: 64, flags: DIFlagEnumClass, elements: !342)
!341 = !DINamespace(name: "alignment", scope: !40)
!342 = !{!343, !344, !345, !346, !347, !348, !349, !350, !351, !352, !353, !354, !355, !356, !357, !358, !359, !360, !361, !362, !363, !364, !365, !366, !367, !368, !369, !370, !371, !372, !373, !374, !375, !376, !377, !378, !379, !380, !381, !382, !383, !384, !385, !386, !387, !388, !389, !390, !391, !392, !393, !394, !395, !396, !397, !398, !399, !400, !401, !402, !403, !404, !405, !406}
!343 = !DIEnumerator(name: "_Align1Shl0", value: 1, isUnsigned: true)
!344 = !DIEnumerator(name: "_Align1Shl1", value: 2, isUnsigned: true)
!345 = !DIEnumerator(name: "_Align1Shl2", value: 4, isUnsigned: true)
!346 = !DIEnumerator(name: "_Align1Shl3", value: 8, isUnsigned: true)
!347 = !DIEnumerator(name: "_Align1Shl4", value: 16, isUnsigned: true)
!348 = !DIEnumerator(name: "_Align1Shl5", value: 32, isUnsigned: true)
!349 = !DIEnumerator(name: "_Align1Shl6", value: 64, isUnsigned: true)
!350 = !DIEnumerator(name: "_Align1Shl7", value: 128, isUnsigned: true)
!351 = !DIEnumerator(name: "_Align1Shl8", value: 256, isUnsigned: true)
!352 = !DIEnumerator(name: "_Align1Shl9", value: 512, isUnsigned: true)
!353 = !DIEnumerator(name: "_Align1Shl10", value: 1024, isUnsigned: true)
!354 = !DIEnumerator(name: "_Align1Shl11", value: 2048, isUnsigned: true)
!355 = !DIEnumerator(name: "_Align1Shl12", value: 4096, isUnsigned: true)
!356 = !DIEnumerator(name: "_Align1Shl13", value: 8192, isUnsigned: true)
!357 = !DIEnumerator(name: "_Align1Shl14", value: 16384, isUnsigned: true)
!358 = !DIEnumerator(name: "_Align1Shl15", value: 32768, isUnsigned: true)
!359 = !DIEnumerator(name: "_Align1Shl16", value: 65536, isUnsigned: true)
!360 = !DIEnumerator(name: "_Align1Shl17", value: 131072, isUnsigned: true)
!361 = !DIEnumerator(name: "_Align1Shl18", value: 262144, isUnsigned: true)
!362 = !DIEnumerator(name: "_Align1Shl19", value: 524288, isUnsigned: true)
!363 = !DIEnumerator(name: "_Align1Shl20", value: 1048576, isUnsigned: true)
!364 = !DIEnumerator(name: "_Align1Shl21", value: 2097152, isUnsigned: true)
!365 = !DIEnumerator(name: "_Align1Shl22", value: 4194304, isUnsigned: true)
!366 = !DIEnumerator(name: "_Align1Shl23", value: 8388608, isUnsigned: true)
!367 = !DIEnumerator(name: "_Align1Shl24", value: 16777216, isUnsigned: true)
!368 = !DIEnumerator(name: "_Align1Shl25", value: 33554432, isUnsigned: true)
!369 = !DIEnumerator(name: "_Align1Shl26", value: 67108864, isUnsigned: true)
!370 = !DIEnumerator(name: "_Align1Shl27", value: 134217728, isUnsigned: true)
!371 = !DIEnumerator(name: "_Align1Shl28", value: 268435456, isUnsigned: true)
!372 = !DIEnumerator(name: "_Align1Shl29", value: 536870912, isUnsigned: true)
!373 = !DIEnumerator(name: "_Align1Shl30", value: 1073741824, isUnsigned: true)
!374 = !DIEnumerator(name: "_Align1Shl31", value: 2147483648, isUnsigned: true)
!375 = !DIEnumerator(name: "_Align1Shl32", value: 4294967296, isUnsigned: true)
!376 = !DIEnumerator(name: "_Align1Shl33", value: 8589934592, isUnsigned: true)
!377 = !DIEnumerator(name: "_Align1Shl34", value: 17179869184, isUnsigned: true)
!378 = !DIEnumerator(name: "_Align1Shl35", value: 34359738368, isUnsigned: true)
!379 = !DIEnumerator(name: "_Align1Shl36", value: 68719476736, isUnsigned: true)
!380 = !DIEnumerator(name: "_Align1Shl37", value: 137438953472, isUnsigned: true)
!381 = !DIEnumerator(name: "_Align1Shl38", value: 274877906944, isUnsigned: true)
!382 = !DIEnumerator(name: "_Align1Shl39", value: 549755813888, isUnsigned: true)
!383 = !DIEnumerator(name: "_Align1Shl40", value: 1099511627776, isUnsigned: true)
!384 = !DIEnumerator(name: "_Align1Shl41", value: 2199023255552, isUnsigned: true)
!385 = !DIEnumerator(name: "_Align1Shl42", value: 4398046511104, isUnsigned: true)
!386 = !DIEnumerator(name: "_Align1Shl43", value: 8796093022208, isUnsigned: true)
!387 = !DIEnumerator(name: "_Align1Shl44", value: 17592186044416, isUnsigned: true)
!388 = !DIEnumerator(name: "_Align1Shl45", value: 35184372088832, isUnsigned: true)
!389 = !DIEnumerator(name: "_Align1Shl46", value: 70368744177664, isUnsigned: true)
!390 = !DIEnumerator(name: "_Align1Shl47", value: 140737488355328, isUnsigned: true)
!391 = !DIEnumerator(name: "_Align1Shl48", value: 281474976710656, isUnsigned: true)
!392 = !DIEnumerator(name: "_Align1Shl49", value: 562949953421312, isUnsigned: true)
!393 = !DIEnumerator(name: "_Align1Shl50", value: 1125899906842624, isUnsigned: true)
!394 = !DIEnumerator(name: "_Align1Shl51", value: 2251799813685248, isUnsigned: true)
!395 = !DIEnumerator(name: "_Align1Shl52", value: 4503599627370496, isUnsigned: true)
!396 = !DIEnumerator(name: "_Align1Shl53", value: 9007199254740992, isUnsigned: true)
!397 = !DIEnumerator(name: "_Align1Shl54", value: 18014398509481984, isUnsigned: true)
!398 = !DIEnumerator(name: "_Align1Shl55", value: 36028797018963968, isUnsigned: true)
!399 = !DIEnumerator(name: "_Align1Shl56", value: 72057594037927936, isUnsigned: true)
!400 = !DIEnumerator(name: "_Align1Shl57", value: 144115188075855872, isUnsigned: true)
!401 = !DIEnumerator(name: "_Align1Shl58", value: 288230376151711744, isUnsigned: true)
!402 = !DIEnumerator(name: "_Align1Shl59", value: 576460752303423488, isUnsigned: true)
!403 = !DIEnumerator(name: "_Align1Shl60", value: 1152921504606846976, isUnsigned: true)
!404 = !DIEnumerator(name: "_Align1Shl61", value: 2305843009213693952, isUnsigned: true)
!405 = !DIEnumerator(name: "_Align1Shl62", value: 4611686018427387904, isUnsigned: true)
!406 = !DIEnumerator(name: "_Align1Shl63", value: 9223372036854775808, isUnsigned: true)
!407 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AllocInit", scope: !35, file: !2, baseType: !49, size: 8, align: 8, flags: DIFlagEnumClass, elements: !408)
!408 = !{!409, !410}
!409 = !DIEnumerator(name: "Uninitialized", value: 0, isUnsigned: true)
!410 = !DIEnumerator(name: "Zeroed", value: 1, isUnsigned: true)
!411 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Shutdown", scope: !412, file: !2, baseType: !49, size: 8, align: 8, flags: DIFlagEnumClass, elements: !413)
!412 = !DINamespace(name: "net", scope: !96)
!413 = !{!414, !415, !416}
!414 = !DIEnumerator(name: "Read", value: 0, isUnsigned: true)
!415 = !DIEnumerator(name: "Write", value: 1, isUnsigned: true)
!416 = !DIEnumerator(name: "Both", value: 2, isUnsigned: true)
!417 = !{!0, !66, !85, !204, !213, !222, !250, !258, !266, !274, !297}
!418 = distinct !DISubprogram(name: "from", linkageName: "_ZN100_$LT$core..net..ip_addr..Ipv6Addr$u20$as$u20$core..convert..From$LT$$u5b$u8$u3b$$u20$16$u5d$$GT$$GT$4from17h638d3035f9e3c00bE", scope: !420, file: !419, line: 2114, type: !423, scopeLine: 2114, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !311, templateParams: !55, retainedNodes: !431)
!419 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/core/src/net/ip_addr.rs", directory: "", checksumkind: CSK_MD5, checksum: "9d198dfd656f0157589c614e8910d80b")
!420 = !DINamespace(name: "{impl#29}", scope: !421)
!421 = !DINamespace(name: "ip_addr", scope: !422)
!422 = !DINamespace(name: "net", scope: !41)
!423 = !DISubroutineType(types: !424)
!424 = !{!425, !428}
!425 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ipv6Addr", scope: !421, file: !2, size: 128, align: 8, flags: DIFlagPublic, elements: !426, templateParams: !55, identifier: "ce5fb1c3571b323b763235994582b336")
!426 = !{!427}
!427 = !DIDerivedType(tag: DW_TAG_member, name: "octets", scope: !425, file: !2, baseType: !428, size: 128, align: 8, flags: DIFlagPrivate)
!428 = !DICompositeType(tag: DW_TAG_array_type, baseType: !49, size: 128, align: 8, elements: !429)
!429 = !{!430}
!430 = !DISubrange(count: 16, lowerBound: 0)
!431 = !{!432}
!432 = !DILocalVariable(name: "octets", arg: 1, scope: !418, file: !419, line: 2114, type: !428)
!433 = !DILocation(line: 2114, column: 13, scope: !418)
!434 = !DILocation(line: 2115, column: 9, scope: !418)
!435 = !DILocation(line: 2116, column: 6, scope: !418)
!436 = distinct !DISubprogram(name: "from", linkageName: "_ZN152_$LT$alloc..boxed..Box$LT$dyn$u20$core..error..Error$u2b$core..marker..Send$u2b$core..marker..Sync$GT$$u20$as$u20$core..convert..From$LT$$RF$str$GT$$GT$4from17h6e87471129eac7ccE", scope: !438, file: !437, line: 2370, type: !439, scopeLine: 2370, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !311, templateParams: !55, retainedNodes: !441)
!437 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/alloc/src/boxed.rs", directory: "", checksumkind: CSK_MD5, checksum: "9bb94677fbfcd025dd44ee034a0b7f7d")
!438 = !DINamespace(name: "{impl#70}", scope: !22)
!439 = !DISubroutineType(types: !440)
!440 = !{!171, !194}
!441 = !{!442}
!442 = !DILocalVariable(name: "err", arg: 1, scope: !436, file: !437, line: 2370, type: !194)
!443 = !DILocation(line: 215, column: 16, scope: !444, inlinedAt: !453)
!444 = distinct !DISubprogram(name: "new<alloc::boxed::{impl#68}::from::StringError>", linkageName: "_ZN5alloc5boxed12Box$LT$T$GT$3new17hb34f7371e26e5249E", scope: !445, file: !437, line: 215, type: !446, scopeLine: 215, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !311, templateParams: !451, retainedNodes: !449)
!445 = !DINamespace(name: "{impl#0}", scope: !22)
!446 = !DISubroutineType(types: !447)
!447 = !{!448, !19}
!448 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "alloc::boxed::Box<alloc::boxed::{impl#68}::from::StringError, alloc::alloc::Global>", baseType: !19, size: 64, align: 64, dwarfAddressSpace: 0)
!449 = !{!450}
!450 = !DILocalVariable(name: "x", arg: 1, scope: !444, file: !437, line: 215, type: !19)
!451 = !{!452}
!452 = !DITemplateTypeParameter(name: "T", type: !19)
!453 = distinct !DILocation(line: 2325, column: 9, scope: !454, inlinedAt: !460)
!454 = distinct !DILexicalBlock(scope: !455, file: !437, line: 2302, column: 5)
!455 = distinct !DISubprogram(name: "from", linkageName: "_ZN166_$LT$alloc..boxed..Box$LT$dyn$u20$core..error..Error$u2b$core..marker..Send$u2b$core..marker..Sync$GT$$u20$as$u20$core..convert..From$LT$alloc..string..String$GT$$GT$4from17h88f4f4511c51322dE", scope: !21, file: !437, line: 2302, type: !456, scopeLine: 2302, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !311, templateParams: !55, retainedNodes: !458)
!456 = !DISubroutineType(types: !457)
!457 = !{!171, !26}
!458 = !{!459}
!459 = !DILocalVariable(name: "err", arg: 1, scope: !454, file: !437, line: 2302, type: !26)
!460 = !DILocation(line: 2371, column: 9, scope: !436)
!461 = !DILocalVariable(name: "alloc", scope: !462, file: !463, line: 436, type: !61, align: 1)
!462 = distinct !DILexicalBlock(scope: !464, file: !463, line: 436, column: 5)
!463 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/alloc/src/slice.rs", directory: "", checksumkind: CSK_MD5, checksum: "4a89c07e092f73b81239eb018c1ac1f7")
!464 = distinct !DISubprogram(name: "to_vec_in<u8, alloc::alloc::Global>", linkageName: "_ZN5alloc5slice29_$LT$impl$u20$$u5b$T$u5d$$GT$9to_vec_in17h1cad5ca3e45d1444E", scope: !465, file: !463, line: 436, type: !467, scopeLine: 436, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !311, templateParams: !63, retainedNodes: !473)
!465 = !DINamespace(name: "{impl#0}", scope: !466)
!466 = !DINamespace(name: "slice", scope: !23)
!467 = !DISubroutineType(types: !468)
!468 = !{!30, !469, !61}
!469 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[u8]", file: !2, size: 128, align: 64, elements: !470, templateParams: !55, identifier: "4f7d759e2003ffb713a77bd933fd0146")
!470 = !{!471, !472}
!471 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !469, file: !2, baseType: !197, size: 64, align: 64)
!472 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !469, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!473 = !{!474, !461}
!474 = !DILocalVariable(name: "self", arg: 1, scope: !462, file: !463, line: 436, type: !469)
!475 = !DILocation(line: 436, column: 43, scope: !462, inlinedAt: !476)
!476 = !DILocation(line: 416, column: 14, scope: !477, inlinedAt: !483)
!477 = distinct !DILexicalBlock(scope: !478, file: !463, line: 412, column: 5)
!478 = distinct !DISubprogram(name: "to_vec<u8>", linkageName: "_ZN5alloc5slice29_$LT$impl$u20$$u5b$T$u5d$$GT$6to_vec17h4012f6f6fbd6d908E", scope: !465, file: !463, line: 412, type: !479, scopeLine: 412, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !311, templateParams: !50, retainedNodes: !481)
!479 = !DISubroutineType(types: !480)
!480 = !{!30, !469}
!481 = !{!482}
!482 = !DILocalVariable(name: "self", arg: 1, scope: !477, file: !463, line: 412, type: !469)
!483 = !DILocation(line: 823, column: 14, scope: !484, inlinedAt: !489)
!484 = distinct !DILexicalBlock(scope: !485, file: !463, line: 822, column: 5)
!485 = distinct !DISubprogram(name: "to_owned<u8>", linkageName: "_ZN5alloc5slice64_$LT$impl$u20$alloc..borrow..ToOwned$u20$for$u20$$u5b$T$u5d$$GT$8to_owned17hf826e775e219c161E", scope: !486, file: !463, line: 822, type: !479, scopeLine: 822, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !311, templateParams: !50, retainedNodes: !487)
!486 = !DINamespace(name: "{impl#9}", scope: !466)
!487 = !{!488}
!488 = !DILocalVariable(name: "self", arg: 1, scope: !484, file: !463, line: 822, type: !469)
!489 = !DILocation(line: 211, column: 62, scope: !490, inlinedAt: !499)
!490 = distinct !DILexicalBlock(scope: !492, file: !491, line: 210, column: 5)
!491 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/alloc/src/str.rs", directory: "", checksumkind: CSK_MD5, checksum: "904ba75438f5f5e3241b19e1d86e80bd")
!492 = distinct !DISubprogram(name: "to_owned", linkageName: "_ZN5alloc3str56_$LT$impl$u20$alloc..borrow..ToOwned$u20$for$u20$str$GT$8to_owned17h16b783732052d258E", scope: !493, file: !491, line: 210, type: !495, scopeLine: 210, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !311, templateParams: !55, retainedNodes: !497)
!493 = !DINamespace(name: "{impl#4}", scope: !494)
!494 = !DINamespace(name: "str", scope: !23)
!495 = !DISubroutineType(types: !496)
!496 = !{!26, !194}
!497 = !{!498}
!498 = !DILocalVariable(name: "self", arg: 1, scope: !490, file: !491, line: 210, type: !194)
!499 = !DILocation(line: 2763, column: 11, scope: !500, inlinedAt: !506)
!500 = distinct !DILexicalBlock(scope: !502, file: !501, line: 2762, column: 5)
!501 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/alloc/src/string.rs", directory: "", checksumkind: CSK_MD5, checksum: "fa2aba08356a8d7df87466adcb7b4075")
!502 = distinct !DISubprogram(name: "from", linkageName: "_ZN76_$LT$alloc..string..String$u20$as$u20$core..convert..From$LT$$RF$str$GT$$GT$4from17hf29c7c96fc023e87E", scope: !503, file: !501, line: 2762, type: !495, scopeLine: 2762, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !311, templateParams: !55, retainedNodes: !504)
!503 = !DINamespace(name: "{impl#54}", scope: !27)
!504 = !{!505}
!505 = !DILocalVariable(name: "s", arg: 1, scope: !500, file: !501, line: 2762, type: !194)
!506 = !DILocation(line: 2371, column: 20, scope: !436)
!507 = !DILocalVariable(name: "alloc", scope: !508, file: !463, line: 110, type: !61, align: 1)
!508 = distinct !DILexicalBlock(scope: !509, file: !463, line: 110, column: 5)
!509 = distinct !DISubprogram(name: "to_vec<u8, alloc::alloc::Global>", linkageName: "_ZN5alloc5slice4hack6to_vec17hf720a1b5cd31b7bfE", scope: !510, file: !463, line: 110, type: !467, scopeLine: 110, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !311, templateParams: !63, retainedNodes: !511)
!510 = !DINamespace(name: "hack", scope: !466)
!511 = !{!512, !507}
!512 = !DILocalVariable(name: "s", arg: 1, scope: !508, file: !463, line: 110, type: !469)
!513 = !DILocation(line: 110, column: 57, scope: !508, inlinedAt: !514)
!514 = !DILocation(line: 441, column: 9, scope: !462, inlinedAt: !476)
!515 = !DILocalVariable(name: "alloc", scope: !516, file: !463, line: 161, type: !61, align: 1)
!516 = distinct !DILexicalBlock(scope: !517, file: !463, line: 161, column: 9)
!517 = distinct !DISubprogram(name: "to_vec<u8, alloc::alloc::Global>", linkageName: "_ZN52_$LT$T$u20$as$u20$alloc..slice..hack..ConvertVec$GT$6to_vec17h74d65600f9423d8cE", scope: !518, file: !463, line: 161, type: !467, scopeLine: 161, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !311, templateParams: !63, retainedNodes: !519)
!518 = !DINamespace(name: "{impl#1}", scope: !510)
!519 = !{!520, !515, !521}
!520 = !DILocalVariable(name: "s", arg: 1, scope: !516, file: !463, line: 161, type: !469)
!521 = !DILocalVariable(name: "v", scope: !522, file: !463, line: 162, type: !30, align: 8)
!522 = distinct !DILexicalBlock(scope: !516, file: !463, line: 162, column: 13)
!523 = !DILocation(line: 161, column: 45, scope: !516, inlinedAt: !524)
!524 = !DILocation(line: 111, column: 9, scope: !508, inlinedAt: !514)
!525 = !DILocalVariable(name: "alloc", scope: !526, file: !527, line: 671, type: !61, align: 1)
!526 = distinct !DILexicalBlock(scope: !528, file: !527, line: 671, column: 5)
!527 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/alloc/src/vec/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "68599339b266867eb81e581cd10beab0")
!528 = distinct !DISubprogram(name: "with_capacity_in<u8, alloc::alloc::Global>", linkageName: "_ZN5alloc3vec16Vec$LT$T$C$A$GT$16with_capacity_in17h9bfb6f1ac6c52228E", scope: !30, file: !527, line: 671, type: !529, scopeLine: 671, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !311, templateParams: !63, declaration: !531, retainedNodes: !532)
!529 = !DISubroutineType(types: !530)
!530 = !{!30, !9, !61}
!531 = !DISubprogram(name: "with_capacity_in<u8, alloc::alloc::Global>", linkageName: "_ZN5alloc3vec16Vec$LT$T$C$A$GT$16with_capacity_in17h9bfb6f1ac6c52228E", scope: !30, file: !527, line: 671, type: !529, scopeLine: 671, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !63)
!532 = !{!533, !525}
!533 = !DILocalVariable(name: "capacity", arg: 1, scope: !526, file: !527, line: 671, type: !9)
!534 = !DILocation(line: 671, column: 46, scope: !526, inlinedAt: !535)
!535 = !DILocation(line: 162, column: 25, scope: !516, inlinedAt: !524)
!536 = !DILocalVariable(name: "alloc", scope: !537, file: !538, line: 144, type: !61, align: 1)
!537 = distinct !DILexicalBlock(scope: !539, file: !538, line: 144, column: 5)
!538 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/alloc/src/raw_vec.rs", directory: "", checksumkind: CSK_MD5, checksum: "0b5ec706c41528fbcb5248091f9e606a")
!539 = distinct !DISubprogram(name: "with_capacity_in<u8, alloc::alloc::Global>", linkageName: "_ZN5alloc7raw_vec19RawVec$LT$T$C$A$GT$16with_capacity_in17h94e9994a33810d31E", scope: !34, file: !538, line: 144, type: !540, scopeLine: 144, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !311, templateParams: !63, declaration: !542, retainedNodes: !543)
!540 = !DISubroutineType(types: !541)
!541 = !{!34, !9, !61}
!542 = !DISubprogram(name: "with_capacity_in<u8, alloc::alloc::Global>", linkageName: "_ZN5alloc7raw_vec19RawVec$LT$T$C$A$GT$16with_capacity_in17h94e9994a33810d31E", scope: !34, file: !538, line: 144, type: !540, scopeLine: 144, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !63)
!543 = !{!544, !536}
!544 = !DILocalVariable(name: "capacity", arg: 1, scope: !537, file: !538, line: 144, type: !9)
!545 = !DILocation(line: 144, column: 46, scope: !537, inlinedAt: !546)
!546 = !DILocation(line: 672, column: 20, scope: !526, inlinedAt: !535)
!547 = !DILocation(line: 2370, column: 13, scope: !436)
!548 = !DILocation(line: 2762, column: 13, scope: !500, inlinedAt: !506)
!549 = !DILocation(line: 210, column: 17, scope: !490, inlinedAt: !499)
!550 = !DILocalVariable(name: "self", arg: 1, scope: !551, file: !552, line: 327, type: !194)
!551 = distinct !DILexicalBlock(scope: !553, file: !552, line: 327, column: 5)
!552 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/core/src/str/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "bf488f5d671ad0f9c88060bf8f0d91c1")
!553 = distinct !DISubprogram(name: "as_bytes", linkageName: "_ZN4core3str21_$LT$impl$u20$str$GT$8as_bytes17hb1ccd2f5f1990c12E", scope: !554, file: !552, line: 327, type: !556, scopeLine: 327, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !311, templateParams: !55, retainedNodes: !558)
!554 = !DINamespace(name: "{impl#0}", scope: !555)
!555 = !DINamespace(name: "str", scope: !41)
!556 = !DISubroutineType(types: !557)
!557 = !{!469, !194}
!558 = !{!550}
!559 = !DILocation(line: 327, column: 27, scope: !551, inlinedAt: !560)
!560 = !DILocation(line: 211, column: 51, scope: !490, inlinedAt: !499)
!561 = !DILocation(line: 2302, column: 13, scope: !454, inlinedAt: !460)
!562 = !DILocalVariable(name: "bytes", arg: 1, scope: !563, file: !501, line: 980, type: !30)
!563 = distinct !DILexicalBlock(scope: !564, file: !501, line: 980, column: 5)
!564 = distinct !DISubprogram(name: "from_utf8_unchecked", linkageName: "_ZN5alloc6string6String19from_utf8_unchecked17he4b8469720a3a6dfE", scope: !26, file: !501, line: 980, type: !565, scopeLine: 980, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !311, templateParams: !55, declaration: !567, retainedNodes: !568)
!565 = !DISubroutineType(types: !566)
!566 = !{!26, !30}
!567 = !DISubprogram(name: "from_utf8_unchecked", linkageName: "_ZN5alloc6string6String19from_utf8_unchecked17he4b8469720a3a6dfE", scope: !26, file: !501, line: 980, type: !565, scopeLine: 980, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !55)
!568 = !{!562}
!569 = !DILocation(line: 980, column: 39, scope: !563, inlinedAt: !570)
!570 = !DILocation(line: 211, column: 18, scope: !490, inlinedAt: !499)
!571 = !DILocation(line: 162, column: 17, scope: !522, inlinedAt: !524)
!572 = !DILocation(line: 329, column: 18, scope: !551, inlinedAt: !560)
!573 = !DILocation(line: 822, column: 17, scope: !484, inlinedAt: !489)
!574 = !DILocation(line: 412, column: 19, scope: !477, inlinedAt: !483)
!575 = !DILocation(line: 436, column: 36, scope: !462, inlinedAt: !476)
!576 = !DILocation(line: 110, column: 48, scope: !508, inlinedAt: !514)
!577 = !DILocation(line: 161, column: 33, scope: !516, inlinedAt: !524)
!578 = !DILocalVariable(name: "self", arg: 1, scope: !579, file: !580, line: 753, type: !469)
!579 = distinct !DILexicalBlock(scope: !581, file: !580, line: 753, column: 5)
!580 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/core/src/slice/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "71bbaa1f5376cf26aa2adb7892a250f9")
!581 = distinct !DISubprogram(name: "as_ptr<u8>", linkageName: "_ZN4core5slice29_$LT$impl$u20$$u5b$T$u5d$$GT$6as_ptr17h44c1b49ec70b0fffE", scope: !582, file: !580, line: 753, type: !584, scopeLine: 753, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !311, templateParams: !50, retainedNodes: !586)
!582 = !DINamespace(name: "{impl#0}", scope: !583)
!583 = !DINamespace(name: "slice", scope: !41)
!584 = !DISubroutineType(types: !585)
!585 = !{!48, !469}
!586 = !{!578}
!587 = !DILocation(line: 753, column: 25, scope: !579, inlinedAt: !588)
!588 = !DILocation(line: 167, column: 19, scope: !522, inlinedAt: !524)
!589 = !DILocation(line: 162, column: 47, scope: !516, inlinedAt: !524)
!590 = !DILocation(line: 671, column: 29, scope: !526, inlinedAt: !535)
!591 = !DILocation(line: 144, column: 29, scope: !537, inlinedAt: !546)
!592 = !DILocalVariable(name: "count", arg: 3, scope: !593, file: !594, line: 1311, type: !9)
!593 = distinct !DILexicalBlock(scope: !595, file: !594, line: 1311, column: 5)
!594 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/core/src/ptr/const_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "09014d329840bfd2d530919196ac4f25")
!595 = distinct !DISubprogram(name: "copy_to_nonoverlapping<u8>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$22copy_to_nonoverlapping17habd4c10b956c5ca9E", scope: !596, file: !594, line: 1311, type: !598, scopeLine: 1311, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !311, templateParams: !50, retainedNodes: !601)
!596 = !DINamespace(name: "{impl#0}", scope: !597)
!597 = !DINamespace(name: "const_ptr", scope: !40)
!598 = !DISubroutineType(types: !599)
!599 = !{null, !48, !600, !9}
!600 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !49, size: 64, align: 64, dwarfAddressSpace: 0)
!601 = !{!602, !603, !592}
!602 = !DILocalVariable(name: "self", arg: 1, scope: !593, file: !594, line: 1311, type: !48)
!603 = !DILocalVariable(name: "dest", arg: 2, scope: !593, file: !594, line: 1311, type: !600)
!604 = !DILocation(line: 1311, column: 68, scope: !593, inlinedAt: !605)
!605 = !DILocation(line: 167, column: 28, scope: !522, inlinedAt: !524)
!606 = !DILocalVariable(name: "count", arg: 3, scope: !607, file: !608, line: 2756, type: !9)
!607 = distinct !DILexicalBlock(scope: !609, file: !608, line: 2756, column: 1)
!608 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/core/src/intrinsics.rs", directory: "", checksumkind: CSK_MD5, checksum: "eda3b49ed281d49534797bd5008ce8c4")
!609 = distinct !DISubprogram(name: "copy_nonoverlapping<u8>", linkageName: "_ZN4core10intrinsics19copy_nonoverlapping17h009dfa09aa9865ccE", scope: !610, file: !608, line: 2756, type: !598, scopeLine: 2756, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !311, templateParams: !50, retainedNodes: !611)
!610 = !DINamespace(name: "intrinsics", scope: !41)
!611 = !{!612, !613, !606}
!612 = !DILocalVariable(name: "src", arg: 1, scope: !607, file: !608, line: 2756, type: !48)
!613 = !DILocalVariable(name: "dst", arg: 2, scope: !607, file: !608, line: 2756, type: !600)
!614 = !DILocation(line: 2756, column: 72, scope: !607, inlinedAt: !615)
!615 = !DILocation(line: 1316, column: 18, scope: !593, inlinedAt: !605)
!616 = !DILocalVariable(name: "new_len", arg: 2, scope: !617, file: !527, line: 1421, type: !9)
!617 = distinct !DILexicalBlock(scope: !618, file: !527, line: 1421, column: 5)
!618 = distinct !DISubprogram(name: "set_len<u8, alloc::alloc::Global>", linkageName: "_ZN5alloc3vec16Vec$LT$T$C$A$GT$7set_len17h6c2fc681275d3eebE", scope: !30, file: !527, line: 1421, type: !619, scopeLine: 1421, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !311, templateParams: !63, declaration: !622, retainedNodes: !623)
!619 = !DISubroutineType(types: !620)
!620 = !{null, !621, !9}
!621 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut alloc::vec::Vec<u8, alloc::alloc::Global>", baseType: !30, size: 64, align: 64, dwarfAddressSpace: 0)
!622 = !DISubprogram(name: "set_len<u8, alloc::alloc::Global>", linkageName: "_ZN5alloc3vec16Vec$LT$T$C$A$GT$7set_len17h6c2fc681275d3eebE", scope: !30, file: !527, line: 1421, type: !619, scopeLine: 1421, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !63)
!623 = !{!624, !616}
!624 = !DILocalVariable(name: "self", arg: 1, scope: !617, file: !527, line: 1421, type: !621)
!625 = !DILocation(line: 1421, column: 38, scope: !617, inlinedAt: !626)
!626 = !DILocation(line: 168, column: 19, scope: !522, inlinedAt: !524)
!627 = !DILocation(line: 145, column: 9, scope: !537, inlinedAt: !546)
!628 = !DILocation(line: 672, column: 9, scope: !526, inlinedAt: !535)
!629 = !DILocation(line: 754, column: 9, scope: !579, inlinedAt: !588)
!630 = !DILocation(line: 1311, column: 48, scope: !593, inlinedAt: !605)
!631 = !DILocation(line: 2756, column: 44, scope: !607, inlinedAt: !615)
!632 = !DILocation(line: 167, column: 51, scope: !522, inlinedAt: !524)
!633 = !DILocalVariable(name: "self", arg: 1, scope: !634, file: !527, line: 1328, type: !621)
!634 = distinct !DILexicalBlock(scope: !635, file: !527, line: 1328, column: 5)
!635 = distinct !DISubprogram(name: "as_mut_ptr<u8, alloc::alloc::Global>", linkageName: "_ZN5alloc3vec16Vec$LT$T$C$A$GT$10as_mut_ptr17h3cb71e005632e86eE", scope: !30, file: !527, line: 1328, type: !636, scopeLine: 1328, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !311, templateParams: !63, declaration: !638, retainedNodes: !639)
!636 = !DISubroutineType(types: !637)
!637 = !{!600, !621}
!638 = !DISubprogram(name: "as_mut_ptr<u8, alloc::alloc::Global>", linkageName: "_ZN5alloc3vec16Vec$LT$T$C$A$GT$10as_mut_ptr17h3cb71e005632e86eE", scope: !30, file: !527, line: 1328, type: !636, scopeLine: 1328, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !63)
!639 = !{!633}
!640 = !DILocation(line: 1328, column: 23, scope: !634, inlinedAt: !641)
!641 = !DILocation(line: 167, column: 53, scope: !522, inlinedAt: !524)
!642 = !DILocation(line: 1331, column: 9, scope: !634, inlinedAt: !641)
!643 = !DILocalVariable(name: "self", arg: 1, scope: !644, file: !538, line: 238, type: !648)
!644 = distinct !DILexicalBlock(scope: !645, file: !538, line: 238, column: 5)
!645 = distinct !DISubprogram(name: "ptr<u8, alloc::alloc::Global>", linkageName: "_ZN5alloc7raw_vec19RawVec$LT$T$C$A$GT$3ptr17hef154e9546c0ee00E", scope: !34, file: !538, line: 238, type: !646, scopeLine: 238, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !311, templateParams: !63, declaration: !649, retainedNodes: !650)
!646 = !DISubroutineType(types: !647)
!647 = !{!600, !648}
!648 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&alloc::raw_vec::RawVec<u8, alloc::alloc::Global>", baseType: !34, size: 64, align: 64, dwarfAddressSpace: 0)
!649 = !DISubprogram(name: "ptr<u8, alloc::alloc::Global>", linkageName: "_ZN5alloc7raw_vec19RawVec$LT$T$C$A$GT$3ptr17hef154e9546c0ee00E", scope: !34, file: !538, line: 238, type: !646, scopeLine: 238, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !63)
!650 = !{!643}
!651 = !DILocation(line: 238, column: 16, scope: !644, inlinedAt: !652)
!652 = !DILocation(line: 1331, column: 18, scope: !634, inlinedAt: !641)
!653 = !DILocation(line: 239, column: 9, scope: !644, inlinedAt: !652)
!654 = !DILocalVariable(name: "self", scope: !655, file: !656, line: 105, type: !38, align: 8)
!655 = distinct !DILexicalBlock(scope: !657, file: !656, line: 105, column: 5)
!656 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/core/src/ptr/unique.rs", directory: "", checksumkind: CSK_MD5, checksum: "ec3b5704f1ceb93306ec7ee620fc2d81")
!657 = distinct !DISubprogram(name: "as_ptr<u8>", linkageName: "_ZN4core3ptr6unique15Unique$LT$T$GT$6as_ptr17he3ca1de4269f4cc6E", scope: !38, file: !656, line: 105, type: !658, scopeLine: 105, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !311, templateParams: !50, declaration: !660, retainedNodes: !661)
!658 = !DISubroutineType(types: !659)
!659 = !{!600, !38}
!660 = !DISubprogram(name: "as_ptr<u8>", linkageName: "_ZN4core3ptr6unique15Unique$LT$T$GT$6as_ptr17he3ca1de4269f4cc6E", scope: !38, file: !656, line: 105, type: !658, scopeLine: 105, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !50)
!661 = !{!654, !654}
!662 = !DILocation(line: 105, column: 25, scope: !655, inlinedAt: !663)
!663 = !DILocation(line: 239, column: 18, scope: !644, inlinedAt: !652)
!664 = !DILocalVariable(name: "self", arg: 1, scope: !665, file: !666, line: 347, type: !44)
!665 = distinct !DILexicalBlock(scope: !667, file: !666, line: 347, column: 5)
!666 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/core/src/ptr/non_null.rs", directory: "", checksumkind: CSK_MD5, checksum: "d232b4a1150e9e47bf554073bdb98e48")
!667 = distinct !DISubprogram(name: "as_ptr<u8>", linkageName: "_ZN4core3ptr8non_null16NonNull$LT$T$GT$6as_ptr17h3572cfcfd267d127E", scope: !44, file: !666, line: 347, type: !668, scopeLine: 347, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !311, templateParams: !50, declaration: !670, retainedNodes: !671)
!668 = !DISubroutineType(types: !669)
!669 = !{!600, !44}
!670 = !DISubprogram(name: "as_ptr<u8>", linkageName: "_ZN4core3ptr8non_null16NonNull$LT$T$GT$6as_ptr17h3572cfcfd267d127E", scope: !44, file: !666, line: 347, type: !668, scopeLine: 347, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !50)
!671 = !{!664}
!672 = !DILocation(line: 347, column: 25, scope: !665, inlinedAt: !673)
!673 = !DILocation(line: 106, column: 22, scope: !655, inlinedAt: !663)
!674 = !DILocation(line: 348, column: 9, scope: !665, inlinedAt: !673)
!675 = !DILocation(line: 1311, column: 54, scope: !593, inlinedAt: !605)
!676 = !DILocation(line: 2756, column: 59, scope: !607, inlinedAt: !615)
!677 = !DILocation(line: 2774, column: 9, scope: !607, inlinedAt: !615)
!678 = !DILocation(line: 168, column: 17, scope: !522, inlinedAt: !524)
!679 = !DILocation(line: 1421, column: 27, scope: !617, inlinedAt: !626)
!680 = !DILocalVariable(name: "self", arg: 1, scope: !681, file: !527, line: 887, type: !621)
!681 = distinct !DILexicalBlock(scope: !682, file: !527, line: 887, column: 5)
!682 = distinct !DISubprogram(name: "capacity<u8, alloc::alloc::Global>", linkageName: "_ZN5alloc3vec16Vec$LT$T$C$A$GT$8capacity17hc01e60a034ad0a9bE", scope: !30, file: !527, line: 887, type: !683, scopeLine: 887, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !311, templateParams: !63, declaration: !686, retainedNodes: !687)
!683 = !DISubroutineType(types: !684)
!684 = !{!9, !685}
!685 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&alloc::vec::Vec<u8, alloc::alloc::Global>", baseType: !30, size: 64, align: 64, dwarfAddressSpace: 0)
!686 = !DISubprogram(name: "capacity<u8, alloc::alloc::Global>", linkageName: "_ZN5alloc3vec16Vec$LT$T$C$A$GT$8capacity17hc01e60a034ad0a9bE", scope: !30, file: !527, line: 887, type: !683, scopeLine: 887, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !63)
!687 = !{!680}
!688 = !DILocation(line: 887, column: 21, scope: !681, inlinedAt: !689)
!689 = !DILocation(line: 1422, column: 39, scope: !617, inlinedAt: !626)
!690 = !DILocation(line: 1424, column: 9, scope: !617, inlinedAt: !626)
!691 = !DILocation(line: 170, column: 13, scope: !522, inlinedAt: !524)
!692 = !DILocation(line: 981, column: 9, scope: !563, inlinedAt: !570)
!693 = !DILocation(line: 2325, column: 18, scope: !454, inlinedAt: !460)
!694 = !DILocation(line: 217, column: 9, scope: !444, inlinedAt: !453)
!695 = !DILocation(line: 218, column: 5, scope: !444, inlinedAt: !453)
!696 = !DILocation(line: 215, column: 5, scope: !444, inlinedAt: !453)
!697 = !DILocation(line: 217, column: 18, scope: !444, inlinedAt: !453)
!698 = !DILocation(line: 2372, column: 6, scope: !436)
!699 = distinct !DISubprogram(name: "from_residual<usize, std::io::error::Error, std::io::error::Error>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17h32608de96b051011E", scope: !701, file: !700, line: 1957, type: !703, scopeLine: 1957, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !311, templateParams: !751, retainedNodes: !747)
!700 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/core/src/result.rs", directory: "", checksumkind: CSK_MD5, checksum: "f043c7a959d5403a67894cc038c0dd9b")
!701 = !DINamespace(name: "{impl#27}", scope: !702)
!702 = !DINamespace(name: "result", scope: !41)
!703 = !DISubroutineType(types: !704)
!704 = !{!705, !721, !739}
!705 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<usize, std::io::error::Error>", scope: !702, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !706, templateParams: !55, identifier: "7913a9eccfc71fb9e531b3c842fd71a3")
!706 = !{!707}
!707 = !DICompositeType(tag: DW_TAG_variant_part, scope: !705, file: !2, size: 128, align: 64, elements: !708, templateParams: !55, identifier: "6bbd21fc48e683769b057997eee1d541", discriminator: !720)
!708 = !{!709, !716}
!709 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !707, file: !2, baseType: !710, size: 128, align: 64, extraData: i128 0)
!710 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !705, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !711, templateParams: !713, identifier: "e577b46a202d27fba06372453d627faa")
!711 = !{!712}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !710, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!713 = !{!714, !715}
!714 = !DITemplateTypeParameter(name: "T", type: !9)
!715 = !DITemplateTypeParameter(name: "E", type: !93)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !707, file: !2, baseType: !717, size: 128, align: 64, extraData: i128 1)
!717 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !705, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !718, templateParams: !713, identifier: "c785b77ff3032f168aa0a9c100d3da7")
!718 = !{!719}
!719 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !717, file: !2, baseType: !93, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!720 = !DIDerivedType(tag: DW_TAG_member, scope: !705, file: !2, baseType: !296, size: 64, align: 64, flags: DIFlagArtificial)
!721 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<core::convert::Infallible, std::io::error::Error>", scope: !702, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !722, templateParams: !55, identifier: "f527318cc67a8f35f455bfb808145003")
!722 = !{!723}
!723 = !DICompositeType(tag: DW_TAG_variant_part, scope: !721, file: !2, size: 64, align: 64, elements: !724, templateParams: !55, identifier: "c4b6b7580656df597eaee52fb8a2165c")
!724 = !{!725, !735}
!725 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !723, file: !2, baseType: !726, size: 64, align: 64)
!726 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !721, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !727, templateParams: !733, identifier: "ad71033a29b0fb5abbe9db337cacdf69")
!727 = !{!728}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !726, file: !2, baseType: !729, align: 8, flags: DIFlagPublic)
!729 = !DICompositeType(tag: DW_TAG_structure_type, name: "Infallible", scope: !730, file: !2, align: 8, flags: DIFlagPublic, elements: !731, templateParams: !55, identifier: "5235c1c665cf1c25fb894f53aea1c5e8")
!730 = !DINamespace(name: "convert", scope: !41)
!731 = !{!732}
!732 = !DICompositeType(tag: DW_TAG_variant_part, scope: !729, file: !2, align: 8, elements: !55, identifier: "8d13b0c6148527d3da793d4a1bfab71f")
!733 = !{!734, !715}
!734 = !DITemplateTypeParameter(name: "T", type: !729)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !723, file: !2, baseType: !736, size: 64, align: 64)
!736 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !721, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !737, templateParams: !733, identifier: "2bb37525bed7a1cb121c0c50514e0f4f")
!737 = !{!738}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !736, file: !2, baseType: !93, size: 64, align: 64, flags: DIFlagPublic)
!739 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !740, size: 64, align: 64, dwarfAddressSpace: 0)
!740 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !741, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !743, templateParams: !55, identifier: "65eb7befd79c72afef1a37a712324bd")
!741 = !DINamespace(name: "location", scope: !742)
!742 = !DINamespace(name: "panic", scope: !41)
!743 = !{!744, !745, !746}
!744 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !740, file: !2, baseType: !194, size: 128, align: 64, flags: DIFlagPrivate)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !740, file: !2, baseType: !249, size: 32, align: 32, offset: 128, flags: DIFlagPrivate)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !740, file: !2, baseType: !249, size: 32, align: 32, offset: 160, flags: DIFlagPrivate)
!747 = !{!748, !749}
!748 = !DILocalVariable(name: "residual", arg: 1, scope: !699, file: !700, line: 1957, type: !721)
!749 = !DILocalVariable(name: "e", scope: !750, file: !700, line: 1959, type: !93, align: 8)
!750 = distinct !DILexicalBlock(scope: !699, file: !700, line: 1959, column: 13)
!751 = !{!714, !715, !752}
!752 = !DITemplateTypeParameter(name: "F", type: !93)
!753 = !DILocation(line: 1957, column: 22, scope: !699)
!754 = !DILocation(line: 1959, column: 17, scope: !699)
!755 = !DILocation(line: 1959, column: 17, scope: !750)
!756 = !DILocalVariable(name: "t", arg: 1, scope: !757, file: !758, line: 767, type: !93)
!757 = distinct !DISubprogram(name: "from<std::io::error::Error>", linkageName: "_ZN50_$LT$T$u20$as$u20$core..convert..From$LT$T$GT$$GT$4from17he2d54e450131b88fE", scope: !759, file: !758, line: 767, type: !760, scopeLine: 767, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !311, templateParams: !763, retainedNodes: !762)
!758 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/core/src/convert/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "b6b98688d364a0d079b203d234721b09")
!759 = !DINamespace(name: "{impl#4}", scope: !730)
!760 = !DISubroutineType(types: !761)
!761 = !{!93, !93}
!762 = !{!756}
!763 = !{!764}
!764 = !DITemplateTypeParameter(name: "T", type: !93)
!765 = !DILocation(line: 767, column: 13, scope: !757, inlinedAt: !766)
!766 = distinct !DILocation(line: 1959, column: 27, scope: !750)
!767 = !DILocation(line: 1959, column: 23, scope: !750)
!768 = !DILocation(line: 1961, column: 6, scope: !699)
!769 = distinct !DISubprogram(name: "from_residual<(), std::io::error::Error, std::io::error::Error>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17h3c1029c1bcddee27E", scope: !701, file: !700, line: 1957, type: !770, scopeLine: 1957, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !311, templateParams: !790, retainedNodes: !786)
!770 = !DISubroutineType(types: !771)
!771 = !{!772, !721, !739}
!772 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), std::io::error::Error>", scope: !702, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !773, templateParams: !55, identifier: "ce340ef50f31e7ae8fb83a3113b00651")
!773 = !{!774}
!774 = !DICompositeType(tag: DW_TAG_variant_part, scope: !772, file: !2, size: 64, align: 64, elements: !775, templateParams: !55, identifier: "c133e546e3bb115efdb54dc58f23f1e", discriminator: !785)
!775 = !{!776, !781}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !774, file: !2, baseType: !777, size: 64, align: 64, extraData: i128 0)
!777 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !772, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !778, templateParams: !780, identifier: "7920f38a4795cdcb4e7e2391b9278532")
!778 = !{!779}
!779 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !777, file: !2, baseType: !7, align: 8, flags: DIFlagPublic)
!780 = !{!107, !715}
!781 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !774, file: !2, baseType: !782, size: 64, align: 64)
!782 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !772, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !783, templateParams: !780, identifier: "687c60154e7d9160930a00053a2466c4")
!783 = !{!784}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !782, file: !2, baseType: !93, size: 64, align: 64, flags: DIFlagPublic)
!785 = !DIDerivedType(tag: DW_TAG_member, scope: !772, file: !2, baseType: !296, size: 64, align: 64, flags: DIFlagArtificial)
!786 = !{!787, !788}
!787 = !DILocalVariable(name: "residual", arg: 1, scope: !769, file: !700, line: 1957, type: !721)
!788 = !DILocalVariable(name: "e", scope: !789, file: !700, line: 1959, type: !93, align: 8)
!789 = distinct !DILexicalBlock(scope: !769, file: !700, line: 1959, column: 13)
!790 = !{!107, !715, !752}
!791 = !DILocation(line: 1957, column: 22, scope: !769)
!792 = !DILocation(line: 1959, column: 17, scope: !769)
!793 = !DILocation(line: 1959, column: 17, scope: !789)
!794 = !DILocation(line: 767, column: 13, scope: !757, inlinedAt: !795)
!795 = distinct !DILocation(line: 1959, column: 27, scope: !789)
!796 = !DILocation(line: 1959, column: 23, scope: !789)
!797 = !DILocation(line: 1961, column: 6, scope: !769)
!798 = distinct !DISubprogram(name: "from_residual<(usize, socket2::RecvFlags, socket2::sockaddr::SockAddr), std::io::error::Error, std::io::error::Error>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17h8f585046683d8ba2E", scope: !701, file: !700, line: 1957, type: !799, scopeLine: 1957, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !311, templateParams: !828, retainedNodes: !824)
!799 = !DISubroutineType(types: !800)
!800 = !{!801, !721, !739}
!801 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(usize, socket2::RecvFlags, socket2::sockaddr::SockAddr), std::io::error::Error>", scope: !702, file: !2, size: 1280, align: 64, flags: DIFlagPublic, elements: !802, templateParams: !55, identifier: "af2dfa3b6f3034c3e9c2ad318cd41431")
!802 = !{!803}
!803 = !DICompositeType(tag: DW_TAG_variant_part, scope: !801, file: !2, size: 1280, align: 64, elements: !804, templateParams: !55, identifier: "423471cf3434f483a9cea580c7d808a1", discriminator: !823)
!804 = !{!805, !819}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !803, file: !2, baseType: !806, size: 1280, align: 64, extraData: i128 0)
!806 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !801, file: !2, size: 1280, align: 64, flags: DIFlagPublic, elements: !807, templateParams: !817, identifier: "4dcfd73e7a58bc67dc74e576b268ad58")
!807 = !{!808}
!808 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !806, file: !2, baseType: !809, size: 1216, align: 64, offset: 64, flags: DIFlagPublic)
!809 = !DICompositeType(tag: DW_TAG_structure_type, name: "(usize, socket2::RecvFlags, socket2::sockaddr::SockAddr)", file: !2, size: 1216, align: 64, elements: !810, templateParams: !55, identifier: "52583628ac02931d3032166890e1f65")
!810 = !{!811, !812, !816}
!811 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !809, file: !2, baseType: !9, size: 64, align: 64)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !809, file: !2, baseType: !813, size: 32, align: 32, offset: 64)
!813 = !DICompositeType(tag: DW_TAG_structure_type, name: "RecvFlags", scope: !233, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !814, templateParams: !55, identifier: "29cebdd371e7c047e51d70d8bb3daccc")
!814 = !{!815}
!815 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !813, file: !2, baseType: !120, size: 32, align: 32, flags: DIFlagPrivate)
!816 = !DIDerivedType(tag: DW_TAG_member, name: "__2", scope: !809, file: !2, baseType: !231, size: 1088, align: 64, offset: 128)
!817 = !{!818, !715}
!818 = !DITemplateTypeParameter(name: "T", type: !809)
!819 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !803, file: !2, baseType: !820, size: 1280, align: 64, extraData: i128 1)
!820 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !801, file: !2, size: 1280, align: 64, flags: DIFlagPublic, elements: !821, templateParams: !817, identifier: "7e9877a4c663cc1cc1c370b8fec70917")
!821 = !{!822}
!822 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !820, file: !2, baseType: !93, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!823 = !DIDerivedType(tag: DW_TAG_member, scope: !801, file: !2, baseType: !296, size: 64, align: 64, flags: DIFlagArtificial)
!824 = !{!825, !826}
!825 = !DILocalVariable(name: "residual", arg: 1, scope: !798, file: !700, line: 1957, type: !721)
!826 = !DILocalVariable(name: "e", scope: !827, file: !700, line: 1959, type: !93, align: 8)
!827 = distinct !DILexicalBlock(scope: !798, file: !700, line: 1959, column: 13)
!828 = !{!818, !715, !752}
!829 = !DILocation(line: 1957, column: 22, scope: !798)
!830 = !DILocation(line: 1959, column: 17, scope: !798)
!831 = !DILocation(line: 1959, column: 17, scope: !827)
!832 = !DILocation(line: 767, column: 13, scope: !757, inlinedAt: !833)
!833 = distinct !DILocation(line: 1959, column: 27, scope: !827)
!834 = !DILocation(line: 1959, column: 23, scope: !827)
!835 = !DILocation(line: 1961, column: 6, scope: !798)
!836 = distinct !DISubprogram(name: "from_residual<(usize, socket2::RecvFlags), std::io::error::Error, std::io::error::Error>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17hce20b19e5ecbf407E", scope: !701, file: !700, line: 1957, type: !837, scopeLine: 1957, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !311, templateParams: !862, retainedNodes: !858)
!837 = !DISubroutineType(types: !838)
!838 = !{!839, !721, !739}
!839 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(usize, socket2::RecvFlags), std::io::error::Error>", scope: !702, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !840, templateParams: !55, identifier: "2edf583f9ef321eba62dba611f6476f0")
!840 = !{!841}
!841 = !DICompositeType(tag: DW_TAG_variant_part, scope: !839, file: !2, size: 192, align: 64, elements: !842, templateParams: !55, identifier: "1631ea425164dce9ffa2421049761384", discriminator: !857)
!842 = !{!843, !853}
!843 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !841, file: !2, baseType: !844, size: 192, align: 64, extraData: i128 0)
!844 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !839, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !845, templateParams: !851, identifier: "4d7fe810b8673460eb06d40a35ca1d76")
!845 = !{!846}
!846 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !844, file: !2, baseType: !847, size: 128, align: 64, offset: 64, flags: DIFlagPublic)
!847 = !DICompositeType(tag: DW_TAG_structure_type, name: "(usize, socket2::RecvFlags)", file: !2, size: 128, align: 64, elements: !848, templateParams: !55, identifier: "c6af860b89e22504b8cea8fa6745a593")
!848 = !{!849, !850}
!849 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !847, file: !2, baseType: !9, size: 64, align: 64)
!850 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !847, file: !2, baseType: !813, size: 32, align: 32, offset: 64)
!851 = !{!852, !715}
!852 = !DITemplateTypeParameter(name: "T", type: !847)
!853 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !841, file: !2, baseType: !854, size: 192, align: 64, extraData: i128 1)
!854 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !839, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !855, templateParams: !851, identifier: "d924767ecbc3f5b01970631c1e41ab67")
!855 = !{!856}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !854, file: !2, baseType: !93, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!857 = !DIDerivedType(tag: DW_TAG_member, scope: !839, file: !2, baseType: !296, size: 64, align: 64, flags: DIFlagArtificial)
!858 = !{!859, !860}
!859 = !DILocalVariable(name: "residual", arg: 1, scope: !836, file: !700, line: 1957, type: !721)
!860 = !DILocalVariable(name: "e", scope: !861, file: !700, line: 1959, type: !93, align: 8)
!861 = distinct !DILexicalBlock(scope: !836, file: !700, line: 1959, column: 13)
!862 = !{!852, !715, !752}
!863 = !DILocation(line: 1957, column: 22, scope: !836)
!864 = !DILocation(line: 1959, column: 17, scope: !836)
!865 = !DILocation(line: 1959, column: 17, scope: !861)
!866 = !DILocation(line: 767, column: 13, scope: !757, inlinedAt: !867)
!867 = distinct !DILocation(line: 1959, column: 27, scope: !861)
!868 = !DILocation(line: 1959, column: 23, scope: !861)
!869 = !DILocation(line: 1961, column: 6, scope: !836)
!870 = distinct !DISubprogram(name: "from_residual<socket2::sockaddr::SockAddr, std::io::error::Error, std::io::error::Error>", linkageName: "_ZN153_$LT$core..result..Result$LT$T$C$F$GT$$u20$as$u20$core..ops..try_trait..FromResidual$LT$core..result..Result$LT$core..convert..Infallible$C$E$GT$$GT$$GT$13from_residual17hd2667376d55c458fE", scope: !701, file: !700, line: 1957, type: !871, scopeLine: 1957, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !311, templateParams: !891, retainedNodes: !887)
!871 = !DISubroutineType(types: !872)
!872 = !{!873, !721, !739}
!873 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<socket2::sockaddr::SockAddr, std::io::error::Error>", scope: !702, file: !2, size: 1152, align: 64, flags: DIFlagPublic, elements: !874, templateParams: !55, identifier: "c3df57c736c293c83e26ef33bcb4f3ec")
!874 = !{!875}
!875 = !DICompositeType(tag: DW_TAG_variant_part, scope: !873, file: !2, size: 1152, align: 64, elements: !876, templateParams: !55, identifier: "b03d079b4f1e285215ac2d1c1b32282", discriminator: !886)
!876 = !{!877, !882}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !875, file: !2, baseType: !878, size: 1152, align: 64, extraData: i128 0)
!878 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !873, file: !2, size: 1152, align: 64, flags: DIFlagPublic, elements: !879, templateParams: !881, identifier: "8a053d15ec86cafdd1f0e00a95295495")
!879 = !{!880}
!880 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !878, file: !2, baseType: !231, size: 1088, align: 64, offset: 64, flags: DIFlagPublic)
!881 = !{!290, !715}
!882 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !875, file: !2, baseType: !883, size: 1152, align: 64, extraData: i128 1)
!883 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !873, file: !2, size: 1152, align: 64, flags: DIFlagPublic, elements: !884, templateParams: !881, identifier: "1422be30198176a370611d5002e2f40")
!884 = !{!885}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !883, file: !2, baseType: !93, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!886 = !DIDerivedType(tag: DW_TAG_member, scope: !873, file: !2, baseType: !296, size: 64, align: 64, flags: DIFlagArtificial)
!887 = !{!888, !889}
!888 = !DILocalVariable(name: "residual", arg: 1, scope: !870, file: !700, line: 1957, type: !721)
!889 = !DILocalVariable(name: "e", scope: !890, file: !700, line: 1959, type: !93, align: 8)
!890 = distinct !DILexicalBlock(scope: !870, file: !700, line: 1959, column: 13)
!891 = !{!290, !715, !752}
!892 = !DILocation(line: 1957, column: 22, scope: !870)
!893 = !DILocation(line: 1959, column: 17, scope: !870)
!894 = !DILocation(line: 1959, column: 17, scope: !890)
!895 = !DILocation(line: 767, column: 13, scope: !757, inlinedAt: !896)
!896 = distinct !DILocation(line: 1959, column: 27, scope: !890)
!897 = !DILocation(line: 1959, column: 23, scope: !890)
!898 = !DILocation(line: 1961, column: 6, scope: !870)
!899 = distinct !DISubprogram(name: "description", linkageName: "_ZN223_$LT$$LT$alloc..boxed..Box$LT$dyn$u20$core..error..Error$u2b$core..marker..Send$u2b$core..marker..Sync$GT$$u20$as$u20$core..convert..From$LT$alloc..string..String$GT$$GT$..from..StringError$u20$as$u20$core..error..Error$GT$11description17h0add4d2966eec15aE", scope: !900, file: !437, line: 2307, type: !901, scopeLine: 2307, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !311, templateParams: !55, retainedNodes: !904)
!900 = !DINamespace(name: "{impl#0}", scope: !20)
!901 = !DISubroutineType(types: !902)
!902 = !{!194, !903}
!903 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&alloc::boxed::{impl#68}::from::StringError", baseType: !19, size: 64, align: 64, dwarfAddressSpace: 0)
!904 = !{!905}
!905 = !DILocalVariable(name: "self", arg: 1, scope: !899, file: !437, line: 2307, type: !903)
!906 = !DILocation(line: 2307, column: 28, scope: !899)
!907 = !DILocation(line: 2308, column: 17, scope: !899)
!908 = !DILocalVariable(name: "self", arg: 1, scope: !909, file: !501, line: 2534, type: !914)
!909 = distinct !DILexicalBlock(scope: !910, file: !501, line: 2534, column: 5)
!910 = distinct !DISubprogram(name: "deref", linkageName: "_ZN65_$LT$alloc..string..String$u20$as$u20$core..ops..deref..Deref$GT$5deref17hb4f7d5e9059de9b6E", scope: !911, file: !501, line: 2534, type: !912, scopeLine: 2534, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !311, templateParams: !55, retainedNodes: !915)
!911 = !DINamespace(name: "{impl#38}", scope: !27)
!912 = !DISubroutineType(types: !913)
!913 = !{!194, !914}
!914 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&alloc::string::String", baseType: !26, size: 64, align: 64, dwarfAddressSpace: 0)
!915 = !{!908}
!916 = !DILocation(line: 2534, column: 14, scope: !909, inlinedAt: !907)
!917 = !DILocation(line: 2535, column: 43, scope: !909, inlinedAt: !907)
!918 = !DILocalVariable(name: "self", arg: 1, scope: !919, file: !527, line: 2705, type: !685)
!919 = distinct !DILexicalBlock(scope: !920, file: !527, line: 2705, column: 5)
!920 = distinct !DISubprogram(name: "deref<u8, alloc::alloc::Global>", linkageName: "_ZN72_$LT$alloc..vec..Vec$LT$T$C$A$GT$$u20$as$u20$core..ops..deref..Deref$GT$5deref17h58fc9192b0dc0d0aE", scope: !921, file: !527, line: 2705, type: !922, scopeLine: 2705, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !311, templateParams: !63, retainedNodes: !924)
!921 = !DINamespace(name: "{impl#8}", scope: !31)
!922 = !DISubroutineType(types: !923)
!923 = !{!469, !685}
!924 = !{!918}
!925 = !DILocation(line: 2705, column: 14, scope: !919, inlinedAt: !917)
!926 = !DILocalVariable(name: "self", arg: 1, scope: !927, file: !527, line: 1268, type: !685)
!927 = distinct !DILexicalBlock(scope: !928, file: !527, line: 1268, column: 5)
!928 = distinct !DISubprogram(name: "as_ptr<u8, alloc::alloc::Global>", linkageName: "_ZN5alloc3vec16Vec$LT$T$C$A$GT$6as_ptr17h3ecb33b5401689f2E", scope: !30, file: !527, line: 1268, type: !929, scopeLine: 1268, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !311, templateParams: !63, declaration: !931, retainedNodes: !932)
!929 = !DISubroutineType(types: !930)
!930 = !{!48, !685}
!931 = !DISubprogram(name: "as_ptr<u8, alloc::alloc::Global>", linkageName: "_ZN5alloc3vec16Vec$LT$T$C$A$GT$6as_ptr17h3ecb33b5401689f2E", scope: !30, file: !527, line: 1268, type: !929, scopeLine: 1268, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !63)
!932 = !{!926}
!933 = !DILocation(line: 1268, column: 19, scope: !927, inlinedAt: !934)
!934 = !DILocation(line: 2706, column: 45, scope: !919, inlinedAt: !917)
!935 = !DILocation(line: 1271, column: 9, scope: !927, inlinedAt: !934)
!936 = !DILocalVariable(name: "self", arg: 1, scope: !937, file: !538, line: 238, type: !648)
!937 = distinct !DILexicalBlock(scope: !938, file: !538, line: 238, column: 5)
!938 = distinct !DISubprogram(name: "ptr<u8, alloc::alloc::Global>", linkageName: "_ZN5alloc7raw_vec19RawVec$LT$T$C$A$GT$3ptr17hef154e9546c0ee00E", scope: !34, file: !538, line: 238, type: !646, scopeLine: 238, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !311, templateParams: !63, declaration: !649, retainedNodes: !939)
!939 = !{!936}
!940 = !DILocation(line: 238, column: 16, scope: !937, inlinedAt: !941)
!941 = !DILocation(line: 1271, column: 18, scope: !927, inlinedAt: !934)
!942 = !DILocation(line: 239, column: 9, scope: !937, inlinedAt: !941)
!943 = !DILocalVariable(name: "self", scope: !944, file: !656, line: 105, type: !38, align: 8)
!944 = distinct !DILexicalBlock(scope: !945, file: !656, line: 105, column: 5)
!945 = distinct !DISubprogram(name: "as_ptr<u8>", linkageName: "_ZN4core3ptr6unique15Unique$LT$T$GT$6as_ptr17he3ca1de4269f4cc6E", scope: !38, file: !656, line: 105, type: !658, scopeLine: 105, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !311, templateParams: !50, declaration: !660, retainedNodes: !946)
!946 = !{!943, !943}
!947 = !DILocation(line: 105, column: 25, scope: !944, inlinedAt: !948)
!948 = !DILocation(line: 239, column: 18, scope: !937, inlinedAt: !941)
!949 = !DILocalVariable(name: "self", arg: 1, scope: !950, file: !666, line: 347, type: !44)
!950 = distinct !DILexicalBlock(scope: !951, file: !666, line: 347, column: 5)
!951 = distinct !DISubprogram(name: "as_ptr<u8>", linkageName: "_ZN4core3ptr8non_null16NonNull$LT$T$GT$6as_ptr17h3572cfcfd267d127E", scope: !44, file: !666, line: 347, type: !668, scopeLine: 347, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !311, templateParams: !50, declaration: !670, retainedNodes: !952)
!952 = !{!949}
!953 = !DILocation(line: 347, column: 25, scope: !950, inlinedAt: !954)
!954 = !DILocation(line: 106, column: 22, scope: !944, inlinedAt: !948)
!955 = !DILocalVariable(name: "data", arg: 1, scope: !956, file: !957, line: 94, type: !48)
!956 = distinct !DILexicalBlock(scope: !958, file: !957, line: 94, column: 1)
