; ModuleID = '50pfo3uhckuvcpdt'
source_filename = "50pfo3uhckuvcpdt"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"core::ops::range::RangeFull" = type {}
%"core::ptr::metadata::PtrComponents<[u8]>" = type { ptr, i64 }
%"core::ptr::metadata::PtrRepr<[u8]>" = type { [2 x i64] }
%"alloc::vec::Vec<u8>" = type { %"alloc::raw_vec::RawVec<u8>", i64 }
%"alloc::raw_vec::RawVec<u8>" = type { i64, ptr, %"alloc::alloc::Global" }
%"alloc::alloc::Global" = type {}
%"core::slice::iter::Iter<'_, u8>" = type { ptr, ptr, %"core::marker::PhantomData<&u8>" }
%"core::marker::PhantomData<&u8>" = type {}
%"core::fmt::builders::DebugList<'_, '_>" = type { %"core::fmt::builders::DebugInner<'_, '_>" }
%"core::fmt::builders::DebugInner<'_, '_>" = type { ptr, i8, i8, [6 x i8] }
%"core::fmt::Formatter<'_>" = type { %"core::option::Option<usize>", %"core::option::Option<usize>", { ptr, ptr }, i32, i32, i8, [7 x i8] }
%"core::option::Option<usize>" = type { i64, [1 x i64] }
%"core::fmt::Arguments<'_>" = type { { ptr, i64 }, { ptr, i64 }, %"core::option::Option<&[core::fmt::rt::Placeholder]>" }
%"core::option::Option<&[core::fmt::rt::Placeholder]>" = type { ptr, [1 x i64] }
%"core::alloc::layout::Layout" = type { i64, i64 }
%"core::result::Result<core::alloc::layout::Layout, core::alloc::layout::LayoutError>" = type { i64, [1 x i64] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !14, templateParams: !23, identifier: "513e30a45f33397931d66b7c27f9468b")
!4 = !{!5, !8, !10, !11, !12, !13}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<()>", scope: !15, file: !2, size: 64, align: 64, elements: !18, templateParams: !23, identifier: "dcada08ba5d8e52fa0502511e6c0738a")
!15 = !DINamespace(name: "lang_start", scope: !16)
!16 = !DINamespace(name: "rt", scope: !17)
!17 = !DINamespace(name: "std", scope: null)
!18 = !{!19}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !14, file: !2, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn()", baseType: !21, size: 64, align: 64, dwarfAddressSpace: 0)
!21 = !DISubroutineType(types: !22)
!22 = !{null}
!23 = !{}
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "<&u8 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !26, isLocal: true, isDefinition: true)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u8 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !27, vtableHolder: !32, templateParams: !23, identifier: "af41e180a396099d2109052d0e58dd2e")
!27 = !{!28, !29, !30, !31}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !26, file: !2, baseType: !6, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !26, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !26, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !26, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u8", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!33 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "<alloc::ffi::c_str::NulError as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !36, isLocal: true, isDefinition: true)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "<alloc::ffi::c_str::NulError as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !37, vtableHolder: !42, templateParams: !23, identifier: "9dcae31d54c06948a15d7e34b3fc4e91")
!37 = !{!38, !39, !40, !41}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !36, file: !2, baseType: !6, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !36, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !36, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !36, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "NulError", scope: !43, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !46, templateParams: !23, identifier: "e86853cb3c301143e66c2f1d0b8c5a40")
!43 = !DINamespace(name: "c_str", scope: !44)
!44 = !DINamespace(name: "ffi", scope: !45)
!45 = !DINamespace(name: "alloc", scope: null)
!46 = !{!47, !48}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !42, file: !2, baseType: !9, size: 64, align: 64, offset: 192, flags: DIFlagPrivate)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !42, file: !2, baseType: !49, size: 192, align: 64, flags: DIFlagPrivate)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<u8, alloc::alloc::Global>", scope: !50, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !51, templateParams: !80, identifier: "c215d12aad764e1a441c461e729f0d2b")
!50 = !DINamespace(name: "vec", scope: !45)
!51 = !{!52, !82}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !49, file: !2, baseType: !53, size: 128, align: 64, flags: DIFlagPrivate)
!53 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<u8, alloc::alloc::Global>", scope: !54, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !55, templateParams: !80, identifier: "58281329bdf84bea2e13e330aa112831")
!54 = !DINamespace(name: "raw_vec", scope: !45)
!55 = !{!56, !73, !77}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !53, file: !2, baseType: !57, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<u8>", scope: !58, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !61, templateParams: !68, identifier: "6f6899319271bff9ddd9f7c3bd2cc000")
!58 = !DINamespace(name: "unique", scope: !59)
!59 = !DINamespace(name: "ptr", scope: !60)
!60 = !DINamespace(name: "core", scope: null)
!61 = !{!62, !70}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !57, file: !2, baseType: !63, size: 64, align: 64, flags: DIFlagPrivate)
!63 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !64, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !65, templateParams: !68, identifier: "6ea26407579e5a1c3e59aa6ffc6beb11")
!64 = !DINamespace(name: "non_null", scope: !59)
!65 = !{!66}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !63, file: !2, baseType: !67, size: 64, align: 64, flags: DIFlagPrivate)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!68 = !{!69}
!69 = !DITemplateTypeParameter(name: "T", type: !33)
!70 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !57, file: !2, baseType: !71, align: 8, offset: 64, flags: DIFlagPrivate)
!71 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<u8>", scope: !72, file: !2, align: 8, flags: DIFlagPublic, elements: !23, templateParams: !68, identifier: "ec273fde36c82807fc48cac6ee5e0e75")
!72 = !DINamespace(name: "marker", scope: !60)
!73 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !53, file: !2, baseType: !74, size: 64, align: 64, flags: DIFlagPrivate)
!74 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cap", scope: !54, file: !2, size: 64, align: 64, flags: DIFlagPrivate, elements: !75, templateParams: !23, identifier: "3fa86bac779c730df09caa2171474e12")
!75 = !{!76}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !74, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !53, file: !2, baseType: !78, align: 8, offset: 128, flags: DIFlagPrivate)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !79, file: !2, align: 8, flags: DIFlagPublic, elements: !23, identifier: "a47ca854cde42ea6e8906fe610d99e63")
!79 = !DINamespace(name: "alloc", scope: !45)
!80 = !{!69, !81}
!81 = !DITemplateTypeParameter(name: "A", type: !78)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !49, file: !2, baseType: !9, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!83 = !DIGlobalVariableExpression(var: !84, expr: !DIExpression())
!84 = distinct !DIGlobalVariable(name: "<core::str::error::Utf8Error as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !85, isLocal: true, isDefinition: true)
!85 = !DICompositeType(tag: DW_TAG_structure_type, name: "<core::str::error::Utf8Error as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !86, vtableHolder: !91, templateParams: !23, identifier: "88912ab288400b2847c31ec3b531ec")
!86 = !{!87, !88, !89, !90}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !85, file: !2, baseType: !6, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !85, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!89 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !85, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !85, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "Utf8Error", scope: !92, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !94, templateParams: !23, identifier: "8d77e2b19a81231332d6174ccce4ffd0")
!92 = !DINamespace(name: "error", scope: !93)
!93 = !DINamespace(name: "str", scope: !60)
!94 = !{!95, !96}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "valid_up_to", scope: !91, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagProtected)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "error_len", scope: !91, file: !2, baseType: !97, size: 16, align: 8, offset: 64, flags: DIFlagProtected)
!97 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<u8>", scope: !98, file: !2, size: 16, align: 8, flags: DIFlagPublic, elements: !99, templateParams: !23, identifier: "ceb840d6da4220667c5d75bc90bf8a10")
!98 = !DINamespace(name: "option", scope: !60)
!99 = !{!100}
!100 = !DICompositeType(tag: DW_TAG_variant_part, scope: !97, file: !2, size: 16, align: 8, elements: !101, templateParams: !23, identifier: "3734b96857b75e911c9c9d41c5e459ae", discriminator: !108)
!101 = !{!102, !104}
!102 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !100, file: !2, baseType: !103, size: 16, align: 8, extraData: i128 0)
!103 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !97, file: !2, size: 16, align: 8, flags: DIFlagPublic, elements: !23, templateParams: !68, identifier: "5887cce5776158c76c8b9ba9dd21db9d")
!104 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !100, file: !2, baseType: !105, size: 16, align: 8, extraData: i128 1)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !97, file: !2, size: 16, align: 8, flags: DIFlagPublic, elements: !106, templateParams: !68, identifier: "e56a710edd6134e6774b32490f7f1de4")
!106 = !{!107}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !105, file: !2, baseType: !33, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!108 = !DIDerivedType(tag: DW_TAG_member, scope: !97, file: !2, baseType: !33, size: 8, align: 8, flags: DIFlagArtificial)
!109 = !DIGlobalVariableExpression(var: !110, expr: !DIExpression())
!110 = distinct !DIGlobalVariable(name: "<usize as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !111, isLocal: true, isDefinition: true)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "<usize as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !112, vtableHolder: !9, templateParams: !23, identifier: "e02999c5af2463b2093c9e5d3bff6a")
!112 = !{!113, !114, !115, !116}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !111, file: !2, baseType: !6, size: 64, align: 64)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !111, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !111, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !111, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!117 = !DIGlobalVariableExpression(var: !118, expr: !DIExpression())
!118 = distinct !DIGlobalVariable(name: "<&alloc::vec::Vec<u8, alloc::alloc::Global> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !119, isLocal: true, isDefinition: true)
!119 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&alloc::vec::Vec<u8, alloc::alloc::Global> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !120, vtableHolder: !125, templateParams: !23, identifier: "c81f0a09fe65080f8762046479fd9fbb")
!120 = !{!121, !122, !123, !124}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !119, file: !2, baseType: !6, size: 64, align: 64)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !119, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!123 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !119, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !119, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&alloc::vec::Vec<u8, alloc::alloc::Global>", baseType: !49, size: 64, align: 64, dwarfAddressSpace: 0)
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(name: "<&core::option::Option<u8> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !128, isLocal: true, isDefinition: true)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&core::option::Option<u8> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !129, vtableHolder: !134, templateParams: !23, identifier: "bfd10f98f42e5b8e1e30c5b5ef4a2695")
!129 = !{!130, !131, !132, !133}
!130 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !128, file: !2, baseType: !6, size: 64, align: 64)
!131 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !128, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!132 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !128, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!133 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !128, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!134 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::option::Option<u8>", baseType: !97, size: 64, align: 64, dwarfAddressSpace: 0)
!135 = !{i32 8, !"PIC Level", i32 2}
!136 = !{i32 7, !"PIE Level", i32 2}
!137 = !{i32 2, !"RtLibUseGOT", i32 1}
!138 = !{i32 2, !"Dwarf Version", i32 4}
!139 = !{i32 2, !"Debug Info Version", i32 3}
!140 = !{!"rustc version 1.77.0 (aedd173a2 2024-03-17)"}
!141 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !142, producer: "clang LLVM (rustc version 1.77.0 (aedd173a2 2024-03-17))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !143, globals: !224, splitDebugInlining: false, nameTableKind: None)
!142 = !DIFile(filename: "src/main.rs/@/50pfo3uhckuvcpdt", directory: "/proj/zyuxuanssf-PG0/faas-cpp-test/merge-rust-and-c/test/wrapper")
!143 = !{!144, !152, !220}
!144 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !145, file: !2, baseType: !33, size: 8, align: 8, flags: DIFlagEnumClass, elements: !147)
!145 = !DINamespace(name: "rt", scope: !146)
!146 = !DINamespace(name: "fmt", scope: !60)
!147 = !{!148, !149, !150, !151}
!148 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!149 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!150 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!151 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!152 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AlignmentEnum64", scope: !153, file: !2, baseType: !154, size: 64, align: 64, flags: DIFlagEnumClass, elements: !155)
!153 = !DINamespace(name: "alignment", scope: !59)
!154 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!155 = !{!156, !157, !158, !159, !160, !161, !162, !163, !164, !165, !166, !167, !168, !169, !170, !171, !172, !173, !174, !175, !176, !177, !178, !179, !180, !181, !182, !183, !184, !185, !186, !187, !188, !189, !190, !191, !192, !193, !194, !195, !196, !197, !198, !199, !200, !201, !202, !203, !204, !205, !206, !207, !208, !209, !210, !211, !212, !213, !214, !215, !216, !217, !218, !219}
!156 = !DIEnumerator(name: "_Align1Shl0", value: 1, isUnsigned: true)
!157 = !DIEnumerator(name: "_Align1Shl1", value: 2, isUnsigned: true)
!158 = !DIEnumerator(name: "_Align1Shl2", value: 4, isUnsigned: true)
!159 = !DIEnumerator(name: "_Align1Shl3", value: 8, isUnsigned: true)
!160 = !DIEnumerator(name: "_Align1Shl4", value: 16, isUnsigned: true)
!161 = !DIEnumerator(name: "_Align1Shl5", value: 32, isUnsigned: true)
!162 = !DIEnumerator(name: "_Align1Shl6", value: 64, isUnsigned: true)
!163 = !DIEnumerator(name: "_Align1Shl7", value: 128, isUnsigned: true)
!164 = !DIEnumerator(name: "_Align1Shl8", value: 256, isUnsigned: true)
!165 = !DIEnumerator(name: "_Align1Shl9", value: 512, isUnsigned: true)
!166 = !DIEnumerator(name: "_Align1Shl10", value: 1024, isUnsigned: true)
!167 = !DIEnumerator(name: "_Align1Shl11", value: 2048, isUnsigned: true)
!168 = !DIEnumerator(name: "_Align1Shl12", value: 4096, isUnsigned: true)
!169 = !DIEnumerator(name: "_Align1Shl13", value: 8192, isUnsigned: true)
!170 = !DIEnumerator(name: "_Align1Shl14", value: 16384, isUnsigned: true)
!171 = !DIEnumerator(name: "_Align1Shl15", value: 32768, isUnsigned: true)
!172 = !DIEnumerator(name: "_Align1Shl16", value: 65536, isUnsigned: true)
!173 = !DIEnumerator(name: "_Align1Shl17", value: 131072, isUnsigned: true)
!174 = !DIEnumerator(name: "_Align1Shl18", value: 262144, isUnsigned: true)
!175 = !DIEnumerator(name: "_Align1Shl19", value: 524288, isUnsigned: true)
!176 = !DIEnumerator(name: "_Align1Shl20", value: 1048576, isUnsigned: true)
!177 = !DIEnumerator(name: "_Align1Shl21", value: 2097152, isUnsigned: true)
!178 = !DIEnumerator(name: "_Align1Shl22", value: 4194304, isUnsigned: true)
!179 = !DIEnumerator(name: "_Align1Shl23", value: 8388608, isUnsigned: true)
!180 = !DIEnumerator(name: "_Align1Shl24", value: 16777216, isUnsigned: true)
!181 = !DIEnumerator(name: "_Align1Shl25", value: 33554432, isUnsigned: true)
!182 = !DIEnumerator(name: "_Align1Shl26", value: 67108864, isUnsigned: true)
!183 = !DIEnumerator(name: "_Align1Shl27", value: 134217728, isUnsigned: true)
!184 = !DIEnumerator(name: "_Align1Shl28", value: 268435456, isUnsigned: true)
!185 = !DIEnumerator(name: "_Align1Shl29", value: 536870912, isUnsigned: true)
!186 = !DIEnumerator(name: "_Align1Shl30", value: 1073741824, isUnsigned: true)
!187 = !DIEnumerator(name: "_Align1Shl31", value: 2147483648, isUnsigned: true)
!188 = !DIEnumerator(name: "_Align1Shl32", value: 4294967296, isUnsigned: true)
!189 = !DIEnumerator(name: "_Align1Shl33", value: 8589934592, isUnsigned: true)
!190 = !DIEnumerator(name: "_Align1Shl34", value: 17179869184, isUnsigned: true)
!191 = !DIEnumerator(name: "_Align1Shl35", value: 34359738368, isUnsigned: true)
!192 = !DIEnumerator(name: "_Align1Shl36", value: 68719476736, isUnsigned: true)
!193 = !DIEnumerator(name: "_Align1Shl37", value: 137438953472, isUnsigned: true)
!194 = !DIEnumerator(name: "_Align1Shl38", value: 274877906944, isUnsigned: true)
!195 = !DIEnumerator(name: "_Align1Shl39", value: 549755813888, isUnsigned: true)
!196 = !DIEnumerator(name: "_Align1Shl40", value: 1099511627776, isUnsigned: true)
!197 = !DIEnumerator(name: "_Align1Shl41", value: 2199023255552, isUnsigned: true)
!198 = !DIEnumerator(name: "_Align1Shl42", value: 4398046511104, isUnsigned: true)
!199 = !DIEnumerator(name: "_Align1Shl43", value: 8796093022208, isUnsigned: true)
!200 = !DIEnumerator(name: "_Align1Shl44", value: 17592186044416, isUnsigned: true)
!201 = !DIEnumerator(name: "_Align1Shl45", value: 35184372088832, isUnsigned: true)
!202 = !DIEnumerator(name: "_Align1Shl46", value: 70368744177664, isUnsigned: true)
!203 = !DIEnumerator(name: "_Align1Shl47", value: 140737488355328, isUnsigned: true)
!204 = !DIEnumerator(name: "_Align1Shl48", value: 281474976710656, isUnsigned: true)
!205 = !DIEnumerator(name: "_Align1Shl49", value: 562949953421312, isUnsigned: true)
!206 = !DIEnumerator(name: "_Align1Shl50", value: 1125899906842624, isUnsigned: true)
!207 = !DIEnumerator(name: "_Align1Shl51", value: 2251799813685248, isUnsigned: true)
!208 = !DIEnumerator(name: "_Align1Shl52", value: 4503599627370496, isUnsigned: true)
!209 = !DIEnumerator(name: "_Align1Shl53", value: 9007199254740992, isUnsigned: true)
!210 = !DIEnumerator(name: "_Align1Shl54", value: 18014398509481984, isUnsigned: true)
!211 = !DIEnumerator(name: "_Align1Shl55", value: 36028797018963968, isUnsigned: true)
!212 = !DIEnumerator(name: "_Align1Shl56", value: 72057594037927936, isUnsigned: true)
!213 = !DIEnumerator(name: "_Align1Shl57", value: 144115188075855872, isUnsigned: true)
!214 = !DIEnumerator(name: "_Align1Shl58", value: 288230376151711744, isUnsigned: true)
!215 = !DIEnumerator(name: "_Align1Shl59", value: 576460752303423488, isUnsigned: true)
!216 = !DIEnumerator(name: "_Align1Shl60", value: 1152921504606846976, isUnsigned: true)
!217 = !DIEnumerator(name: "_Align1Shl61", value: 2305843009213693952, isUnsigned: true)
!218 = !DIEnumerator(name: "_Align1Shl62", value: 4611686018427387904, isUnsigned: true)
!219 = !DIEnumerator(name: "_Align1Shl63", value: 9223372036854775808, isUnsigned: true)
!220 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AllocInit", scope: !54, file: !2, baseType: !33, size: 8, align: 8, flags: DIFlagEnumClass, elements: !221)
!221 = !{!222, !223}
!222 = !DIEnumerator(name: "Uninitialized", value: 0, isUnsigned: true)
!223 = !DIEnumerator(name: "Zeroed", value: 1, isUnsigned: true)
!224 = !{!0, !24, !34, !83, !109, !117, !126}
!225 = distinct !DISubprogram(name: "index", linkageName: "_ZN100_$LT$alloc..string..String$u20$as$u20$core..ops..index..Index$LT$core..ops..range..RangeFull$GT$$GT$5index17h05742f8aa5f0e50eE", scope: !227, file: !226, line: 2463, type: !229, scopeLine: 2463, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !141, templateParams: !23, retainedNodes: !252)
!226 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/alloc/src/string.rs", directory: "", checksumkind: CSK_MD5, checksum: "fa2aba08356a8d7df87466adcb7b4075")
!227 = !DINamespace(name: "{impl#29}", scope: !228)
!228 = !DINamespace(name: "string", scope: !45)
!229 = !DISubroutineType(types: !230)
!230 = !{!231, !236, !240, !243}
!231 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !232, templateParams: !23, identifier: "857c99401054bcaa39f98e6e0c6d74b")
!232 = !{!233, !235}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !231, file: !2, baseType: !234, size: 64, align: 64)
!234 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!235 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !231, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!236 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&alloc::string::String", baseType: !237, size: 64, align: 64, dwarfAddressSpace: 0)
!237 = !DICompositeType(tag: DW_TAG_structure_type, name: "String", scope: !228, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !238, templateParams: !23, identifier: "d327f3abe291f686c850bbe1dfd9d9d0")
!238 = !{!239}
!239 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !237, file: !2, baseType: !49, size: 192, align: 64, flags: DIFlagPrivate)
!240 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeFull", scope: !241, file: !2, align: 8, flags: DIFlagPublic, elements: !23, identifier: "25e39d53254d4c265fff4f19e3c2d4fc")
!241 = !DINamespace(name: "range", scope: !242)
!242 = !DINamespace(name: "ops", scope: !60)
!243 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !244, size: 64, align: 64, dwarfAddressSpace: 0)
!244 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !245, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !247, templateParams: !23, identifier: "65eb7befd79c72afef1a37a712324bd")
!245 = !DINamespace(name: "location", scope: !246)
!246 = !DINamespace(name: "panic", scope: !60)
!247 = !{!248, !249, !251}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !244, file: !2, baseType: !231, size: 128, align: 64, flags: DIFlagPrivate)
!249 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !244, file: !2, baseType: !250, size: 32, align: 32, offset: 128, flags: DIFlagPrivate)
!250 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!251 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !244, file: !2, baseType: !250, size: 32, align: 32, offset: 160, flags: DIFlagPrivate)
!252 = !{!253, !254, !255}
!253 = !DILocalVariable(name: "self", arg: 1, scope: !225, file: !226, line: 2463, type: !236)
!254 = !DILocalVariable(name: "_index", scope: !225, file: !226, line: 2463, type: !240, align: 1)
!255 = !DILocalVariable(arg: 2, scope: !225, file: !226, line: 2463, type: !240)
!256 = !DILocation(line: 2463, column: 21, scope: !225)
!257 = !DILocation(line: 2463, column: 14, scope: !225)
!258 = !DILocation(line: 2464, column: 43, scope: !225)
!259 = !DILocalVariable(name: "self", arg: 1, scope: !260, file: !261, line: 2705, type: !125)
!260 = distinct !DILexicalBlock(scope: !262, file: !261, line: 2705, column: 5)
!261 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/alloc/src/vec/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "68599339b266867eb81e581cd10beab0")
!262 = distinct !DISubprogram(name: "deref<u8, alloc::alloc::Global>", linkageName: "_ZN72_$LT$alloc..vec..Vec$LT$T$C$A$GT$$u20$as$u20$core..ops..deref..Deref$GT$5deref17h2024c434ee3fb1f3E", scope: !263, file: !261, line: 2705, type: !264, scopeLine: 2705, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !141, templateParams: !80, retainedNodes: !270)
!263 = !DINamespace(name: "{impl#8}", scope: !50)
!264 = !DISubroutineType(types: !265)
!265 = !{!266, !125}
!266 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[u8]", file: !2, size: 128, align: 64, elements: !267, templateParams: !23, identifier: "4f7d759e2003ffb713a77bd933fd0146")
!267 = !{!268, !269}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !266, file: !2, baseType: !234, size: 64, align: 64)
!269 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !266, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!270 = !{!259}
!271 = !DILocation(line: 2705, column: 14, scope: !260, inlinedAt: !258)
!272 = !DILocalVariable(name: "self", arg: 1, scope: !273, file: !261, line: 1268, type: !125)
!273 = distinct !DILexicalBlock(scope: !274, file: !261, line: 1268, column: 5)
!274 = distinct !DISubprogram(name: "as_ptr<u8, alloc::alloc::Global>", linkageName: "_ZN5alloc3vec16Vec$LT$T$C$A$GT$6as_ptr17h3c7dd76f6d72ca57E", scope: !49, file: !261, line: 1268, type: !275, scopeLine: 1268, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !141, templateParams: !80, declaration: !277, retainedNodes: !278)
!275 = !DISubroutineType(types: !276)
!276 = !{!67, !125}
!277 = !DISubprogram(name: "as_ptr<u8, alloc::alloc::Global>", linkageName: "_ZN5alloc3vec16Vec$LT$T$C$A$GT$6as_ptr17h3c7dd76f6d72ca57E", scope: !49, file: !261, line: 1268, type: !275, scopeLine: 1268, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !80)
!278 = !{!272}
!279 = !DILocation(line: 1268, column: 19, scope: !273, inlinedAt: !280)
!280 = !DILocation(line: 2706, column: 45, scope: !260, inlinedAt: !258)
!281 = !DILocation(line: 1271, column: 9, scope: !273, inlinedAt: !280)
!282 = !DILocalVariable(name: "self", arg: 1, scope: !283, file: !284, line: 238, type: !289)
!283 = distinct !DILexicalBlock(scope: !285, file: !284, line: 238, column: 5)
!284 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/alloc/src/raw_vec.rs", directory: "", checksumkind: CSK_MD5, checksum: "0b5ec706c41528fbcb5248091f9e606a")
!285 = distinct !DISubprogram(name: "ptr<u8, alloc::alloc::Global>", linkageName: "_ZN5alloc7raw_vec19RawVec$LT$T$C$A$GT$3ptr17h67c29795c521d902E", scope: !53, file: !284, line: 238, type: !286, scopeLine: 238, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !141, templateParams: !80, declaration: !290, retainedNodes: !291)
!286 = !DISubroutineType(types: !287)
!287 = !{!288, !289}
!288 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!289 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&alloc::raw_vec::RawVec<u8, alloc::alloc::Global>", baseType: !53, size: 64, align: 64, dwarfAddressSpace: 0)
!290 = !DISubprogram(name: "ptr<u8, alloc::alloc::Global>", linkageName: "_ZN5alloc7raw_vec19RawVec$LT$T$C$A$GT$3ptr17h67c29795c521d902E", scope: !53, file: !284, line: 238, type: !286, scopeLine: 238, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !80)
!291 = !{!282}
!292 = !DILocation(line: 238, column: 16, scope: !283, inlinedAt: !293)
!293 = !DILocation(line: 1271, column: 18, scope: !273, inlinedAt: !280)
!294 = !DILocation(line: 239, column: 9, scope: !283, inlinedAt: !293)
!295 = !DILocalVariable(name: "self", scope: !296, file: !297, line: 105, type: !57, align: 8)
!296 = distinct !DILexicalBlock(scope: !298, file: !297, line: 105, column: 5)
!297 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/core/src/ptr/unique.rs", directory: "", checksumkind: CSK_MD5, checksum: "ec3b5704f1ceb93306ec7ee620fc2d81")
!298 = distinct !DISubprogram(name: "as_ptr<u8>", linkageName: "_ZN4core3ptr6unique15Unique$LT$T$GT$6as_ptr17h864c6d9c67c73ec1E", scope: !57, file: !297, line: 105, type: !299, scopeLine: 105, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !141, templateParams: !68, declaration: !301, retainedNodes: !302)
!299 = !DISubroutineType(types: !300)
!300 = !{!288, !57}
!301 = !DISubprogram(name: "as_ptr<u8>", linkageName: "_ZN4core3ptr6unique15Unique$LT$T$GT$6as_ptr17h864c6d9c67c73ec1E", scope: !57, file: !297, line: 105, type: !299, scopeLine: 105, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !68)
!302 = !{!295, !295}
!303 = !DILocation(line: 105, column: 25, scope: !296, inlinedAt: !304)
!304 = !DILocation(line: 239, column: 18, scope: !283, inlinedAt: !293)
!305 = !DILocalVariable(name: "self", arg: 1, scope: !306, file: !307, line: 347, type: !63)
!306 = distinct !DILexicalBlock(scope: !308, file: !307, line: 347, column: 5)
!307 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/core/src/ptr/non_null.rs", directory: "", checksumkind: CSK_MD5, checksum: "d232b4a1150e9e47bf554073bdb98e48")
!308 = distinct !DISubprogram(name: "as_ptr<u8>", linkageName: "_ZN4core3ptr8non_null16NonNull$LT$T$GT$6as_ptr17h98589281e9c099daE", scope: !63, file: !307, line: 347, type: !309, scopeLine: 347, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !141, templateParams: !68, declaration: !311, retainedNodes: !312)
!309 = !DISubroutineType(types: !310)
!310 = !{!288, !63}
!311 = !DISubprogram(name: "as_ptr<u8>", linkageName: "_ZN4core3ptr8non_null16NonNull$LT$T$GT$6as_ptr17h98589281e9c099daE", scope: !63, file: !307, line: 347, type: !309, scopeLine: 347, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !68)
!312 = !{!305}
!313 = !DILocation(line: 347, column: 25, scope: !306, inlinedAt: !314)
!314 = !DILocation(line: 106, column: 22, scope: !296, inlinedAt: !304)
!315 = !DILocalVariable(name: "data", arg: 1, scope: !316, file: !317, line: 94, type: !67)
!316 = distinct !DILexicalBlock(scope: !318, file: !317, line: 94, column: 1)
!317 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/core/src/slice/raw.rs", directory: "", checksumkind: CSK_MD5, checksum: "503b19e16c498622a7ca460c2aab934c")
!318 = distinct !DISubprogram(name: "from_raw_parts<u8>", linkageName: "_ZN4core5slice3raw14from_raw_parts17h3d8e9e121c4546faE", scope: !319, file: !317, line: 94, type: !321, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !141, templateParams: !68, retainedNodes: !323)
!319 = !DINamespace(name: "raw", scope: !320)
!320 = !DINamespace(name: "slice", scope: !60)
!321 = !DISubroutineType(types: !322)
!322 = !{!266, !67, !9}
!323 = !{!315, !324}
!324 = !DILocalVariable(name: "len", arg: 2, scope: !316, file: !317, line: 94, type: !9)
!325 = !DILocation(line: 94, column: 43, scope: !316, inlinedAt: !326)
!326 = !DILocation(line: 2706, column: 18, scope: !260, inlinedAt: !258)
!327 = !DILocalVariable(name: "data", arg: 1, scope: !328, file: !329, line: 770, type: !67)
!328 = distinct !DILexicalBlock(scope: !330, file: !329, line: 770, column: 1)
!329 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "f7e71cc5fe46b5d7ce750e8b099ff7ff")
!330 = distinct !DISubprogram(name: "slice_from_raw_parts<u8>", linkageName: "_ZN4core3ptr20slice_from_raw_parts17h4e3ec6bb8cbbfb1eE", scope: !59, file: !329, line: 770, type: !331, scopeLine: 770, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !141, templateParams: !68, retainedNodes: !337)
!331 = !DISubroutineType(types: !332)
!332 = !{!333, !67, !9}
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: "*const [u8]", file: !2, size: 128, align: 64, elements: !334, templateParams: !23, identifier: "a329dffc2f36de2e98a77091932cf429")
!334 = !{!335, !336}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !333, file: !2, baseType: !234, size: 64, align: 64)
!336 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !333, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!337 = !{!327, !338}
!338 = !DILocalVariable(name: "len", arg: 2, scope: !328, file: !329, line: 770, type: !9)
!339 = !DILocation(line: 770, column: 38, scope: !328, inlinedAt: !340)
!340 = !DILocation(line: 102, column: 11, scope: !316, inlinedAt: !326)
!341 = !DILocalVariable(name: "self", arg: 1, scope: !342, file: !343, line: 60, type: !67)
!342 = distinct !DILexicalBlock(scope: !344, file: !343, line: 60, column: 5)
!343 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/core/src/ptr/const_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "09014d329840bfd2d530919196ac4f25")
!344 = distinct !DISubprogram(name: "cast<u8, ()>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4cast17hc4c644fdd16123c1E", scope: !345, file: !343, line: 60, type: !347, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !141, templateParams: !350, retainedNodes: !349)
!345 = !DINamespace(name: "{impl#0}", scope: !346)
!346 = !DINamespace(name: "const_ptr", scope: !59)
!347 = !DISubroutineType(types: !348)
!348 = !{!6, !67}
!349 = !{!341}
!350 = !{!69, !351}
!351 = !DITemplateTypeParameter(name: "U", type: !7)
!352 = !DILocation(line: 60, column: 26, scope: !342, inlinedAt: !353)
!353 = !DILocation(line: 771, column: 25, scope: !328, inlinedAt: !340)
!354 = !DILocation(line: 2706, column: 55, scope: !260, inlinedAt: !258)
!355 = !DILocation(line: 94, column: 59, scope: !316, inlinedAt: !326)
!356 = !DILocation(line: 770, column: 54, scope: !328, inlinedAt: !340)
!357 = !DILocalVariable(name: "metadata", arg: 2, scope: !358, file: !359, line: 113, type: !9)
!358 = distinct !DILexicalBlock(scope: !360, file: !359, line: 111, column: 1)
!359 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/core/src/ptr/metadata.rs", directory: "", checksumkind: CSK_MD5, checksum: "4472b554dca0dc78bd5034d5fa5d3bf2")
!360 = distinct !DISubprogram(name: "from_raw_parts<[u8]>", linkageName: "_ZN4core3ptr8metadata14from_raw_parts17he866c4cb683fde59E", scope: !361, file: !359, line: 111, type: !362, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !141, templateParams: !68, retainedNodes: !364)
!361 = !DINamespace(name: "metadata", scope: !59)
!362 = !DISubroutineType(types: !363)
!363 = !{!333, !6, !9}
!364 = !{!365, !357}
!365 = !DILocalVariable(name: "data_pointer", arg: 1, scope: !358, file: !359, line: 112, type: !6)
!366 = !DILocation(line: 113, column: 5, scope: !358, inlinedAt: !367)
!367 = !DILocation(line: 771, column: 5, scope: !328, inlinedAt: !340)
!368 = !DILocation(line: 61, column: 9, scope: !342, inlinedAt: !353)
!369 = !DILocation(line: 112, column: 5, scope: !358, inlinedAt: !367)
!370 = !DILocation(line: 118, column: 36, scope: !358, inlinedAt: !367)
!371 = !DILocation(line: 118, column: 14, scope: !358, inlinedAt: !367)
!372 = !DILocalVariable(name: "v", arg: 1, scope: !373, file: !374, line: 173, type: !333)
!373 = distinct !DILexicalBlock(scope: !375, file: !374, line: 173, column: 1)
!374 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/core/src/str/converts.rs", directory: "", checksumkind: CSK_MD5, checksum: "05e96ac3dc3df0b6e182b2ac1a4d63b7")
!375 = distinct !DISubprogram(name: "from_utf8_unchecked", linkageName: "_ZN4core3str8converts19from_utf8_unchecked17he4d20aaa0cc81e21E", scope: !376, file: !374, line: 173, type: !377, scopeLine: 173, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !141, templateParams: !23, retainedNodes: !379)
!376 = !DINamespace(name: "converts", scope: !93)
!377 = !DISubroutineType(types: !378)
!378 = !{!231, !266}
!379 = !{!372}
!380 = !DILocation(line: 173, column: 41, scope: !373, inlinedAt: !381)
!381 = !DILocation(line: 2464, column: 18, scope: !225)
!382 = !DILocation(line: 2465, column: 6, scope: !225)
!383 = distinct !DISubprogram(name: "__rust_begin_short_backtrace<fn(), ()>", linkageName: "_ZN3std10sys_common9backtrace28__rust_begin_short_backtrace17h7f91407455b2c4f7E", scope: !385, file: !384, line: 151, type: !387, scopeLine: 151, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !141, templateParams: !393, retainedNodes: !389)
!384 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/std/src/sys_common/backtrace.rs", directory: "", checksumkind: CSK_MD5, checksum: "ea95829b2a6298387d0233825edf7299")
!385 = !DINamespace(name: "backtrace", scope: !386)
!386 = !DINamespace(name: "sys_common", scope: !17)
!387 = !DISubroutineType(types: !388)
!388 = !{null, !20}
!389 = !{!390, !391}
!390 = !DILocalVariable(name: "f", arg: 1, scope: !383, file: !384, line: 151, type: !20)
!391 = !DILocalVariable(name: "result", scope: !392, file: !384, line: 155, type: !7, align: 1)
!392 = distinct !DILexicalBlock(scope: !383, file: !384, line: 155, column: 5)
!393 = !{!394, !395}
!394 = !DITemplateTypeParameter(name: "F", type: !20)
!395 = !DITemplateTypeParameter(name: "T", type: !7)
!396 = !DILocalVariable(name: "dummy", scope: !397, file: !398, line: 333, type: !7, align: 1)
!397 = distinct !DILexicalBlock(scope: !399, file: !398, line: 333, column: 1)
!398 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/core/src/hint.rs", directory: "", checksumkind: CSK_MD5, checksum: "9e658e1509a108e11f079d44cec9a3fb")
!399 = distinct !DISubprogram(name: "black_box<()>", linkageName: "_ZN4core4hint9black_box17h70fa2c7f36b5fe70E", scope: !400, file: !398, line: 333, type: !401, scopeLine: 333, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !141, templateParams: !404, retainedNodes: !403)
!400 = !DINamespace(name: "hint", scope: !60)
!401 = !DISubroutineType(types: !402)
!402 = !{null, !7}
!403 = !{!396}
!404 = !{!395}
!405 = !DILocation(line: 333, column: 27, scope: !397, inlinedAt: !406)
!406 = !DILocation(line: 158, column: 5, scope: !392)
!407 = !DILocation(line: 155, column: 9, scope: !392)
!408 = !DILocation(line: 151, column: 43, scope: !383)
!409 = !DILocation(line: 155, column: 18, scope: !383)
!410 = !DILocation(line: 334, column: 5, scope: !397, inlinedAt: !406)
!411 = !{i32 3681821}
!412 = !DILocation(line: 161, column: 2, scope: !383)
!413 = distinct !DISubprogram(name: "lang_start<()>", linkageName: "_ZN3std2rt10lang_start17h40e0ed9736028e98E", scope: !16, file: !414, line: 159, type: !415, scopeLine: 159, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !141, templateParams: !404, retainedNodes: !419)
!414 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/std/src/rt.rs", directory: "", checksumkind: CSK_MD5, checksum: "37ab242d99ebf1886f0e7617537b82aa")
!415 = !DISubroutineType(types: !416)
!416 = !{!417, !20, !417, !418, !33}
!417 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!418 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const *const u8", baseType: !67, size: 64, align: 64, dwarfAddressSpace: 0)
!419 = !{!420, !421, !422, !423, !424}
!420 = !DILocalVariable(name: "main", arg: 1, scope: !413, file: !414, line: 160, type: !20)
!421 = !DILocalVariable(name: "argc", arg: 2, scope: !413, file: !414, line: 161, type: !417)
!422 = !DILocalVariable(name: "argv", arg: 3, scope: !413, file: !414, line: 162, type: !418)
!423 = !DILocalVariable(name: "sigpipe", arg: 4, scope: !413, file: !414, line: 163, type: !33)
!424 = !DILocalVariable(name: "v", scope: !425, file: !414, line: 165, type: !417, align: 8)
!425 = distinct !DILexicalBlock(scope: !413, file: !414, line: 165, column: 5)
!426 = !DILocation(line: 160, column: 5, scope: !413)
!427 = !DILocation(line: 161, column: 5, scope: !413)
!428 = !DILocation(line: 162, column: 5, scope: !413)
!429 = !DILocation(line: 163, column: 5, scope: !413)
!430 = !DILocation(line: 166, column: 10, scope: !413)
!431 = !DILocation(line: 165, column: 17, scope: !413)
!432 = !DILocation(line: 165, column: 12, scope: !413)
!433 = !DILocation(line: 165, column: 12, scope: !425)
!434 = !DILocation(line: 172, column: 2, scope: !413)
!435 = distinct !DISubprogram(name: "{closure#0}<()>", linkageName: "_ZN3std2rt10lang_start28_$u7b$$u7b$closure$u7d$$u7d$17hefd9df45866168a1E", scope: !15, file: !414, line: 166, type: !436, scopeLine: 166, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !141, templateParams: !404, retainedNodes: !440)
!436 = !DISubroutineType(types: !437)
!437 = !{!438, !439}
!438 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!439 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::rt::lang_start::{closure_env#0}<()>", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!440 = !{!441}
!441 = !DILocalVariable(name: "main", scope: !435, file: !414, line: 160, type: !20, align: 8)
!442 = !DILocation(line: 160, column: 5, scope: !435)
!443 = !DILocalVariable(name: "self", arg: 1, scope: !444, file: !445, line: 1958, type: !447)
!444 = distinct !DILexicalBlock(scope: !446, file: !445, line: 1958, column: 5)
!445 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/std/src/process.rs", directory: "", checksumkind: CSK_MD5, checksum: "4237b9da5f67550242d4bb113252837f")
!446 = distinct !DISubprogram(name: "to_i32", linkageName: "_ZN3std7process8ExitCode6to_i3217h82312d6879accda1E", scope: !447, file: !445, line: 1958, type: !459, scopeLine: 1958, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !141, templateParams: !23, declaration: !461, retainedNodes: !462)
!447 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExitCode", scope: !448, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !449, templateParams: !23, identifier: "5961cb4d4e35861215b96c335823791a")
!448 = !DINamespace(name: "process", scope: !17)
!449 = !{!450}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !447, file: !2, baseType: !451, size: 8, align: 8, flags: DIFlagPrivate)
!451 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExitCode", scope: !452, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !457, templateParams: !23, identifier: "7702fb636587915d7be9289af947b189")
!452 = !DINamespace(name: "process_common", scope: !453)
!453 = !DINamespace(name: "process", scope: !454)
!454 = !DINamespace(name: "unix", scope: !455)
!455 = !DINamespace(name: "pal", scope: !456)
!456 = !DINamespace(name: "sys", scope: !17)
!457 = !{!458}
!458 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !451, file: !2, baseType: !33, size: 8, align: 8, flags: DIFlagPrivate)
!459 = !DISubroutineType(types: !460)
!460 = !{!438, !447}
!461 = !DISubprogram(name: "to_i32", linkageName: "_ZN3std7process8ExitCode6to_i3217h82312d6879accda1E", scope: !447, file: !445, line: 1958, type: !459, scopeLine: 1958, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !23)
!462 = !{!443}
!463 = !DILocation(line: 1958, column: 19, scope: !444, inlinedAt: !464)
!464 = !DILocation(line: 166, column: 92, scope: !435)
!465 = !DILocation(line: 166, column: 77, scope: !435)
!466 = !DILocation(line: 166, column: 18, scope: !435)
!467 = !DILocation(line: 1959, column: 9, scope: !444, inlinedAt: !464)
!468 = !DILocalVariable(name: "self", arg: 1, scope: !469, file: !470, line: 638, type: !474)
!469 = distinct !DILexicalBlock(scope: !471, file: !470, line: 638, column: 5)
!470 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/std/src/sys/pal/unix/process/process_common.rs", directory: "", checksumkind: CSK_MD5, checksum: "f12d6cc5fbe6e47291b02b1d467e8da3")
!471 = distinct !DISubprogram(name: "as_i32", linkageName: "_ZN3std3sys3pal4unix7process14process_common8ExitCode6as_i3217h46cb84e6ad28a9b0E", scope: !451, file: !470, line: 638, type: !472, scopeLine: 638, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !141, templateParams: !23, declaration: !475, retainedNodes: !476)
!472 = !DISubroutineType(types: !473)
!473 = !{!438, !474}
!474 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::sys::pal::unix::process::process_common::ExitCode", baseType: !451, size: 64, align: 64, dwarfAddressSpace: 0)
!475 = !DISubprogram(name: "as_i32", linkageName: "_ZN3std3sys3pal4unix7process14process_common8ExitCode6as_i3217h46cb84e6ad28a9b0E", scope: !451, file: !470, line: 638, type: !472, scopeLine: 638, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !23)
!476 = !{!468}
!477 = !DILocation(line: 638, column: 19, scope: !469, inlinedAt: !478)
!478 = !DILocation(line: 1959, column: 16, scope: !444, inlinedAt: !464)
!479 = !DILocation(line: 639, column: 9, scope: !469, inlinedAt: !478)
!480 = !DILocation(line: 166, column: 100, scope: !435)
!481 = distinct !DISubprogram(name: "fmt<u8>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h68f7216f46a86412E", scope: !483, file: !482, line: 2294, type: !484, scopeLine: 2294, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !141, templateParams: !68, retainedNodes: !537)
!482 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "f2f9e528240e472a11f8ea13e1ff6e2a")
!483 = !DINamespace(name: "{impl#51}", scope: !146)
!484 = !DISubroutineType(types: !485)
!485 = !{!486, !503, !504}
!486 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !487, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !488, templateParams: !23, identifier: "ef21c1a4a7a3bb675edf359fd7da20c2")
!487 = !DINamespace(name: "result", scope: !60)
!488 = !{!489}
!489 = !DICompositeType(tag: DW_TAG_variant_part, scope: !486, file: !2, size: 8, align: 8, elements: !490, templateParams: !23, identifier: "1e6064d2fa7899348d4637058c3df544", discriminator: !502)
!490 = !{!491, !498}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !489, file: !2, baseType: !492, size: 8, align: 8, extraData: i128 0)
!492 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !486, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !493, templateParams: !495, identifier: "4676f9084c1926904df27c02f470a258")
!493 = !{!494}
!494 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !492, file: !2, baseType: !7, align: 8, offset: 8, flags: DIFlagPublic)
!495 = !{!395, !496}
!496 = !DITemplateTypeParameter(name: "E", type: !497)
!497 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !146, file: !2, align: 8, flags: DIFlagPublic, elements: !23, identifier: "525f7c35922c78aaf2831aa7e2d5fd8b")
!498 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !489, file: !2, baseType: !499, size: 8, align: 8, extraData: i128 1)
!499 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !486, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !500, templateParams: !495, identifier: "4fc1bf8c8c918aa838a2a0aa40186b71")
!500 = !{!501}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !499, file: !2, baseType: !497, align: 8, offset: 8, flags: DIFlagPublic)
!502 = !DIDerivedType(tag: DW_TAG_member, scope: !486, file: !2, baseType: !33, size: 8, align: 8, flags: DIFlagArtificial)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&u8", baseType: !32, size: 64, align: 64, dwarfAddressSpace: 0)
!504 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !505, size: 64, align: 64, dwarfAddressSpace: 0)
!505 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !146, file: !2, size: 512, align: 64, flags: DIFlagPublic, elements: !506, templateParams: !23, identifier: "c2a81c20b281ad088a53ffd69742e2f1")
!506 = !{!507, !508, !510, !511, !525, !526}
!507 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !505, file: !2, baseType: !250, size: 32, align: 32, offset: 416, flags: DIFlagPrivate)
!508 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !505, file: !2, baseType: !509, size: 32, align: 32, offset: 384, flags: DIFlagPrivate)
!509 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!510 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !505, file: !2, baseType: !144, size: 8, align: 8, offset: 448, flags: DIFlagPrivate)
!511 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !505, file: !2, baseType: !512, size: 128, align: 64, flags: DIFlagPrivate)
!512 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !98, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !513, templateParams: !23, identifier: "f4d83d61e370ffa2bf86fb2b476c03b9")
!513 = !{!514}
!514 = !DICompositeType(tag: DW_TAG_variant_part, scope: !512, file: !2, size: 128, align: 64, elements: !515, templateParams: !23, identifier: "2e6a6158b8523df5f27116dc0cb3efb2", discriminator: !524)
!515 = !{!516, !520}
!516 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !514, file: !2, baseType: !517, size: 128, align: 64, extraData: i128 0)
!517 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !512, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !23, templateParams: !518, identifier: "bad25d21ed86c6e99411c76de143d53a")
!518 = !{!519}
!519 = !DITemplateTypeParameter(name: "T", type: !9)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !514, file: !2, baseType: !521, size: 128, align: 64, extraData: i128 1)
!521 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !512, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !522, templateParams: !518, identifier: "825bd40f4b16f9f7d54c405cc2904cf6")
!522 = !{!523}
!523 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !521, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!524 = !DIDerivedType(tag: DW_TAG_member, scope: !512, file: !2, baseType: !154, size: 64, align: 64, flags: DIFlagArtificial)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !505, file: !2, baseType: !512, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !505, file: !2, baseType: !527, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!527 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !528, templateParams: !23, identifier: "d242d9e3b9076fd347f00d776e8d4173")
!528 = !{!529, !532}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !527, file: !2, baseType: !530, size: 64, align: 64)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !531, size: 64, align: 64, dwarfAddressSpace: 0)
!531 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !23, identifier: "6f41b2858562f876d2b2674263e48852")
!532 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !527, file: !2, baseType: !533, size: 64, align: 64, offset: 64)
!533 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !534, size: 64, align: 64, dwarfAddressSpace: 0)
!534 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !535)
!535 = !{!536}
!536 = !DISubrange(count: 3, lowerBound: 0)
!537 = !{!538, !539}
!538 = !DILocalVariable(name: "self", arg: 1, scope: !481, file: !482, line: 2294, type: !503)
!539 = !DILocalVariable(name: "f", arg: 2, scope: !481, file: !482, line: 2294, type: !504)
!540 = !DILocation(line: 2294, column: 20, scope: !481)
!541 = !DILocation(line: 2294, column: 27, scope: !481)
!542 = !DILocation(line: 2294, column: 71, scope: !481)
!543 = !{i64 1}
!544 = !DILocation(line: 2294, column: 62, scope: !481)
!545 = !DILocation(line: 2294, column: 84, scope: !481)
!546 = distinct !DISubprogram(name: "fmt<core::option::Option<u8>>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h7d547154c0bd037eE", scope: !483, file: !482, line: 2294, type: !547, scopeLine: 2294, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !141, templateParams: !553, retainedNodes: !550)
!547 = !DISubroutineType(types: !548)
!548 = !{!486, !549, !504}
!549 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&core::option::Option<u8>", baseType: !134, size: 64, align: 64, dwarfAddressSpace: 0)
!550 = !{!551, !552}
!551 = !DILocalVariable(name: "self", arg: 1, scope: !546, file: !482, line: 2294, type: !549)
!552 = !DILocalVariable(name: "f", arg: 2, scope: !546, file: !482, line: 2294, type: !504)
!553 = !{!554}
!554 = !DITemplateTypeParameter(name: "T", type: !97)
!555 = !DILocation(line: 2294, column: 20, scope: !546)
!556 = !DILocation(line: 2294, column: 27, scope: !546)
!557 = !DILocation(line: 2294, column: 71, scope: !546)
!558 = !DILocation(line: 2294, column: 62, scope: !546)
!559 = !DILocation(line: 2294, column: 84, scope: !546)
!560 = distinct !DISubprogram(name: "fmt<alloc::vec::Vec<u8, alloc::alloc::Global>>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17hc3e0cd91378a5a19E", scope: !483, file: !482, line: 2294, type: !561, scopeLine: 2294, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !141, templateParams: !567, retainedNodes: !564)
!561 = !DISubroutineType(types: !562)
!562 = !{!486, !563, !504}
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&alloc::vec::Vec<u8, alloc::alloc::Global>", baseType: !125, size: 64, align: 64, dwarfAddressSpace: 0)
!564 = !{!565, !566}
!565 = !DILocalVariable(name: "self", arg: 1, scope: !560, file: !482, line: 2294, type: !563)
!566 = !DILocalVariable(name: "f", arg: 2, scope: !560, file: !482, line: 2294, type: !504)
!567 = !{!568}
!568 = !DITemplateTypeParameter(name: "T", type: !49)
!569 = !DILocation(line: 2294, column: 20, scope: !560)
!570 = !DILocation(line: 2294, column: 27, scope: !560)
!571 = !DILocation(line: 2294, column: 71, scope: !560)
!572 = !{i64 8}
!573 = !DILocation(line: 2294, column: 62, scope: !560)
!574 = !DILocation(line: 2294, column: 84, scope: !560)
!575 = distinct !DISubprogram(name: "fmt<u8>", linkageName: "_ZN48_$LT$$u5b$T$u5d$$u20$as$u20$core..fmt..Debug$GT$3fmt17hd51a57cb3f229f67E", scope: !576, file: !482, line: 2521, type: !577, scopeLine: 2521, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !141, templateParams: !68, retainedNodes: !579)
!576 = !DINamespace(name: "{impl#24}", scope: !146)
!577 = !DISubroutineType(types: !578)
!578 = !{!486, !266, !504}
!579 = !{!580, !581}
!580 = !DILocalVariable(name: "self", arg: 1, scope: !575, file: !482, line: 2521, type: !266)
!581 = !DILocalVariable(name: "f", arg: 2, scope: !575, file: !482, line: 2521, type: !504)
!582 = !DILocation(line: 2521, column: 12, scope: !575)
!583 = !DILocalVariable(name: "self", arg: 1, scope: !584, file: !585, line: 1020, type: !266)
!584 = distinct !DILexicalBlock(scope: !586, file: !585, line: 1020, column: 5)
!585 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/core/src/slice/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "71bbaa1f5376cf26aa2adb7892a250f9")
!586 = distinct !DISubprogram(name: "iter<u8>", linkageName: "_ZN4core5slice29_$LT$impl$u20$$u5b$T$u5d$$GT$4iter17hca95d6f6dfae30e3E", scope: !587, file: !585, line: 1020, type: !588, scopeLine: 1020, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !141, templateParams: !68, retainedNodes: !599)
!587 = !DINamespace(name: "{impl#0}", scope: !320)
!588 = !DISubroutineType(types: !589)
!589 = !{!590, !266}
!590 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<u8>", scope: !591, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !592, templateParams: !68, identifier: "dfe909ef45f7c501e4f9392f0a7ddd5f")
!591 = !DINamespace(name: "iter", scope: !320)
!592 = !{!593, !594, !595}
!593 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !590, file: !2, baseType: !63, size: 64, align: 64, flags: DIFlagPrivate)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "end_or_len", scope: !590, file: !2, baseType: !67, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !590, file: !2, baseType: !596, align: 8, offset: 128, flags: DIFlagPrivate)
!596 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&u8>", scope: !72, file: !2, align: 8, flags: DIFlagPublic, elements: !23, templateParams: !597, identifier: "98cf3c61d71667f2be4899dafc6fc74")
!597 = !{!598}
!598 = !DITemplateTypeParameter(name: "T", type: !32)
!599 = !{!583}
!600 = !DILocation(line: 1020, column: 17, scope: !584, inlinedAt: !601)
!601 = !DILocation(line: 2522, column: 37, scope: !575)
!602 = !DILocalVariable(name: "slice", arg: 1, scope: !603, file: !604, line: 89, type: !266)
!603 = distinct !DILexicalBlock(scope: !605, file: !604, line: 89, column: 5)
!604 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/core/src/slice/iter.rs", directory: "", checksumkind: CSK_MD5, checksum: "5ed64ef65fe7e9ccc245af8ae7fa541d")
!605 = distinct !DISubprogram(name: "new<u8>", linkageName: "_ZN4core5slice4iter13Iter$LT$T$GT$3new17h0c8a8839006776e1E", scope: !590, file: !604, line: 89, type: !588, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !141, templateParams: !68, declaration: !606, retainedNodes: !607)
!606 = !DISubprogram(name: "new<u8>", linkageName: "_ZN4core5slice4iter13Iter$LT$T$GT$3new17h0c8a8839006776e1E", scope: !590, file: !604, line: 89, type: !588, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !68)
!607 = !{!602, !608, !610}
!608 = !DILocalVariable(name: "ptr", scope: !609, file: !604, line: 90, type: !67, align: 8)
!609 = distinct !DILexicalBlock(scope: !603, file: !604, line: 90, column: 9)
!610 = !DILocalVariable(name: "end_or_len", scope: !611, file: !604, line: 93, type: !67, align: 8)
!611 = distinct !DILexicalBlock(scope: !609, file: !604, line: 93, column: 13)
!612 = !DILocation(line: 89, column: 23, scope: !603, inlinedAt: !613)
!613 = !DILocation(line: 1021, column: 9, scope: !584, inlinedAt: !601)
!614 = !DILocalVariable(name: "self", arg: 1, scope: !615, file: !585, line: 753, type: !266)
!615 = distinct !DILexicalBlock(scope: !616, file: !585, line: 753, column: 5)
!616 = distinct !DISubprogram(name: "as_ptr<u8>", linkageName: "_ZN4core5slice29_$LT$impl$u20$$u5b$T$u5d$$GT$6as_ptr17hd6552da9cf26b02fE", scope: !587, file: !585, line: 753, type: !617, scopeLine: 753, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !141, templateParams: !68, retainedNodes: !619)
!617 = !DISubroutineType(types: !618)
!618 = !{!67, !266}
!619 = !{!614}
!620 = !DILocation(line: 753, column: 25, scope: !615, inlinedAt: !621)
!621 = !DILocation(line: 90, column: 25, scope: !603, inlinedAt: !613)
!622 = !DILocation(line: 2521, column: 19, scope: !575)
!623 = !DILocation(line: 93, column: 17, scope: !611, inlinedAt: !613)
!624 = !DILocation(line: 2522, column: 9, scope: !575)
!625 = !DILocation(line: 754, column: 9, scope: !615, inlinedAt: !621)
!626 = !DILocation(line: 90, column: 13, scope: !609, inlinedAt: !613)
!627 = !DILocalVariable(name: "self", arg: 1, scope: !628, file: !343, line: 939, type: !67)
!628 = distinct !DILexicalBlock(scope: !629, file: !343, line: 939, column: 5)
!629 = distinct !DISubprogram(name: "add<u8>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$3add17h240bc4447102d9aeE", scope: !345, file: !343, line: 939, type: !630, scopeLine: 939, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !141, templateParams: !68, retainedNodes: !632)
!630 = !DISubroutineType(types: !631)
!631 = !{!67, !67, !9}
!632 = !{!627, !633}
!633 = !DILocalVariable(name: "count", arg: 2, scope: !628, file: !343, line: 939, type: !9)
!634 = !DILocation(line: 939, column: 29, scope: !628, inlinedAt: !635)
!635 = !DILocation(line: 93, column: 79, scope: !609, inlinedAt: !613)
!636 = !DILocation(line: 93, column: 33, scope: !609, inlinedAt: !613)
!637 = !DILocation(line: 93, column: 83, scope: !609, inlinedAt: !613)
!638 = !DILocation(line: 939, column: 35, scope: !628, inlinedAt: !635)
!639 = !DILocation(line: 944, column: 18, scope: !628, inlinedAt: !635)
!640 = !DILocation(line: 93, column: 30, scope: !609, inlinedAt: !613)
!641 = !DILocation(line: 93, column: 53, scope: !609, inlinedAt: !613)
!642 = !DILocalVariable(name: "addr", arg: 1, scope: !643, file: !329, line: 589, type: !9)
!643 = distinct !DILexicalBlock(scope: !644, file: !329, line: 589, column: 1)
!644 = distinct !DISubprogram(name: "invalid<u8>", linkageName: "_ZN4core3ptr7invalid17hae0a4548c124286eE", scope: !59, file: !329, line: 589, type: !645, scopeLine: 589, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !141, templateParams: !68, retainedNodes: !647)
!645 = !DISubroutineType(types: !646)
!646 = !{!67, !9}
!647 = !{!642}
!648 = !DILocation(line: 589, column: 25, scope: !643, inlinedAt: !649)
!649 = !DILocation(line: 93, column: 45, scope: !609, inlinedAt: !613)
!650 = !DILocation(line: 595, column: 14, scope: !643, inlinedAt: !649)
!651 = !DILocation(line: 95, column: 48, scope: !611, inlinedAt: !613)
!652 = !DILocalVariable(name: "ptr", arg: 1, scope: !653, file: !307, line: 218, type: !288)
!653 = distinct !DILexicalBlock(scope: !654, file: !307, line: 218, column: 5)
!654 = distinct !DISubprogram(name: "new_unchecked<u8>", linkageName: "_ZN4core3ptr8non_null16NonNull$LT$T$GT$13new_unchecked17hc498d71dba1aa835E", scope: !63, file: !307, line: 218, type: !655, scopeLine: 218, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !141, templateParams: !68, declaration: !657, retainedNodes: !658)
!655 = !DISubroutineType(types: !656)
!656 = !{!63, !288}
!657 = !DISubprogram(name: "new_unchecked<u8>", linkageName: "_ZN4core3ptr8non_null16NonNull$LT$T$GT$13new_unchecked17hc498d71dba1aa835E", scope: !63, file: !307, line: 218, type: !655, scopeLine: 218, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !68)
!658 = !{!652}
!659 = !DILocation(line: 218, column: 39, scope: !653, inlinedAt: !660)
!660 = !DILocation(line: 95, column: 25, scope: !611, inlinedAt: !613)
!661 = !DILocation(line: 222, column: 13, scope: !653, inlinedAt: !660)
!662 = !DILocation(line: 95, column: 64, scope: !611, inlinedAt: !613)
!663 = !DILocation(line: 95, column: 13, scope: !611, inlinedAt: !613)
!664 = !DILocation(line: 2523, column: 6, scope: !575)
!665 = distinct !DISubprogram(name: "as_ptr", linkageName: "_ZN4core3ffi5c_str4CStr6as_ptr17h51e348217fd3dfd1E", scope: !667, file: !666, line: 491, type: !673, scopeLine: 491, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !141, templateParams: !23, declaration: !681, retainedNodes: !682)
!666 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/core/src/ffi/c_str.rs", directory: "", checksumkind: CSK_MD5, checksum: "e3aac0915fb7776bfd7efb2c17c28326")
!667 = !DICompositeType(tag: DW_TAG_structure_type, name: "CStr", scope: !668, file: !2, align: 8, flags: DIFlagPublic, elements: !670, templateParams: !23, identifier: "366bc6f9a6768d2bdfe41907f57c028")
!668 = !DINamespace(name: "c_str", scope: !669)
!669 = !DINamespace(name: "ffi", scope: !60)
!670 = !{!671}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !667, file: !2, baseType: !672, align: 8, flags: DIFlagPrivate)
!672 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!673 = !DISubroutineType(types: !674)
!674 = !{!675, !676}
!675 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const i8", baseType: !672, size: 64, align: 64, dwarfAddressSpace: 0)
!676 = !DICompositeType(tag: DW_TAG_structure_type, name: "&core::ffi::c_str::CStr", file: !2, size: 128, align: 64, elements: !677, templateParams: !23, identifier: "95f2fd31c4eebb87c0a18d0ca4154597")
!677 = !{!678, !680}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !676, file: !2, baseType: !679, size: 64, align: 64)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64, align: 64, dwarfAddressSpace: 0)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !676, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!681 = !DISubprogram(name: "as_ptr", linkageName: "_ZN4core3ffi5c_str4CStr6as_ptr17h51e348217fd3dfd1E", scope: !667, file: !666, line: 491, type: !673, scopeLine: 491, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !23)
!682 = !{!683}
!683 = !DILocalVariable(name: "self", arg: 1, scope: !665, file: !666, line: 491, type: !676)
!684 = !DILocation(line: 491, column: 25, scope: !665)
!685 = !DILocation(line: 492, column: 9, scope: !665)
!686 = !DILocalVariable(name: "self", arg: 1, scope: !687, file: !585, line: 753, type: !691)
!687 = distinct !DILexicalBlock(scope: !688, file: !585, line: 753, column: 5)
!688 = distinct !DISubprogram(name: "as_ptr<i8>", linkageName: "_ZN4core5slice29_$LT$impl$u20$$u5b$T$u5d$$GT$6as_ptr17h6786787ef2135f25E", scope: !587, file: !585, line: 753, type: !689, scopeLine: 753, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !141, templateParams: !697, retainedNodes: !696)
!689 = !DISubroutineType(types: !690)
!690 = !{!675, !691}
!691 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[i8]", file: !2, size: 128, align: 64, elements: !692, templateParams: !23, identifier: "48c794eb092151cccbcb9e68b1ce60bf")
!692 = !{!693, !695}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !691, file: !2, baseType: !694, size: 64, align: 64)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !672, size: 64, align: 64, dwarfAddressSpace: 0)
!695 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !691, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!696 = !{!686}
!697 = !{!698}
!698 = !DITemplateTypeParameter(name: "T", type: !672)
!699 = !DILocation(line: 753, column: 25, scope: !687, inlinedAt: !700)
!700 = !DILocation(line: 492, column: 20, scope: !665)
!701 = !DILocation(line: 493, column: 6, scope: !665)
!702 = distinct !DISubprogram(name: "from_ptr", linkageName: "_ZN4core3ffi5c_str4CStr8from_ptr17hcb71c1bbbf3957d3E", scope: !667, file: !666, line: 262, type: !703, scopeLine: 262, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !141, templateParams: !23, declaration: !705, retainedNodes: !706)
!703 = !DISubroutineType(types: !704)
!704 = !{!676, !675}
!705 = !DISubprogram(name: "from_ptr", linkageName: "_ZN4core3ffi5c_str4CStr8from_ptr17hcb71c1bbbf3957d3E", scope: !667, file: !666, line: 262, type: !703, scopeLine: 262, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !23)
!706 = !{!707, !708}
!707 = !DILocalVariable(name: "ptr", arg: 1, scope: !702, file: !666, line: 262, type: !675)
!708 = !DILocalVariable(name: "len", scope: !709, file: !666, line: 265, type: !9, align: 8)
!709 = distinct !DILexicalBlock(scope: !702, file: !666, line: 265, column: 9)
!710 = !DILocation(line: 262, column: 38, scope: !702)
!711 = !DILocalVariable(name: "ptr", arg: 1, scope: !712, file: !666, line: 697, type: !675)
!712 = distinct !DILexicalBlock(scope: !713, file: !666, line: 697, column: 1)
!713 = distinct !DISubprogram(name: "const_strlen", linkageName: "_ZN4core3ffi5c_str12const_strlen17haeb439956b0d65a4E", scope: !668, file: !666, line: 697, type: !714, scopeLine: 697, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !141, templateParams: !23, retainedNodes: !716)
!714 = !DISubroutineType(types: !715)
!715 = !{!9, !675}
!716 = !{!711}
!717 = !DILocation(line: 697, column: 30, scope: !712, inlinedAt: !718)
!718 = !DILocation(line: 265, column: 28, scope: !702)
!719 = !DILocalVariable(name: "s", arg: 1, scope: !720, file: !666, line: 710, type: !675)
!720 = distinct !DILexicalBlock(scope: !721, file: !666, line: 710, column: 5)
!721 = distinct !DISubprogram(name: "strlen_rt", linkageName: "_ZN4core3ffi5c_str12const_strlen9strlen_rt17h7750e671d8941a17E", scope: !722, file: !666, line: 710, type: !714, scopeLine: 710, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !141, templateParams: !23, retainedNodes: !723)
!722 = !DINamespace(name: "const_strlen", scope: !668)
!723 = !{!719}
!724 = !DILocation(line: 710, column: 18, scope: !720, inlinedAt: !725)
!725 = !DILocation(line: 721, column: 14, scope: !712, inlinedAt: !718)
!726 = !DILocalVariable(name: "self", arg: 1, scope: !727, file: !343, line: 60, type: !675)
!727 = distinct !DILexicalBlock(scope: !728, file: !343, line: 60, column: 5)
!728 = distinct !DISubprogram(name: "cast<i8, u8>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4cast17ha0c03921e5790919E", scope: !345, file: !343, line: 60, type: !729, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !141, templateParams: !732, retainedNodes: !731)
!729 = !DISubroutineType(types: !730)
!730 = !{!67, !675}
!731 = !{!726}
!732 = !{!698, !733}
!733 = !DITemplateTypeParameter(name: "U", type: !33)
!734 = !DILocation(line: 60, column: 26, scope: !727, inlinedAt: !735)
!735 = !DILocation(line: 273, column: 80, scope: !709)
!736 = !DILocation(line: 717, column: 18, scope: !720, inlinedAt: !725)
!737 = !DILocation(line: 265, column: 13, scope: !709)
!738 = !DILocation(line: 61, column: 9, scope: !727, inlinedAt: !735)
!739 = !DILocalVariable(name: "data", arg: 1, scope: !740, file: !317, line: 94, type: !67)
!740 = distinct !DILexicalBlock(scope: !741, file: !317, line: 94, column: 1)
!741 = distinct !DISubprogram(name: "from_raw_parts<u8>", linkageName: "_ZN4core5slice3raw14from_raw_parts17h3d8e9e121c4546faE", scope: !319, file: !317, line: 94, type: !321, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !141, templateParams: !68, retainedNodes: !742)
!742 = !{!739, !743}
!743 = !DILocalVariable(name: "len", arg: 2, scope: !740, file: !317, line: 94, type: !9)
!744 = !DILocation(line: 94, column: 43, scope: !740, inlinedAt: !745)
!745 = !DILocation(line: 273, column: 54, scope: !709)
!746 = !DILocalVariable(name: "data", arg: 1, scope: !747, file: !329, line: 770, type: !67)
!747 = distinct !DILexicalBlock(scope: !748, file: !329, line: 770, column: 1)
!748 = distinct !DISubprogram(name: "slice_from_raw_parts<u8>", linkageName: "_ZN4core3ptr20slice_from_raw_parts17h4e3ec6bb8cbbfb1eE", scope: !59, file: !329, line: 770, type: !331, scopeLine: 770, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !141, templateParams: !68, retainedNodes: !749)
!749 = !{!746, !750}
!750 = !DILocalVariable(name: "len", arg: 2, scope: !747, file: !329, line: 770, type: !9)
!751 = !DILocation(line: 770, column: 38, scope: !747, inlinedAt: !752)
!752 = !DILocation(line: 102, column: 11, scope: !740, inlinedAt: !745)
!753 = !DILocalVariable(name: "self", arg: 1, scope: !754, file: !343, line: 60, type: !67)
!754 = distinct !DILexicalBlock(scope: !755, file: !343, line: 60, column: 5)
!755 = distinct !DISubprogram(name: "cast<u8, ()>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4cast17hc4c644fdd16123c1E", scope: !345, file: !343, line: 60, type: !347, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !141, templateParams: !350, retainedNodes: !756)
!756 = !{!753}
!757 = !DILocation(line: 60, column: 26, scope: !754, inlinedAt: !758)
!758 = !DILocation(line: 771, column: 25, scope: !747, inlinedAt: !752)
!759 = !DILocation(line: 273, column: 88, scope: !709)
!760 = !DILocation(line: 94, column: 59, scope: !740, inlinedAt: !745)
!761 = !DILocation(line: 770, column: 54, scope: !747, inlinedAt: !752)
!762 = !DILocalVariable(name: "metadata", arg: 2, scope: !763, file: !359, line: 113, type: !9)
!763 = distinct !DILexicalBlock(scope: !764, file: !359, line: 111, column: 1)
!764 = distinct !DISubprogram(name: "from_raw_parts<[u8]>", linkageName: "_ZN4core3ptr8metadata14from_raw_parts17he866c4cb683fde59E", scope: !361, file: !359, line: 111, type: !362, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !141, templateParams: !68, retainedNodes: !765)
!765 = !{!766, !762}
!766 = !DILocalVariable(name: "data_pointer", arg: 1, scope: !763, file: !359, line: 112, type: !6)
!767 = !DILocation(line: 113, column: 5, scope: !763, inlinedAt: !768)
!768 = !DILocation(line: 771, column: 5, scope: !747, inlinedAt: !752)
!769 = !DILocation(line: 61, column: 9, scope: !754, inlinedAt: !758)
!770 = !DILocation(line: 112, column: 5, scope: !763, inlinedAt: !768)
!771 = !DILocation(line: 118, column: 36, scope: !763, inlinedAt: !768)
!772 = !DILocation(line: 118, column: 14, scope: !763, inlinedAt: !768)
!773 = !DILocalVariable(name: "bytes", arg: 1, scope: !774, file: !666, line: 398, type: !333)
!774 = distinct !DILexicalBlock(scope: !775, file: !666, line: 398, column: 5)
!775 = distinct !DISubprogram(name: "from_bytes_with_nul_unchecked", linkageName: "_ZN4core3ffi5c_str4CStr29from_bytes_with_nul_unchecked17h34cdfc627bee1bd7E", scope: !667, file: !666, line: 398, type: !776, scopeLine: 398, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !141, templateParams: !23, declaration: !778, retainedNodes: !779)
!776 = !DISubroutineType(types: !777)
!777 = !{!676, !266}
!778 = !DISubprogram(name: "from_bytes_with_nul_unchecked", linkageName: "_ZN4core3ffi5c_str4CStr29from_bytes_with_nul_unchecked17h34cdfc627bee1bd7E", scope: !667, file: !666, line: 398, type: !776, scopeLine: 398, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !23)
!779 = !{!773}
!780 = !DILocation(line: 398, column: 55, scope: !774, inlinedAt: !781)
!781 = !DILocation(line: 273, column: 18, scope: !709)
!782 = !DILocalVariable(name: "bytes", arg: 1, scope: !783, file: !666, line: 400, type: !333)
!783 = distinct !DILexicalBlock(scope: !784, file: !666, line: 400, column: 9)
!784 = distinct !DISubprogram(name: "rt_impl", linkageName: "_ZN4core3ffi5c_str4CStr29from_bytes_with_nul_unchecked7rt_impl17h67bf73868afc4e05E", scope: !785, file: !666, line: 400, type: !776, scopeLine: 400, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !141, templateParams: !23, retainedNodes: !787)
!785 = !DINamespace(name: "from_bytes_with_nul_unchecked", scope: !786)
!786 = !DINamespace(name: "{impl#6}", scope: !668)
!787 = !{!782}
!788 = !DILocation(line: 400, column: 20, scope: !783, inlinedAt: !789)
!789 = !DILocation(line: 432, column: 18, scope: !774, inlinedAt: !781)
!790 = !DILocalVariable(name: "self", arg: 1, scope: !791, file: !585, line: 154, type: !333)
!791 = distinct !DILexicalBlock(scope: !792, file: !585, line: 154, column: 5)
!792 = distinct !DISubprogram(name: "is_empty<u8>", linkageName: "_ZN4core5slice29_$LT$impl$u20$$u5b$T$u5d$$GT$8is_empty17h80182eb1ca60a7f7E", scope: !587, file: !585, line: 154, type: !793, scopeLine: 154, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !141, templateParams: !68, retainedNodes: !796)
!793 = !DISubroutineType(types: !794)
!794 = !{!795, !266}
!795 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!796 = !{!790}
!797 = !DILocation(line: 154, column: 27, scope: !791, inlinedAt: !798)
!798 = !DILocation(line: 402, column: 34, scope: !783, inlinedAt: !789)
!799 = !DILocation(line: 274, column: 6, scope: !702)
!800 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN4core3fmt3num49_$LT$impl$u20$core..fmt..Debug$u20$for$u20$u8$GT$3fmt17h800dcb9e31f4841cE", scope: !802, file: !801, line: 189, type: !804, scopeLine: 189, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !141, templateParams: !23, retainedNodes: !806)
!801 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/core/src/fmt/num.rs", directory: "", checksumkind: CSK_MD5, checksum: "e54845ef989d12b8a79056a0477bb701")
!802 = !DINamespace(name: "{impl#84}", scope: !803)
!803 = !DINamespace(name: "num", scope: !146)
!804 = !DISubroutineType(types: !805)
!805 = !{!486, !32, !504}
!806 = !{!807, !808}
!807 = !DILocalVariable(name: "self", arg: 1, scope: !800, file: !801, line: 189, type: !32)
!808 = !DILocalVariable(name: "f", arg: 2, scope: !800, file: !801, line: 189, type: !504)
!809 = !DILocation(line: 189, column: 20, scope: !800)
!810 = !DILocation(line: 189, column: 27, scope: !800)
!811 = !DILocalVariable(name: "self", arg: 1, scope: !812, file: !482, line: 1852, type: !504)
!812 = distinct !DILexicalBlock(scope: !813, file: !482, line: 1852, column: 5)
!813 = distinct !DISubprogram(name: "debug_lower_hex", linkageName: "_ZN4core3fmt9Formatter15debug_lower_hex17hc9acea564026d6feE", scope: !505, file: !482, line: 1852, type: !814, scopeLine: 1852, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !141, templateParams: !23, declaration: !817, retainedNodes: !818)
!814 = !DISubroutineType(types: !815)
!815 = !{!795, !816}
!816 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::Formatter", baseType: !505, size: 64, align: 64, dwarfAddressSpace: 0)
!817 = !DISubprogram(name: "debug_lower_hex", linkageName: "_ZN4core3fmt9Formatter15debug_lower_hex17hc9acea564026d6feE", scope: !505, file: !482, line: 1852, type: !814, scopeLine: 1852, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !23)
!818 = !{!811}
!819 = !DILocation(line: 1852, column: 24, scope: !812, inlinedAt: !820)
!820 = !DILocation(line: 190, column: 22, scope: !800)
!821 = !DILocalVariable(name: "self", arg: 1, scope: !822, file: !482, line: 1856, type: !504)
!822 = distinct !DILexicalBlock(scope: !823, file: !482, line: 1856, column: 5)
!823 = distinct !DISubprogram(name: "debug_upper_hex", linkageName: "_ZN4core3fmt9Formatter15debug_upper_hex17h310cc681ef1aa455E", scope: !505, file: !482, line: 1856, type: !814, scopeLine: 1856, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !141, templateParams: !23, declaration: !824, retainedNodes: !825)
!824 = !DISubprogram(name: "debug_upper_hex", linkageName: "_ZN4core3fmt9Formatter15debug_upper_hex17h310cc681ef1aa455E", scope: !505, file: !482, line: 1856, type: !814, scopeLine: 1856, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !23)
!825 = !{!821}
!826 = !DILocation(line: 1856, column: 24, scope: !822, inlinedAt: !827)
!827 = !DILocation(line: 192, column: 29, scope: !800)
!828 = !DILocation(line: 1853, column: 9, scope: !812, inlinedAt: !820)
!829 = !DILocation(line: 190, column: 20, scope: !800)
!830 = !DILocation(line: 1857, column: 9, scope: !822, inlinedAt: !827)
!831 = !DILocation(line: 192, column: 27, scope: !800)
!832 = !DILocation(line: 191, column: 21, scope: !800)
!833 = !DILocation(line: 195, column: 21, scope: !800)
!834 = !DILocation(line: 193, column: 21, scope: !800)
!835 = !DILocation(line: 190, column: 17, scope: !800)
!836 = !DILocation(line: 197, column: 14, scope: !800)
!837 = !{i8 0, i8 2}
!838 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN4core3fmt3num52_$LT$impl$u20$core..fmt..Debug$u20$for$u20$usize$GT$3fmt17h6e239098b80b549aE", scope: !839, file: !801, line: 189, type: !840, scopeLine: 189, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !141, templateParams: !23, retainedNodes: !843)
!839 = !DINamespace(name: "{impl#89}", scope: !803)
!840 = !DISubroutineType(types: !841)
!841 = !{!486, !842, !504}
!842 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!843 = !{!844, !845}
!844 = !DILocalVariable(name: "self", arg: 1, scope: !838, file: !801, line: 189, type: !842)
!845 = !DILocalVariable(name: "f", arg: 2, scope: !838, file: !801, line: 189, type: !504)
!846 = !DILocation(line: 189, column: 20, scope: !838)
!847 = !DILocation(line: 189, column: 27, scope: !838)
!848 = !DILocalVariable(name: "self", arg: 1, scope: !849, file: !482, line: 1852, type: !504)
!849 = distinct !DILexicalBlock(scope: !850, file: !482, line: 1852, column: 5)
!850 = distinct !DISubprogram(name: "debug_lower_hex", linkageName: "_ZN4core3fmt9Formatter15debug_lower_hex17hc9acea564026d6feE", scope: !505, file: !482, line: 1852, type: !814, scopeLine: 1852, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !141, templateParams: !23, declaration: !817, retainedNodes: !851)
!851 = !{!848}
!852 = !DILocation(line: 1852, column: 24, scope: !849, inlinedAt: !853)
!853 = !DILocation(line: 190, column: 22, scope: !838)
!854 = !DILocalVariable(name: "self", arg: 1, scope: !855, file: !482, line: 1856, type: !504)
!855 = distinct !DILexicalBlock(scope: !856, file: !482, line: 1856, column: 5)
!856 = distinct !DISubprogram(name: "debug_upper_hex", linkageName: "_ZN4core3fmt9Formatter15debug_upper_hex17h310cc681ef1aa455E", scope: !505, file: !482, line: 1856, type: !814, scopeLine: 1856, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !141, templateParams: !23, declaration: !824, retainedNodes: !857)
!857 = !{!854}
!858 = !DILocation(line: 1856, column: 24, scope: !855, inlinedAt: !859)
!859 = !DILocation(line: 192, column: 29, scope: !838)
!860 = !DILocation(line: 1853, column: 9, scope: !849, inlinedAt: !853)
!861 = !DILocation(line: 190, column: 20, scope: !838)
!862 = !DILocation(line: 1857, column: 9, scope: !855, inlinedAt: !859)
!863 = !DILocation(line: 192, column: 27, scope: !838)
!864 = !DILocation(line: 191, column: 21, scope: !838)
!865 = !DILocation(line: 195, column: 21, scope: !838)
!866 = !DILocation(line: 193, column: 21, scope: !838)
!867 = !DILocation(line: 190, column: 17, scope: !838)
!868 = !DILocation(line: 197, column: 14, scope: !838)
!869 = distinct !DISubprogram(name: "entries<&u8, core::slice::iter::Iter<u8>>", linkageName: "_ZN4core3fmt8builders9DebugList7entries17h8c863e4be1e68d77E", scope: !871, file: !870, line: 689, type: !880, scopeLine: 689, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !141, templateParams: !884, declaration: !883, retainedNodes: !887)
!870 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/core/src/fmt/builders.rs", directory: "", checksumkind: CSK_MD5, checksum: "e001ddbb6a5d5667cffdfcedcee2dd35")
!871 = !DICompositeType(tag: DW_TAG_structure_type, name: "DebugList", scope: !872, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !873, templateParams: !23, identifier: "304f8004b6f835e9ae1185b5d46bbe1")
!872 = !DINamespace(name: "builders", scope: !146)
!873 = !{!874}
!874 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !871, file: !2, baseType: !875, size: 128, align: 64, flags: DIFlagPrivate)
!875 = !DICompositeType(tag: DW_TAG_structure_type, name: "DebugInner", scope: !872, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !876, templateParams: !23, identifier: "b96d9060c3c904ce5b3034edf6f55d67")
!876 = !{!877, !878, !879}
!877 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !875, file: !2, baseType: !504, size: 64, align: 64, flags: DIFlagPrivate)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !875, file: !2, baseType: !486, size: 8, align: 8, offset: 64, flags: DIFlagPrivate)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "has_fields", scope: !875, file: !2, baseType: !795, size: 8, align: 8, offset: 72, flags: DIFlagPrivate)
!880 = !DISubroutineType(types: !881)
!881 = !{!882, !882, !590}
!882 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::builders::DebugList", baseType: !871, size: 64, align: 64, dwarfAddressSpace: 0)
!883 = !DISubprogram(name: "entries<&u8, core::slice::iter::Iter<u8>>", linkageName: "_ZN4core3fmt8builders9DebugList7entries17h8c863e4be1e68d77E", scope: !871, file: !870, line: 689, type: !880, scopeLine: 689, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !884)
!884 = !{!885, !886}
!885 = !DITemplateTypeParameter(name: "D", type: !32)
!886 = !DITemplateTypeParameter(name: "I", type: !590)
!887 = !{!888, !889, !890, !892}
!888 = !DILocalVariable(name: "self", arg: 1, scope: !869, file: !870, line: 689, type: !882)
!889 = !DILocalVariable(name: "entries", arg: 2, scope: !869, file: !870, line: 689, type: !590)
!890 = !DILocalVariable(name: "iter", scope: !891, file: !870, line: 694, type: !590, align: 8)
!891 = distinct !DILexicalBlock(scope: !869, file: !870, line: 694, column: 9)
!892 = !DILocalVariable(name: "entry", scope: !893, file: !870, line: 694, type: !32, align: 8)
!893 = distinct !DILexicalBlock(scope: !891, file: !870, line: 694, column: 30)
!894 = !DILocation(line: 689, column: 26, scope: !869)
!895 = !DILocation(line: 689, column: 37, scope: !869)
!896 = !DILocation(line: 694, column: 22, scope: !891)
!897 = !DILocation(line: 694, column: 13, scope: !893)
!898 = !DILocation(line: 694, column: 22, scope: !869)
!899 = !DILocation(line: 694, column: 9, scope: !891)
!900 = !DILocation(line: 689, column: 5, scope: !869)
!901 = !DILocation(line: 698, column: 6, scope: !869)
!902 = !DILocation(line: 694, column: 13, scope: !891)
!903 = !DILocation(line: 695, column: 13, scope: !893)
!904 = !DILocation(line: 696, column: 9, scope: !891)
!905 = distinct !DISubprogram(name: "new_v1", linkageName: "_ZN4core3fmt9Arguments6new_v117h7e0d121c061c548dE", scope: !906, file: !482, line: 331, type: !972, scopeLine: 331, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !141, templateParams: !23, declaration: !974, retainedNodes: !975)
!906 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !146, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !907, templateParams: !23, identifier: "fbbe119434458031918720245192cd9b")
!907 = !{!908, !914, !956}
!908 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !906, file: !2, baseType: !909, size: 128, align: 64, flags: DIFlagPrivate)
!909 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !910, templateParams: !23, identifier: "d76b83877ddcb5cca61caf6bdca727ac")
!910 = !{!911, !913}
!911 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !909, file: !2, baseType: !912, size: 64, align: 64)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !231, size: 64, align: 64, dwarfAddressSpace: 0)
!913 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !909, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !906, file: !2, baseType: !915, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!915 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::Placeholder]>", scope: !98, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !916, templateParams: !23, identifier: "3f0763e9dba8dc7649eb55ec793f82b7")
!916 = !{!917}
!917 = !DICompositeType(tag: DW_TAG_variant_part, scope: !915, file: !2, size: 128, align: 64, elements: !918, templateParams: !23, identifier: "65fc387767de928e1cd4d1ee4a329ddc", discriminator: !955)
!918 = !{!919, !951}
!919 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !917, file: !2, baseType: !920, size: 128, align: 64, extraData: i128 0)
!920 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !915, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !23, templateParams: !921, identifier: "b7b727cd1374fd42a671142a9ea5a26f")
!921 = !{!922}
!922 = !DITemplateTypeParameter(name: "T", type: !923)
!923 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Placeholder]", file: !2, size: 128, align: 64, elements: !924, templateParams: !23, identifier: "7ed8a4543f5da3d3ea22eb0d0ae63b5d")
!924 = !{!925, !950}
!925 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !923, file: !2, baseType: !926, size: 64, align: 64)
!926 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !927, size: 64, align: 64, dwarfAddressSpace: 0)
!927 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !145, file: !2, size: 448, align: 64, flags: DIFlagPublic, elements: !928, templateParams: !23, identifier: "db22a31fb8506d38d86008c519a684b4")
!928 = !{!929, !930, !931, !932, !933, !949}
!929 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !927, file: !2, baseType: !9, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!930 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !927, file: !2, baseType: !509, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!931 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !927, file: !2, baseType: !144, size: 8, align: 8, offset: 384, flags: DIFlagPublic)
!932 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !927, file: !2, baseType: !250, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!933 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !927, file: !2, baseType: !934, size: 128, align: 64, flags: DIFlagPublic)
!934 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !145, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !935, templateParams: !23, identifier: "c09bef3d4518c0ba899f0b6885f25658")
!935 = !{!936}
!936 = !DICompositeType(tag: DW_TAG_variant_part, scope: !934, file: !2, size: 128, align: 64, elements: !937, templateParams: !23, identifier: "8b7b65a476a212fe9e7d8598689dca9e", discriminator: !948)
!937 = !{!938, !942, !946}
!938 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !936, file: !2, baseType: !939, size: 128, align: 64, extraData: i128 0)
!939 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !934, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !940, templateParams: !23, identifier: "a9c021e3234f260796f871c043bfb9db")
!940 = !{!941}
!941 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !939, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!942 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !936, file: !2, baseType: !943, size: 128, align: 64, extraData: i128 1)
!943 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !934, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !944, templateParams: !23, identifier: "6a517bdc83de4935d8b683e708a39d7f")
!944 = !{!945}
!945 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !943, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!946 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !936, file: !2, baseType: !947, size: 128, align: 64, extraData: i128 2)
!947 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !934, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !23, identifier: "489690d9cd1f382a93c32ad4b95c006")
!948 = !DIDerivedType(tag: DW_TAG_member, scope: !934, file: !2, baseType: !154, size: 64, align: 64, flags: DIFlagArtificial)
!949 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !927, file: !2, baseType: !934, size: 128, align: 64, offset: 128, flags: DIFlagPublic)
!950 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !923, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!951 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !917, file: !2, baseType: !952, size: 128, align: 64)
!952 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !915, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !953, templateParams: !921, identifier: "4322c5f7abcbd5957cbf53e6b210ebc1")
!953 = !{!954}
!954 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !952, file: !2, baseType: !923, size: 128, align: 64, flags: DIFlagPublic)
!955 = !DIDerivedType(tag: DW_TAG_member, scope: !915, file: !2, baseType: !154, size: 64, align: 64, flags: DIFlagArtificial)
!956 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !906, file: !2, baseType: !957, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!957 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Argument]", file: !2, size: 128, align: 64, elements: !958, templateParams: !23, identifier: "328e4d0db9d439bdb659dbd84a34cd91")
!958 = !{!959, !971}
!959 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !957, file: !2, baseType: !960, size: 64, align: 64)
!960 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !961, size: 64, align: 64, dwarfAddressSpace: 0)
!961 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !145, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !962, templateParams: !23, identifier: "e825b7a6cffad0289192b16912b4da94")
!962 = !{!963, !967}
!963 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !961, file: !2, baseType: !964, size: 64, align: 64, flags: DIFlagPrivate)
!964 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::rt::{extern#0}::Opaque", baseType: !965, size: 64, align: 64, dwarfAddressSpace: 0)
!965 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !966, file: !2, align: 8, elements: !23, identifier: "669514fbed6981fc34939e4aba79e3bc")
!966 = !DINamespace(name: "{extern#0}", scope: !145)
!967 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !961, file: !2, baseType: !968, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!968 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::rt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !969, size: 64, align: 64, dwarfAddressSpace: 0)
!969 = !DISubroutineType(types: !970)
!970 = !{!486, !964, !504}
!971 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !957, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!972 = !DISubroutineType(types: !973)
!973 = !{!906, !909, !957}
!974 = !DISubprogram(name: "new_v1", linkageName: "_ZN4core3fmt9Arguments6new_v117h7e0d121c061c548dE", scope: !906, file: !482, line: 331, type: !972, scopeLine: 331, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !23)
!975 = !{!976, !977}
!976 = !DILocalVariable(name: "pieces", arg: 1, scope: !905, file: !482, line: 331, type: !909)
!977 = !DILocalVariable(name: "args", arg: 2, scope: !905, file: !482, line: 331, type: !957)
!978 = !DILocation(line: 331, column: 19, scope: !905)
!979 = !DILocation(line: 331, column: 47, scope: !905)
!980 = !DILocation(line: 332, column: 12, scope: !905)
!981 = !DILocation(line: 332, column: 56, scope: !905)
!982 = !DILocation(line: 332, column: 41, scope: !905)
!983 = !DILocation(line: 333, column: 20, scope: !905)
!984 = !DILocalVariable(name: "pieces", arg: 1, scope: !985, file: !482, line: 321, type: !909)
!985 = distinct !DILexicalBlock(scope: !986, file: !482, line: 321, column: 5)
