; ModuleID = 'kupnp3r5qljbmgl'
source_filename = "kupnp3r5qljbmgl"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"core::result::Result<usize, std::io::error::Error>" = type { i64, [1 x i64] }
%"core::ops::range::Range<usize>" = type { i64, i64 }
%"core::result::Result<usize, std::io::error::Error>::Ok" = type { [1 x i64], i64 }
%"core::slice::iter::Iter<'_, u8>" = type { ptr, ptr, %"core::marker::PhantomData<&u8>" }
%"core::marker::PhantomData<&u8>" = type {}
%"core::fmt::builders::DebugList<'_, '_>" = type { %"core::fmt::builders::DebugInner<'_, '_>" }
%"core::fmt::builders::DebugInner<'_, '_>" = type { ptr, i8, i8, [6 x i8] }
%"core::fmt::Formatter<'_>" = type { %"core::option::Option<usize>", %"core::option::Option<usize>", { ptr, ptr }, i32, i32, i8, [7 x i8] }
%"core::option::Option<usize>" = type { i64, [1 x i64] }
%"core::fmt::Arguments<'_>" = type { { ptr, i64 }, { ptr, i64 }, %"core::option::Option<&[core::fmt::rt::Placeholder]>" }
%"core::option::Option<&[core::fmt::rt::Placeholder]>" = type { ptr, [1 x i64] }
%"core::result::Result<usize, curl::easy::handler::ReadError>" = type { i8, [15 x i8] }
%"core::result::Result<usize, std::io::error::Error>::Err" = type { [1 x i64], ptr }
%"core::option::Option<(&[u8], &[u8])>" = type { ptr, [3 x i64] }
%"core::ptr::metadata::PtrComponents<[u8]>" = type { ptr, i64 }
%"core::ptr::metadata::PtrRepr<[u8]>" = type { [2 x i64] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !14, templateParams: !23, identifier: "513e30a45f33397931d66b7c27f9468b")
!4 = !{!5, !8, !10, !11, !12, !13}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<()>", scope: !15, file: !2, size: 64, align: 64, elements: !18, templateParams: !23, identifier: "dcada08ba5d8e52fa0502511e6c0738a")
!15 = !DINamespace(name: "lang_start", scope: !16)
!16 = !DINamespace(name: "rt", scope: !17)
!17 = !DINamespace(name: "std", scope: null)
!18 = !{!19}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !14, file: !2, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn()", baseType: !21, size: 64, align: 64, dwarfAddressSpace: 0)
!21 = !DISubroutineType(types: !22)
!22 = !{null}
!23 = !{}
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "<&u8 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !26, isLocal: true, isDefinition: true)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u8 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !27, vtableHolder: !32, templateParams: !23, identifier: "af41e180a396099d2109052d0e58dd2e")
!27 = !{!28, !29, !30, !31}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !26, file: !2, baseType: !6, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !26, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !26, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !26, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u8", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!33 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "<alloc::string::FromUtf8Error as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !36, isLocal: true, isDefinition: true)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "<alloc::string::FromUtf8Error as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !37, vtableHolder: !42, templateParams: !23, identifier: "8d63c2fc96962d43cccb80a771b00b3f")
!37 = !{!38, !39, !40, !41}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !36, file: !2, baseType: !6, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !36, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !36, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !36, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "FromUtf8Error", scope: !43, file: !2, size: 320, align: 64, flags: DIFlagPublic, elements: !45, templateParams: !23, identifier: "441f3e4fc7a88f957196e9444218296f")
!43 = !DINamespace(name: "string", scope: !44)
!44 = !DINamespace(name: "alloc", scope: null)
!45 = !{!46, !81}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !42, file: !2, baseType: !47, size: 192, align: 64, flags: DIFlagPrivate)
!47 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<u8, alloc::alloc::Global>", scope: !48, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !49, templateParams: !78, identifier: "c215d12aad764e1a441c461e729f0d2b")
!48 = !DINamespace(name: "vec", scope: !44)
!49 = !{!50, !80}
!50 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !47, file: !2, baseType: !51, size: 128, align: 64, flags: DIFlagPrivate)
!51 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<u8, alloc::alloc::Global>", scope: !52, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !53, templateParams: !78, identifier: "58281329bdf84bea2e13e330aa112831")
!52 = !DINamespace(name: "raw_vec", scope: !44)
!53 = !{!54, !71, !75}
!54 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !51, file: !2, baseType: !55, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!55 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<u8>", scope: !56, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !59, templateParams: !66, identifier: "6f6899319271bff9ddd9f7c3bd2cc000")
!56 = !DINamespace(name: "unique", scope: !57)
!57 = !DINamespace(name: "ptr", scope: !58)
!58 = !DINamespace(name: "core", scope: null)
!59 = !{!60, !68}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !55, file: !2, baseType: !61, size: 64, align: 64, flags: DIFlagPrivate)
!61 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !62, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !63, templateParams: !66, identifier: "6ea26407579e5a1c3e59aa6ffc6beb11")
!62 = !DINamespace(name: "non_null", scope: !57)
!63 = !{!64}
!64 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !61, file: !2, baseType: !65, size: 64, align: 64, flags: DIFlagPrivate)
!65 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!66 = !{!67}
!67 = !DITemplateTypeParameter(name: "T", type: !33)
!68 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !55, file: !2, baseType: !69, align: 8, offset: 64, flags: DIFlagPrivate)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<u8>", scope: !70, file: !2, align: 8, flags: DIFlagPublic, elements: !23, templateParams: !66, identifier: "ec273fde36c82807fc48cac6ee5e0e75")
!70 = !DINamespace(name: "marker", scope: !58)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !51, file: !2, baseType: !72, size: 64, align: 64, flags: DIFlagPrivate)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cap", scope: !52, file: !2, size: 64, align: 64, flags: DIFlagPrivate, elements: !73, templateParams: !23, identifier: "3fa86bac779c730df09caa2171474e12")
!73 = !{!74}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !72, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !51, file: !2, baseType: !76, align: 8, offset: 128, flags: DIFlagPrivate)
!76 = !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !77, file: !2, align: 8, flags: DIFlagPublic, elements: !23, identifier: "a47ca854cde42ea6e8906fe610d99e63")
!77 = !DINamespace(name: "alloc", scope: !44)
!78 = !{!67, !79}
!79 = !DITemplateTypeParameter(name: "A", type: !76)
!80 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !47, file: !2, baseType: !9, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!81 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !42, file: !2, baseType: !82, size: 128, align: 64, offset: 192, flags: DIFlagPrivate)
!82 = !DICompositeType(tag: DW_TAG_structure_type, name: "Utf8Error", scope: !83, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !85, templateParams: !23, identifier: "8d77e2b19a81231332d6174ccce4ffd0")
!83 = !DINamespace(name: "error", scope: !84)
!84 = !DINamespace(name: "str", scope: !58)
!85 = !{!86, !87}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "valid_up_to", scope: !82, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagProtected)
!87 = !DIDerivedType(tag: DW_TAG_member, name: "error_len", scope: !82, file: !2, baseType: !88, size: 16, align: 8, offset: 64, flags: DIFlagProtected)
!88 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<u8>", scope: !89, file: !2, size: 16, align: 8, flags: DIFlagPublic, elements: !90, templateParams: !23, identifier: "ceb840d6da4220667c5d75bc90bf8a10")
!89 = !DINamespace(name: "option", scope: !58)
!90 = !{!91}
!91 = !DICompositeType(tag: DW_TAG_variant_part, scope: !88, file: !2, size: 16, align: 8, elements: !92, templateParams: !23, identifier: "3734b96857b75e911c9c9d41c5e459ae", discriminator: !99)
!92 = !{!93, !95}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !91, file: !2, baseType: !94, size: 16, align: 8, extraData: i128 0)
!94 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !88, file: !2, size: 16, align: 8, flags: DIFlagPublic, elements: !23, templateParams: !66, identifier: "5887cce5776158c76c8b9ba9dd21db9d")
!95 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !91, file: !2, baseType: !96, size: 16, align: 8, extraData: i128 1)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !88, file: !2, size: 16, align: 8, flags: DIFlagPublic, elements: !97, templateParams: !66, identifier: "e56a710edd6134e6774b32490f7f1de4")
!97 = !{!98}
!98 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !96, file: !2, baseType: !33, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!99 = !DIDerivedType(tag: DW_TAG_member, scope: !88, file: !2, baseType: !33, size: 8, align: 8, flags: DIFlagArtificial)
!100 = !DIGlobalVariableExpression(var: !101, expr: !DIExpression())
!101 = distinct !DIGlobalVariable(name: "<curl::error::Error as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !102, isLocal: true, isDefinition: true)
!102 = !DICompositeType(tag: DW_TAG_structure_type, name: "<curl::error::Error as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !103, vtableHolder: !108, templateParams: !23, identifier: "fa10db4edc4404d72087cb0031b533eb")
!103 = !{!104, !105, !106, !107}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !102, file: !2, baseType: !6, size: 64, align: 64)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !102, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !102, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !102, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!108 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !109, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !111, templateParams: !23, identifier: "9537c44ebe5cc91d7781a51fc43510a6")
!109 = !DINamespace(name: "error", scope: !110)
!110 = !DINamespace(name: "curl", scope: null)
!111 = !{!112, !114}
!112 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !108, file: !2, baseType: !113, size: 32, align: 32, offset: 128, flags: DIFlagPrivate)
!113 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!114 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !108, file: !2, baseType: !115, size: 128, align: 64, flags: DIFlagPrivate)
!115 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<alloc::boxed::Box<str, alloc::alloc::Global>>", scope: !89, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !116, templateParams: !23, identifier: "eb690a675268059a3664d20a3d74efcc")
!116 = !{!117}
!117 = !DICompositeType(tag: DW_TAG_variant_part, scope: !115, file: !2, size: 128, align: 64, elements: !118, templateParams: !23, identifier: "944f7ecad0318e4ab0de47e3f63e86a4", discriminator: !132)
!118 = !{!119, !128}
!119 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !117, file: !2, baseType: !120, size: 128, align: 64, extraData: i128 0)
!120 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !115, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !23, templateParams: !121, identifier: "56672a8aec191491eede2253af4356df")
!121 = !{!122}
!122 = !DITemplateTypeParameter(name: "T", type: !123)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<str, alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !124, templateParams: !23, identifier: "4a7374dee8d3f72c438f800b00095ba6")
!124 = !{!125, !127}
!125 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !123, file: !2, baseType: !126, size: 64, align: 64)
!126 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!127 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !123, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!128 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !117, file: !2, baseType: !129, size: 128, align: 64)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !115, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !130, templateParams: !121, identifier: "699250c9b666ae1b95e32960351a7044")
!130 = !{!131}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !129, file: !2, baseType: !123, size: 128, align: 64, flags: DIFlagPublic)
!132 = !DIDerivedType(tag: DW_TAG_member, scope: !115, file: !2, baseType: !133, size: 64, align: 64, flags: DIFlagArtificial)
!133 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(name: "<function::make_rpc::{closure_env#0} as core::ops::function::FnMut<(&mut [u8])>>::{vtable}", scope: null, file: !2, type: !136, isLocal: true, isDefinition: true)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "<function::make_rpc::{closure_env#0} as core::ops::function::FnMut<(&mut [u8])>>::{vtable_type}", file: !2, size: 320, align: 64, flags: DIFlagArtificial, elements: !137, vtableHolder: !143, templateParams: !23, identifier: "eded1c3d043b1f97282c2189dfe6a204")
!137 = !{!138, !139, !140, !141, !142}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !136, file: !2, baseType: !6, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !136, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !136, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !136, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !136, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !144, file: !2, size: 64, align: 64, elements: !146, templateParams: !23, identifier: "c370244513609a7dda3efad85e4b72c2")
!144 = !DINamespace(name: "make_rpc", scope: !145)
!145 = !DINamespace(name: "function", scope: null)
!146 = !{!147}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input_to_be_sent", scope: !143, file: !2, baseType: !148, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut &[u8]", baseType: !149, size: 64, align: 64, dwarfAddressSpace: 0)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[u8]", file: !2, size: 128, align: 64, elements: !150, templateParams: !23, identifier: "4f7d759e2003ffb713a77bd933fd0146")
!150 = !{!151, !152}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !149, file: !2, baseType: !126, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !149, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "<function::make_rpc::{closure_env#1} as core::ops::function::FnMut<(&[u8])>>::{vtable}", scope: null, file: !2, type: !155, isLocal: true, isDefinition: true)
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "<function::make_rpc::{closure_env#1} as core::ops::function::FnMut<(&[u8])>>::{vtable_type}", file: !2, size: 320, align: 64, flags: DIFlagArtificial, elements: !156, vtableHolder: !162, templateParams: !23, identifier: "d6628e79a9c047795c785b88ac4f96fd")
!156 = !{!157, !158, !159, !160, !161}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !155, file: !2, baseType: !6, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !155, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !155, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !155, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !155, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#1}", scope: !144, file: !2, size: 64, align: 64, elements: !163, templateParams: !23, identifier: "405e33fa1c79095a4ab36db66c92dc30")
!163 = !{!164}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__html_data", scope: !162, file: !2, baseType: !165, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut alloc::string::String", baseType: !166, size: 64, align: 64, dwarfAddressSpace: 0)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "String", scope: !43, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !167, templateParams: !23, identifier: "d327f3abe291f686c850bbe1dfd9d9d0")
!167 = !{!168}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !166, file: !2, baseType: !47, size: 192, align: 64, flags: DIFlagPrivate)
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(name: "<usize as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !171, isLocal: true, isDefinition: true)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "<usize as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !172, vtableHolder: !9, templateParams: !23, identifier: "e02999c5af2463b2093c9e5d3bff6a")
!172 = !{!173, !174, !175, !176}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !171, file: !2, baseType: !6, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !171, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !171, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !171, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "<&core::option::Option<u8> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !179, isLocal: true, isDefinition: true)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&core::option::Option<u8> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !180, vtableHolder: !185, templateParams: !23, identifier: "bfd10f98f42e5b8e1e30c5b5ef4a2695")
!180 = !{!181, !182, !183, !184}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !179, file: !2, baseType: !6, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !179, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !179, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !179, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::option::Option<u8>", baseType: !88, size: 64, align: 64, dwarfAddressSpace: 0)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "<alloc::vec::Vec<u8, alloc::alloc::Global> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !188, isLocal: true, isDefinition: true)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "<alloc::vec::Vec<u8, alloc::alloc::Global> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !189, vtableHolder: !47, templateParams: !23, identifier: "d2a902bce790127638cb4add78c3739b")
!189 = !{!190, !191, !192, !193}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !188, file: !2, baseType: !6, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !188, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !188, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !188, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(name: "<&core::str::error::Utf8Error as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !196, isLocal: true, isDefinition: true)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&core::str::error::Utf8Error as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !197, vtableHolder: !202, templateParams: !23, identifier: "f62d73ba70e8281a6cf1d029120e13d0")
!197 = !{!198, !199, !200, !201}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !196, file: !2, baseType: !6, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !196, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !196, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !196, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::str::error::Utf8Error", baseType: !82, size: 64, align: 64, dwarfAddressSpace: 0)
!203 = !{i32 8, !"PIC Level", i32 2}
!204 = !{i32 7, !"PIE Level", i32 2}
!205 = !{i32 2, !"RtLibUseGOT", i32 1}
!206 = !{i32 2, !"Dwarf Version", i32 4}
!207 = !{i32 2, !"Debug Info Version", i32 3}
!208 = !{!"rustc version 1.77.0 (aedd173a2 2024-03-17)"}
!209 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !210, producer: "clang LLVM (rustc version 1.77.0 (aedd173a2 2024-03-17))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !211, globals: !338, splitDebugInlining: false, nameTableKind: None)
!210 = !DIFile(filename: "src/main.rs/@/kupnp3r5qljbmgl", directory: "/proj/zyuxuanssf-PG0/faas-cpp-test/merge-rust-and-c/test/caller")
!211 = !{!212, !257, !265, !271}
!212 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ErrorKind", scope: !213, file: !2, baseType: !33, size: 8, align: 8, flags: DIFlagEnumClass, elements: !215)
!213 = !DINamespace(name: "error", scope: !214)
!214 = !DINamespace(name: "io", scope: !17)
!215 = !{!216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256}
!216 = !DIEnumerator(name: "NotFound", value: 0, isUnsigned: true)
!217 = !DIEnumerator(name: "PermissionDenied", value: 1, isUnsigned: true)
!218 = !DIEnumerator(name: "ConnectionRefused", value: 2, isUnsigned: true)
!219 = !DIEnumerator(name: "ConnectionReset", value: 3, isUnsigned: true)
!220 = !DIEnumerator(name: "HostUnreachable", value: 4, isUnsigned: true)
!221 = !DIEnumerator(name: "NetworkUnreachable", value: 5, isUnsigned: true)
!222 = !DIEnumerator(name: "ConnectionAborted", value: 6, isUnsigned: true)
!223 = !DIEnumerator(name: "NotConnected", value: 7, isUnsigned: true)
!224 = !DIEnumerator(name: "AddrInUse", value: 8, isUnsigned: true)
!225 = !DIEnumerator(name: "AddrNotAvailable", value: 9, isUnsigned: true)
!226 = !DIEnumerator(name: "NetworkDown", value: 10, isUnsigned: true)
!227 = !DIEnumerator(name: "BrokenPipe", value: 11, isUnsigned: true)
!228 = !DIEnumerator(name: "AlreadyExists", value: 12, isUnsigned: true)
!229 = !DIEnumerator(name: "WouldBlock", value: 13, isUnsigned: true)
!230 = !DIEnumerator(name: "NotADirectory", value: 14, isUnsigned: true)
!231 = !DIEnumerator(name: "IsADirectory", value: 15, isUnsigned: true)
!232 = !DIEnumerator(name: "DirectoryNotEmpty", value: 16, isUnsigned: true)
!233 = !DIEnumerator(name: "ReadOnlyFilesystem", value: 17, isUnsigned: true)
!234 = !DIEnumerator(name: "FilesystemLoop", value: 18, isUnsigned: true)
!235 = !DIEnumerator(name: "StaleNetworkFileHandle", value: 19, isUnsigned: true)
!236 = !DIEnumerator(name: "InvalidInput", value: 20, isUnsigned: true)
!237 = !DIEnumerator(name: "InvalidData", value: 21, isUnsigned: true)
!238 = !DIEnumerator(name: "TimedOut", value: 22, isUnsigned: true)
!239 = !DIEnumerator(name: "WriteZero", value: 23, isUnsigned: true)
!240 = !DIEnumerator(name: "StorageFull", value: 24, isUnsigned: true)
!241 = !DIEnumerator(name: "NotSeekable", value: 25, isUnsigned: true)
!242 = !DIEnumerator(name: "FilesystemQuotaExceeded", value: 26, isUnsigned: true)
!243 = !DIEnumerator(name: "FileTooLarge", value: 27, isUnsigned: true)
!244 = !DIEnumerator(name: "ResourceBusy", value: 28, isUnsigned: true)
!245 = !DIEnumerator(name: "ExecutableFileBusy", value: 29, isUnsigned: true)
!246 = !DIEnumerator(name: "Deadlock", value: 30, isUnsigned: true)
!247 = !DIEnumerator(name: "CrossesDevices", value: 31, isUnsigned: true)
!248 = !DIEnumerator(name: "TooManyLinks", value: 32, isUnsigned: true)
!249 = !DIEnumerator(name: "InvalidFilename", value: 33, isUnsigned: true)
!250 = !DIEnumerator(name: "ArgumentListTooLong", value: 34, isUnsigned: true)
!251 = !DIEnumerator(name: "Interrupted", value: 35, isUnsigned: true)
!252 = !DIEnumerator(name: "Unsupported", value: 36, isUnsigned: true)
!253 = !DIEnumerator(name: "UnexpectedEof", value: 37, isUnsigned: true)
!254 = !DIEnumerator(name: "OutOfMemory", value: 38, isUnsigned: true)
!255 = !DIEnumerator(name: "Other", value: 39, isUnsigned: true)
!256 = !DIEnumerator(name: "Uncategorized", value: 40, isUnsigned: true)
!257 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !258, file: !2, baseType: !33, size: 8, align: 8, flags: DIFlagEnumClass, elements: !260)
!258 = !DINamespace(name: "rt", scope: !259)
!259 = !DINamespace(name: "fmt", scope: !58)
!260 = !{!261, !262, !263, !264}
!261 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!262 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!263 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!264 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!265 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ReadError", scope: !266, file: !2, baseType: !33, size: 8, align: 8, flags: DIFlagEnumClass, elements: !268)
!266 = !DINamespace(name: "handler", scope: !267)
!267 = !DINamespace(name: "easy", scope: !110)
!268 = !{!269, !270}
!269 = !DIEnumerator(name: "Abort", value: 0, isUnsigned: true)
!270 = !DIEnumerator(name: "Pause", value: 1, isUnsigned: true)
!271 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AlignmentEnum64", scope: !272, file: !2, baseType: !133, size: 64, align: 64, flags: DIFlagEnumClass, elements: !273)
!272 = !DINamespace(name: "alignment", scope: !57)
!273 = !{!274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337}
!274 = !DIEnumerator(name: "_Align1Shl0", value: 1, isUnsigned: true)
!275 = !DIEnumerator(name: "_Align1Shl1", value: 2, isUnsigned: true)
!276 = !DIEnumerator(name: "_Align1Shl2", value: 4, isUnsigned: true)
!277 = !DIEnumerator(name: "_Align1Shl3", value: 8, isUnsigned: true)
!278 = !DIEnumerator(name: "_Align1Shl4", value: 16, isUnsigned: true)
!279 = !DIEnumerator(name: "_Align1Shl5", value: 32, isUnsigned: true)
!280 = !DIEnumerator(name: "_Align1Shl6", value: 64, isUnsigned: true)
!281 = !DIEnumerator(name: "_Align1Shl7", value: 128, isUnsigned: true)
!282 = !DIEnumerator(name: "_Align1Shl8", value: 256, isUnsigned: true)
!283 = !DIEnumerator(name: "_Align1Shl9", value: 512, isUnsigned: true)
!284 = !DIEnumerator(name: "_Align1Shl10", value: 1024, isUnsigned: true)
!285 = !DIEnumerator(name: "_Align1Shl11", value: 2048, isUnsigned: true)
!286 = !DIEnumerator(name: "_Align1Shl12", value: 4096, isUnsigned: true)
!287 = !DIEnumerator(name: "_Align1Shl13", value: 8192, isUnsigned: true)
!288 = !DIEnumerator(name: "_Align1Shl14", value: 16384, isUnsigned: true)
!289 = !DIEnumerator(name: "_Align1Shl15", value: 32768, isUnsigned: true)
!290 = !DIEnumerator(name: "_Align1Shl16", value: 65536, isUnsigned: true)
!291 = !DIEnumerator(name: "_Align1Shl17", value: 131072, isUnsigned: true)
!292 = !DIEnumerator(name: "_Align1Shl18", value: 262144, isUnsigned: true)
!293 = !DIEnumerator(name: "_Align1Shl19", value: 524288, isUnsigned: true)
!294 = !DIEnumerator(name: "_Align1Shl20", value: 1048576, isUnsigned: true)
!295 = !DIEnumerator(name: "_Align1Shl21", value: 2097152, isUnsigned: true)
!296 = !DIEnumerator(name: "_Align1Shl22", value: 4194304, isUnsigned: true)
!297 = !DIEnumerator(name: "_Align1Shl23", value: 8388608, isUnsigned: true)
!298 = !DIEnumerator(name: "_Align1Shl24", value: 16777216, isUnsigned: true)
!299 = !DIEnumerator(name: "_Align1Shl25", value: 33554432, isUnsigned: true)
!300 = !DIEnumerator(name: "_Align1Shl26", value: 67108864, isUnsigned: true)
!301 = !DIEnumerator(name: "_Align1Shl27", value: 134217728, isUnsigned: true)
!302 = !DIEnumerator(name: "_Align1Shl28", value: 268435456, isUnsigned: true)
!303 = !DIEnumerator(name: "_Align1Shl29", value: 536870912, isUnsigned: true)
!304 = !DIEnumerator(name: "_Align1Shl30", value: 1073741824, isUnsigned: true)
!305 = !DIEnumerator(name: "_Align1Shl31", value: 2147483648, isUnsigned: true)
!306 = !DIEnumerator(name: "_Align1Shl32", value: 4294967296, isUnsigned: true)
!307 = !DIEnumerator(name: "_Align1Shl33", value: 8589934592, isUnsigned: true)
!308 = !DIEnumerator(name: "_Align1Shl34", value: 17179869184, isUnsigned: true)
!309 = !DIEnumerator(name: "_Align1Shl35", value: 34359738368, isUnsigned: true)
!310 = !DIEnumerator(name: "_Align1Shl36", value: 68719476736, isUnsigned: true)
!311 = !DIEnumerator(name: "_Align1Shl37", value: 137438953472, isUnsigned: true)
!312 = !DIEnumerator(name: "_Align1Shl38", value: 274877906944, isUnsigned: true)
!313 = !DIEnumerator(name: "_Align1Shl39", value: 549755813888, isUnsigned: true)
!314 = !DIEnumerator(name: "_Align1Shl40", value: 1099511627776, isUnsigned: true)
!315 = !DIEnumerator(name: "_Align1Shl41", value: 2199023255552, isUnsigned: true)
!316 = !DIEnumerator(name: "_Align1Shl42", value: 4398046511104, isUnsigned: true)
!317 = !DIEnumerator(name: "_Align1Shl43", value: 8796093022208, isUnsigned: true)
!318 = !DIEnumerator(name: "_Align1Shl44", value: 17592186044416, isUnsigned: true)
!319 = !DIEnumerator(name: "_Align1Shl45", value: 35184372088832, isUnsigned: true)
!320 = !DIEnumerator(name: "_Align1Shl46", value: 70368744177664, isUnsigned: true)
!321 = !DIEnumerator(name: "_Align1Shl47", value: 140737488355328, isUnsigned: true)
!322 = !DIEnumerator(name: "_Align1Shl48", value: 281474976710656, isUnsigned: true)
!323 = !DIEnumerator(name: "_Align1Shl49", value: 562949953421312, isUnsigned: true)
!324 = !DIEnumerator(name: "_Align1Shl50", value: 1125899906842624, isUnsigned: true)
!325 = !DIEnumerator(name: "_Align1Shl51", value: 2251799813685248, isUnsigned: true)
!326 = !DIEnumerator(name: "_Align1Shl52", value: 4503599627370496, isUnsigned: true)
!327 = !DIEnumerator(name: "_Align1Shl53", value: 9007199254740992, isUnsigned: true)
!328 = !DIEnumerator(name: "_Align1Shl54", value: 18014398509481984, isUnsigned: true)
!329 = !DIEnumerator(name: "_Align1Shl55", value: 36028797018963968, isUnsigned: true)
!330 = !DIEnumerator(name: "_Align1Shl56", value: 72057594037927936, isUnsigned: true)
!331 = !DIEnumerator(name: "_Align1Shl57", value: 144115188075855872, isUnsigned: true)
!332 = !DIEnumerator(name: "_Align1Shl58", value: 288230376151711744, isUnsigned: true)
!333 = !DIEnumerator(name: "_Align1Shl59", value: 576460752303423488, isUnsigned: true)
!334 = !DIEnumerator(name: "_Align1Shl60", value: 1152921504606846976, isUnsigned: true)
!335 = !DIEnumerator(name: "_Align1Shl61", value: 2305843009213693952, isUnsigned: true)
!336 = !DIEnumerator(name: "_Align1Shl62", value: 4611686018427387904, isUnsigned: true)
!337 = !DIEnumerator(name: "_Align1Shl63", value: 9223372036854775808, isUnsigned: true)
!338 = !{!0, !24, !34, !100, !134, !153, !169, !177, !186, !194}
!339 = distinct !DISubprogram(name: "__rust_begin_short_backtrace<fn(), ()>", linkageName: "_ZN3std10sys_common9backtrace28__rust_begin_short_backtrace17hc2abbc2b7062a82dE", scope: !341, file: !340, line: 151, type: !343, scopeLine: 151, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !349, retainedNodes: !345)
!340 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/std/src/sys_common/backtrace.rs", directory: "", checksumkind: CSK_MD5, checksum: "ea95829b2a6298387d0233825edf7299")
!341 = !DINamespace(name: "backtrace", scope: !342)
!342 = !DINamespace(name: "sys_common", scope: !17)
!343 = !DISubroutineType(types: !344)
!344 = !{null, !20}
!345 = !{!346, !347}
!346 = !DILocalVariable(name: "f", arg: 1, scope: !339, file: !340, line: 151, type: !20)
!347 = !DILocalVariable(name: "result", scope: !348, file: !340, line: 155, type: !7, align: 1)
!348 = distinct !DILexicalBlock(scope: !339, file: !340, line: 155, column: 5)
!349 = !{!350, !351}
!350 = !DITemplateTypeParameter(name: "F", type: !20)
!351 = !DITemplateTypeParameter(name: "T", type: !7)
!352 = !DILocalVariable(name: "dummy", scope: !353, file: !354, line: 333, type: !7, align: 1)
!353 = distinct !DILexicalBlock(scope: !355, file: !354, line: 333, column: 1)
!354 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/core/src/hint.rs", directory: "", checksumkind: CSK_MD5, checksum: "9e658e1509a108e11f079d44cec9a3fb")
!355 = distinct !DISubprogram(name: "black_box<()>", linkageName: "_ZN4core4hint9black_box17he414463bf35298d6E", scope: !356, file: !354, line: 333, type: !357, scopeLine: 333, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !360, retainedNodes: !359)
!356 = !DINamespace(name: "hint", scope: !58)
!357 = !DISubroutineType(types: !358)
!358 = !{null, !7}
!359 = !{!352}
!360 = !{!351}
!361 = !DILocation(line: 333, column: 27, scope: !353, inlinedAt: !362)
!362 = !DILocation(line: 158, column: 5, scope: !348)
!363 = !DILocation(line: 155, column: 9, scope: !348)
!364 = !DILocation(line: 151, column: 43, scope: !339)
!365 = !DILocation(line: 155, column: 18, scope: !339)
!366 = !DILocation(line: 334, column: 5, scope: !353, inlinedAt: !362)
!367 = !{i32 3567009}
!368 = !DILocation(line: 161, column: 2, scope: !339)
!369 = distinct !DISubprogram(name: "read", linkageName: "_ZN3std2io5impls60_$LT$impl$u20$std..io..Read$u20$for$u20$$RF$$u5b$u8$u5d$$GT$4read17hdd5bf2c56daa084cE", scope: !371, file: !370, line: 235, type: !373, scopeLine: 235, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !23, retainedNodes: !458)
!370 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/std/src/io/impls.rs", directory: "", checksumkind: CSK_MD5, checksum: "cb8e41ca169b730ae10e5295fb88ad10")
!371 = !DINamespace(name: "{impl#8}", scope: !372)
!372 = !DINamespace(name: "impls", scope: !214)
!373 = !DISubroutineType(types: !374)
!374 = !{!375, !148, !454}
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<usize, std::io::error::Error>", scope: !376, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !377, templateParams: !23, identifier: "7913a9eccfc71fb9e531b3c842fd71a3")
!376 = !DINamespace(name: "result", scope: !58)
!377 = !{!378}
!378 = !DICompositeType(tag: DW_TAG_variant_part, scope: !375, file: !2, size: 128, align: 64, elements: !379, templateParams: !23, identifier: "6bbd21fc48e683769b057997eee1d541", discriminator: !453)
!379 = !{!380, !449}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !378, file: !2, baseType: !381, size: 128, align: 64, extraData: i128 0)
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !375, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !382, templateParams: !384, identifier: "e577b46a202d27fba06372453d627faa")
!382 = !{!383}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !381, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!384 = !{!385, !386}
!385 = !DITemplateTypeParameter(name: "T", type: !9)
!386 = !DITemplateTypeParameter(name: "E", type: !387)
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !213, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !388, templateParams: !23, identifier: "6f22f4fb3f892f77f346a79d05516aa7")
!388 = !{!389}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !387, file: !2, baseType: !390, size: 64, align: 64, flags: DIFlagPrivate)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "Repr", scope: !391, file: !2, size: 64, align: 64, flags: DIFlagProtected, elements: !392, templateParams: !23, identifier: "1059627c34666a2c9a678932a62a647d")
!391 = !DINamespace(name: "repr_bitpacked", scope: !213)
!392 = !{!393, !397}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !390, file: !2, baseType: !394, size: 64, align: 64, flags: DIFlagPrivate)
!394 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<()>", scope: !62, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !395, templateParams: !360, identifier: "a4fd68cbaa4969a7b2157a0b510d722e")
!395 = !{!396}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !394, file: !2, baseType: !6, size: 64, align: 64, flags: DIFlagPrivate)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !390, file: !2, baseType: !398, align: 8, offset: 64, flags: DIFlagPrivate)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<std::io::error::ErrorData<alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>>>", scope: !70, file: !2, align: 8, flags: DIFlagPublic, elements: !23, templateParams: !399, identifier: "eede02a3cd6c54b443eeb00661ca671")
!399 = !{!400}
!400 = !DITemplateTypeParameter(name: "T", type: !401)
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "ErrorData<alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>>", scope: !213, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !402, templateParams: !23, identifier: "6d363f79bb7bdea333125269af0f327e")
!402 = !{!403}
!403 = !DICompositeType(tag: DW_TAG_variant_part, scope: !401, file: !2, size: 128, align: 64, elements: !404, templateParams: !23, identifier: "85c6568cbb7e755d7fa525ba6e2f7ab6", discriminator: !448)
!404 = !{!405, !427, !431, !444}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "Os", scope: !403, file: !2, baseType: !406, size: 128, align: 64, extraData: i128 0)
!406 = !DICompositeType(tag: DW_TAG_structure_type, name: "Os", scope: !401, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !407, templateParams: !410, identifier: "9d4884fbf7f85a065e8b57c153881a74")
!407 = !{!408}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !406, file: !2, baseType: !409, size: 32, align: 32, offset: 32, flags: DIFlagPrivate)
!409 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!410 = !{!411}
!411 = !DITemplateTypeParameter(name: "C", type: !412)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>", baseType: !413, size: 64, align: 64, dwarfAddressSpace: 0)
!413 = !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !213, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !414, templateParams: !23, identifier: "3af011b24ed66d4ec38927471ab5dc31")
!414 = !{!415, !416}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !413, file: !2, baseType: !212, size: 8, align: 8, offset: 128, flags: DIFlagPrivate)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !413, file: !2, baseType: !417, size: 128, align: 64, flags: DIFlagPrivate)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<(dyn core::error::Error + core::marker::Send + core::marker::Sync), alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !418, templateParams: !23, identifier: "f877ea4f2f11c48438249ede7554f486")
!418 = !{!419, !422}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !417, file: !2, baseType: !420, size: 64, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64, align: 64, dwarfAddressSpace: 0)
!421 = !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn core::error::Error + core::marker::Send + core::marker::Sync)", file: !2, align: 8, elements: !23, identifier: "675cfc9cb0e8afe5e680a4b6ce6f2e83")
!422 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !417, file: !2, baseType: !423, size: 64, align: 64, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !424, size: 64, align: 64, dwarfAddressSpace: 0)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !425)
!425 = !{!426}
!426 = !DISubrange(count: 3, lowerBound: 0)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "Simple", scope: !403, file: !2, baseType: !428, size: 128, align: 64, extraData: i128 1)
!428 = !DICompositeType(tag: DW_TAG_structure_type, name: "Simple", scope: !401, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !429, templateParams: !410, identifier: "b3997e3f1dcfcf34adc2ed68b34597a2")
!429 = !{!430}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !428, file: !2, baseType: !212, size: 8, align: 8, offset: 8, flags: DIFlagPrivate)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "SimpleMessage", scope: !403, file: !2, baseType: !432, size: 128, align: 64, extraData: i128 2)
!432 = !DICompositeType(tag: DW_TAG_structure_type, name: "SimpleMessage", scope: !401, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !433, templateParams: !410, identifier: "e9cc399b5e53da7691ff1b52ea7cd1e0")
!433 = !{!434}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !432, file: !2, baseType: !435, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::io::error::SimpleMessage", baseType: !436, size: 64, align: 64, dwarfAddressSpace: 0)
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "SimpleMessage", scope: !213, file: !2, size: 192, align: 64, flags: DIFlagProtected, elements: !437, templateParams: !23, identifier: "5ff54c3b9a61fbe229eabfc231d2e970")
!437 = !{!438, !439}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !436, file: !2, baseType: !212, size: 8, align: 8, offset: 128, flags: DIFlagPrivate)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !436, file: !2, baseType: !440, size: 128, align: 64, flags: DIFlagPrivate)
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !441, templateParams: !23, identifier: "857c99401054bcaa39f98e6e0c6d74b")
!441 = !{!442, !443}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !440, file: !2, baseType: !126, size: 64, align: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !440, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "Custom", scope: !403, file: !2, baseType: !445, size: 128, align: 64, extraData: i128 3)
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !401, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !446, templateParams: !410, identifier: "10fdb7411a19f1ded04994e9017e9b14")
!446 = !{!447}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !445, file: !2, baseType: !412, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!448 = !DIDerivedType(tag: DW_TAG_member, scope: !401, file: !2, baseType: !33, size: 8, align: 8, flags: DIFlagArtificial)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !378, file: !2, baseType: !450, size: 128, align: 64, extraData: i128 1)
!450 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !375, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !451, templateParams: !384, identifier: "c785b77ff3032f168aa0a9c100d3da7")
!451 = !{!452}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !450, file: !2, baseType: !387, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!453 = !DIDerivedType(tag: DW_TAG_member, scope: !375, file: !2, baseType: !133, size: 64, align: 64, flags: DIFlagArtificial)
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut [u8]", file: !2, size: 128, align: 64, elements: !455, templateParams: !23, identifier: "5acbf15c847666982b641ea58cf98317")
!455 = !{!456, !457}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !454, file: !2, baseType: !126, size: 64, align: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !454, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!458 = !{!459, !460, !461, !463, !465}
!459 = !DILocalVariable(name: "self", arg: 1, scope: !369, file: !370, line: 235, type: !148)
!460 = !DILocalVariable(name: "buf", arg: 2, scope: !369, file: !370, line: 235, type: !454)
!461 = !DILocalVariable(name: "amt", scope: !462, file: !370, line: 236, type: !9, align: 8)
!462 = distinct !DILexicalBlock(scope: !369, file: !370, line: 236, column: 9)
!463 = !DILocalVariable(name: "a", scope: !464, file: !370, line: 237, type: !149, align: 8)
!464 = distinct !DILexicalBlock(scope: !462, file: !370, line: 237, column: 9)
!465 = !DILocalVariable(name: "b", scope: !464, file: !370, line: 237, type: !149, align: 8)
!466 = !DILocation(line: 235, column: 13, scope: !369)
!467 = !DILocation(line: 235, column: 24, scope: !369)
!468 = !DILocalVariable(name: "self", arg: 1, scope: !469, file: !470, line: 28, type: !454)
!469 = distinct !DILexicalBlock(scope: !471, file: !470, line: 28, column: 5)
!470 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/core/src/slice/index.rs", directory: "", checksumkind: CSK_MD5, checksum: "19489bf30accd8a2a6434f8cef0f6067")
!471 = distinct !DISubprogram(name: "index_mut<u8, core::ops::range::RangeTo<usize>>", linkageName: "_ZN4core5slice5index77_$LT$impl$u20$core..ops..index..IndexMut$LT$I$GT$$u20$for$u20$$u5b$T$u5d$$GT$9index_mut17haea8d44ee010c96aE", scope: !472, file: !470, line: 28, type: !475, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !494, retainedNodes: !492)
!472 = !DINamespace(name: "{impl#1}", scope: !473)
!473 = !DINamespace(name: "index", scope: !474)
!474 = !DINamespace(name: "slice", scope: !58)
!475 = !DISubroutineType(types: !476)
!476 = !{!454, !454, !477, !484}
!477 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeTo<usize>", scope: !478, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !480, templateParams: !482, identifier: "abd020715dc013ff67397eb381f99b54")
!478 = !DINamespace(name: "range", scope: !479)
!479 = !DINamespace(name: "ops", scope: !58)
!480 = !{!481}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !477, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPublic)
!482 = !{!483}
!483 = !DITemplateTypeParameter(name: "Idx", type: !9)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !485, size: 64, align: 64, dwarfAddressSpace: 0)
!485 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !486, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !488, templateParams: !23, identifier: "65eb7befd79c72afef1a37a712324bd")
!486 = !DINamespace(name: "location", scope: !487)
!487 = !DINamespace(name: "panic", scope: !58)
!488 = !{!489, !490, !491}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !485, file: !2, baseType: !440, size: 128, align: 64, flags: DIFlagPrivate)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !485, file: !2, baseType: !113, size: 32, align: 32, offset: 128, flags: DIFlagPrivate)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !485, file: !2, baseType: !113, size: 32, align: 32, offset: 160, flags: DIFlagPrivate)
!492 = !{!468, !493}
!493 = !DILocalVariable(name: "index", scope: !469, file: !470, line: 28, type: !477, align: 8)
!494 = !{!67, !495}
!495 = !DITemplateTypeParameter(name: "I", type: !477)
!496 = !DILocation(line: 28, column: 18, scope: !469, inlinedAt: !497)
!497 = !DILocation(line: 245, column: 16, scope: !464)
!498 = !DILocalVariable(name: "slice", arg: 2, scope: !499, file: !470, line: 445, type: !454)
!499 = distinct !DILexicalBlock(scope: !500, file: !470, line: 445, column: 5)
!500 = distinct !DISubprogram(name: "index_mut<u8>", linkageName: "_ZN108_$LT$core..ops..range..RangeTo$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$9index_mut17h798cf01b79b28582E", scope: !501, file: !470, line: 445, type: !502, scopeLine: 445, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !66, retainedNodes: !504)
!501 = !DINamespace(name: "{impl#5}", scope: !473)
!502 = !DISubroutineType(types: !503)
!503 = !{!454, !477, !454, !484}
!504 = !{!505, !498}
!505 = !DILocalVariable(name: "self", scope: !499, file: !470, line: 445, type: !477, align: 8)
!506 = !DILocation(line: 445, column: 24, scope: !499, inlinedAt: !507)
!507 = !DILocation(line: 29, column: 15, scope: !469, inlinedAt: !497)
!508 = !DILocation(line: 236, column: 28, scope: !369)
!509 = !DILocalVariable(name: "v1", arg: 1, scope: !510, file: !511, line: 1209, type: !9)
!510 = distinct !DILexicalBlock(scope: !512, file: !511, line: 1209, column: 1)
!511 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/core/src/cmp.rs", directory: "", checksumkind: CSK_MD5, checksum: "06958a2b60d77a2c5bde8ef9c3a774cb")
!512 = distinct !DISubprogram(name: "min<usize>", linkageName: "_ZN4core3cmp3min17h99af9c08c516a73eE", scope: !513, file: !511, line: 1209, type: !514, scopeLine: 1209, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !518, retainedNodes: !516)
!513 = !DINamespace(name: "cmp", scope: !58)
!514 = !DISubroutineType(types: !515)
!515 = !{!9, !9, !9}
!516 = !{!509, !517}
!517 = !DILocalVariable(name: "v2", arg: 2, scope: !510, file: !511, line: 1209, type: !9)
!518 = !{!385}
!519 = !DILocation(line: 1209, column: 20, scope: !510, inlinedAt: !520)
!520 = !DILocation(line: 236, column: 19, scope: !369)
!521 = !DILocalVariable(name: "self", arg: 1, scope: !522, file: !511, line: 850, type: !9)
!522 = distinct !DILexicalBlock(scope: !523, file: !511, line: 850, column: 5)
!523 = distinct !DISubprogram(name: "min<usize>", linkageName: "_ZN4core3cmp3Ord3min17h8a79ad27e533a446E", scope: !524, file: !511, line: 850, type: !514, scopeLine: 850, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !527, retainedNodes: !525)
!524 = !DINamespace(name: "Ord", scope: !513)
!525 = !{!521, !526}
!526 = !DILocalVariable(name: "other", arg: 2, scope: !522, file: !511, line: 850, type: !9)
!527 = !{!528}
!528 = !DITemplateTypeParameter(name: "Self", type: !9)
!529 = !DILocation(line: 850, column: 12, scope: !522, inlinedAt: !530)
!530 = !DILocation(line: 1210, column: 8, scope: !510, inlinedAt: !520)
!531 = !DILocation(line: 236, column: 39, scope: !369)
!532 = !{i64 1}
!533 = !DILocation(line: 1209, column: 27, scope: !510, inlinedAt: !520)
!534 = !DILocation(line: 850, column: 18, scope: !522, inlinedAt: !530)
!535 = !DILocation(line: 854, column: 9, scope: !522, inlinedAt: !530)
!536 = !DILocation(line: 236, column: 13, scope: !462)
!537 = !DILocation(line: 28, column: 29, scope: !469, inlinedAt: !497)
!538 = !DILocation(line: 445, column: 18, scope: !499, inlinedAt: !507)
!539 = !DILocation(line: 237, column: 22, scope: !462)
!540 = !DILocation(line: 237, column: 14, scope: !462)
!541 = !DILocation(line: 237, column: 14, scope: !464)
!542 = !DILocation(line: 237, column: 17, scope: !462)
!543 = !DILocation(line: 237, column: 17, scope: !464)
!544 = !DILocation(line: 242, column: 12, scope: !464)
!545 = !DILocation(line: 243, column: 22, scope: !464)
!546 = !DILocation(line: 446, column: 9, scope: !499, inlinedAt: !507)
!547 = !DILocation(line: 245, column: 13, scope: !464)
!548 = !DILocation(line: 243, column: 13, scope: !464)
!549 = !DILocation(line: 242, column: 9, scope: !464)
!550 = !DILocation(line: 248, column: 9, scope: !464)
!551 = !DILocation(line: 249, column: 9, scope: !464)
!552 = !DILocation(line: 250, column: 6, scope: !369)
!553 = distinct !DISubprogram(name: "lang_start<()>", linkageName: "_ZN3std2rt10lang_start17h9dbee000ca5548a0E", scope: !16, file: !554, line: 159, type: !555, scopeLine: 159, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !360, retainedNodes: !559)
!554 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/std/src/rt.rs", directory: "", checksumkind: CSK_MD5, checksum: "37ab242d99ebf1886f0e7617537b82aa")
!555 = !DISubroutineType(types: !556)
!556 = !{!557, !20, !557, !558, !33}
!557 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!558 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const *const u8", baseType: !65, size: 64, align: 64, dwarfAddressSpace: 0)
!559 = !{!560, !561, !562, !563, !564}
!560 = !DILocalVariable(name: "main", arg: 1, scope: !553, file: !554, line: 160, type: !20)
!561 = !DILocalVariable(name: "argc", arg: 2, scope: !553, file: !554, line: 161, type: !557)
!562 = !DILocalVariable(name: "argv", arg: 3, scope: !553, file: !554, line: 162, type: !558)
!563 = !DILocalVariable(name: "sigpipe", arg: 4, scope: !553, file: !554, line: 163, type: !33)
!564 = !DILocalVariable(name: "v", scope: !565, file: !554, line: 165, type: !557, align: 8)
!565 = distinct !DILexicalBlock(scope: !553, file: !554, line: 165, column: 5)
!566 = !DILocation(line: 160, column: 5, scope: !553)
!567 = !DILocation(line: 161, column: 5, scope: !553)
!568 = !DILocation(line: 162, column: 5, scope: !553)
!569 = !DILocation(line: 163, column: 5, scope: !553)
!570 = !DILocation(line: 166, column: 10, scope: !553)
!571 = !DILocation(line: 165, column: 17, scope: !553)
!572 = !DILocation(line: 165, column: 12, scope: !553)
!573 = !DILocation(line: 165, column: 12, scope: !565)
!574 = !DILocation(line: 172, column: 2, scope: !553)
!575 = distinct !DISubprogram(name: "{closure#0}<()>", linkageName: "_ZN3std2rt10lang_start28_$u7b$$u7b$closure$u7d$$u7d$17hb1acdfcf9cab6dd5E", scope: !15, file: !554, line: 166, type: !576, scopeLine: 166, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !360, retainedNodes: !579)
!576 = !DISubroutineType(types: !577)
!577 = !{!409, !578}
!578 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::rt::lang_start::{closure_env#0}<()>", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!579 = !{!580}
!580 = !DILocalVariable(name: "main", scope: !575, file: !554, line: 160, type: !20, align: 8)
!581 = !DILocation(line: 160, column: 5, scope: !575)
!582 = !DILocalVariable(name: "self", arg: 1, scope: !583, file: !584, line: 1958, type: !586)
!583 = distinct !DILexicalBlock(scope: !585, file: !584, line: 1958, column: 5)
!584 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/std/src/process.rs", directory: "", checksumkind: CSK_MD5, checksum: "4237b9da5f67550242d4bb113252837f")
!585 = distinct !DISubprogram(name: "to_i32", linkageName: "_ZN3std7process8ExitCode6to_i3217h2b48a7ed08faa7fcE", scope: !586, file: !584, line: 1958, type: !598, scopeLine: 1958, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !23, declaration: !600, retainedNodes: !601)
!586 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExitCode", scope: !587, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !588, templateParams: !23, identifier: "5961cb4d4e35861215b96c335823791a")
!587 = !DINamespace(name: "process", scope: !17)
!588 = !{!589}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !586, file: !2, baseType: !590, size: 8, align: 8, flags: DIFlagPrivate)
!590 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExitCode", scope: !591, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !596, templateParams: !23, identifier: "7702fb636587915d7be9289af947b189")
!591 = !DINamespace(name: "process_common", scope: !592)
!592 = !DINamespace(name: "process", scope: !593)
!593 = !DINamespace(name: "unix", scope: !594)
!594 = !DINamespace(name: "pal", scope: !595)
!595 = !DINamespace(name: "sys", scope: !17)
!596 = !{!597}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !590, file: !2, baseType: !33, size: 8, align: 8, flags: DIFlagPrivate)
!598 = !DISubroutineType(types: !599)
!599 = !{!409, !586}
!600 = !DISubprogram(name: "to_i32", linkageName: "_ZN3std7process8ExitCode6to_i3217h2b48a7ed08faa7fcE", scope: !586, file: !584, line: 1958, type: !598, scopeLine: 1958, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !23)
!601 = !{!582}
!602 = !DILocation(line: 1958, column: 19, scope: !583, inlinedAt: !603)
!603 = !DILocation(line: 166, column: 92, scope: !575)
!604 = !DILocation(line: 166, column: 77, scope: !575)
!605 = !DILocation(line: 166, column: 18, scope: !575)
!606 = !DILocation(line: 1959, column: 9, scope: !583, inlinedAt: !603)
!607 = !DILocalVariable(name: "self", arg: 1, scope: !608, file: !609, line: 638, type: !613)
!608 = distinct !DILexicalBlock(scope: !610, file: !609, line: 638, column: 5)
!609 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/std/src/sys/pal/unix/process/process_common.rs", directory: "", checksumkind: CSK_MD5, checksum: "f12d6cc5fbe6e47291b02b1d467e8da3")
!610 = distinct !DISubprogram(name: "as_i32", linkageName: "_ZN3std3sys3pal4unix7process14process_common8ExitCode6as_i3217h6510ca4fa7e938b8E", scope: !590, file: !609, line: 638, type: !611, scopeLine: 638, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !23, declaration: !614, retainedNodes: !615)
!611 = !DISubroutineType(types: !612)
!612 = !{!409, !613}
!613 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::sys::pal::unix::process::process_common::ExitCode", baseType: !590, size: 64, align: 64, dwarfAddressSpace: 0)
!614 = !DISubprogram(name: "as_i32", linkageName: "_ZN3std3sys3pal4unix7process14process_common8ExitCode6as_i3217h6510ca4fa7e938b8E", scope: !590, file: !609, line: 638, type: !611, scopeLine: 638, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !23)
!615 = !{!607}
!616 = !DILocation(line: 638, column: 19, scope: !608, inlinedAt: !617)
!617 = !DILocation(line: 1959, column: 16, scope: !583, inlinedAt: !603)
!618 = !DILocation(line: 639, column: 9, scope: !608, inlinedAt: !617)
!619 = !DILocation(line: 166, column: 100, scope: !575)
!620 = distinct !DISubprogram(name: "fmt<core::str::error::Utf8Error>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17h9febf898cc93d89aE", scope: !622, file: !621, line: 2294, type: !623, scopeLine: 2294, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !672, retainedNodes: !669)
!621 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "f2f9e528240e472a11f8ea13e1ff6e2a")
!622 = !DINamespace(name: "{impl#51}", scope: !259)
!623 = !DISubroutineType(types: !624)
!624 = !{!625, !641, !642}
!625 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !376, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !626, templateParams: !23, identifier: "ef21c1a4a7a3bb675edf359fd7da20c2")
!626 = !{!627}
!627 = !DICompositeType(tag: DW_TAG_variant_part, scope: !625, file: !2, size: 8, align: 8, elements: !628, templateParams: !23, identifier: "1e6064d2fa7899348d4637058c3df544", discriminator: !640)
!628 = !{!629, !636}
!629 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !627, file: !2, baseType: !630, size: 8, align: 8, extraData: i128 0)
!630 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !625, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !631, templateParams: !633, identifier: "4676f9084c1926904df27c02f470a258")
!631 = !{!632}
!632 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !630, file: !2, baseType: !7, align: 8, offset: 8, flags: DIFlagPublic)
!633 = !{!351, !634}
!634 = !DITemplateTypeParameter(name: "E", type: !635)
!635 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !259, file: !2, align: 8, flags: DIFlagPublic, elements: !23, identifier: "525f7c35922c78aaf2831aa7e2d5fd8b")
!636 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !627, file: !2, baseType: !637, size: 8, align: 8, extraData: i128 1)
!637 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !625, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !638, templateParams: !633, identifier: "4fc1bf8c8c918aa838a2a0aa40186b71")
!638 = !{!639}
!639 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !637, file: !2, baseType: !635, align: 8, offset: 8, flags: DIFlagPublic)
!640 = !DIDerivedType(tag: DW_TAG_member, scope: !625, file: !2, baseType: !33, size: 8, align: 8, flags: DIFlagArtificial)
!641 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&core::str::error::Utf8Error", baseType: !202, size: 64, align: 64, dwarfAddressSpace: 0)
!642 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !643, size: 64, align: 64, dwarfAddressSpace: 0)
!643 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !259, file: !2, size: 512, align: 64, flags: DIFlagPublic, elements: !644, templateParams: !23, identifier: "c2a81c20b281ad088a53ffd69742e2f1")
!644 = !{!645, !646, !648, !649, !661, !662}
!645 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !643, file: !2, baseType: !113, size: 32, align: 32, offset: 416, flags: DIFlagPrivate)
!646 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !643, file: !2, baseType: !647, size: 32, align: 32, offset: 384, flags: DIFlagPrivate)
!647 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !643, file: !2, baseType: !257, size: 8, align: 8, offset: 448, flags: DIFlagPrivate)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !643, file: !2, baseType: !650, size: 128, align: 64, flags: DIFlagPrivate)
!650 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !89, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !651, templateParams: !23, identifier: "f4d83d61e370ffa2bf86fb2b476c03b9")
!651 = !{!652}
!652 = !DICompositeType(tag: DW_TAG_variant_part, scope: !650, file: !2, size: 128, align: 64, elements: !653, templateParams: !23, identifier: "2e6a6158b8523df5f27116dc0cb3efb2", discriminator: !660)
!653 = !{!654, !656}
!654 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !652, file: !2, baseType: !655, size: 128, align: 64, extraData: i128 0)
!655 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !650, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !23, templateParams: !518, identifier: "bad25d21ed86c6e99411c76de143d53a")
!656 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !652, file: !2, baseType: !657, size: 128, align: 64, extraData: i128 1)
!657 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !650, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !658, templateParams: !518, identifier: "825bd40f4b16f9f7d54c405cc2904cf6")
!658 = !{!659}
!659 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !657, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!660 = !DIDerivedType(tag: DW_TAG_member, scope: !650, file: !2, baseType: !133, size: 64, align: 64, flags: DIFlagArtificial)
!661 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !643, file: !2, baseType: !650, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!662 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !643, file: !2, baseType: !663, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!663 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !664, templateParams: !23, identifier: "d242d9e3b9076fd347f00d776e8d4173")
!664 = !{!665, !668}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !663, file: !2, baseType: !666, size: 64, align: 64)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !667, size: 64, align: 64, dwarfAddressSpace: 0)
!667 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !23, identifier: "6f41b2858562f876d2b2674263e48852")
!668 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !663, file: !2, baseType: !423, size: 64, align: 64, offset: 64)
!669 = !{!670, !671}
!670 = !DILocalVariable(name: "self", arg: 1, scope: !620, file: !621, line: 2294, type: !641)
!671 = !DILocalVariable(name: "f", arg: 2, scope: !620, file: !621, line: 2294, type: !642)
!672 = !{!673}
!673 = !DITemplateTypeParameter(name: "T", type: !82)
!674 = !DILocation(line: 2294, column: 20, scope: !620)
!675 = !DILocation(line: 2294, column: 27, scope: !620)
!676 = !DILocation(line: 2294, column: 71, scope: !620)
!677 = !{i64 8}
!678 = !DILocation(line: 2294, column: 62, scope: !620)
!679 = !DILocation(line: 2294, column: 84, scope: !620)
!680 = distinct !DISubprogram(name: "fmt<u8>", linkageName: "_ZN48_$LT$$u5b$T$u5d$$u20$as$u20$core..fmt..Debug$GT$3fmt17h56cf23593e15b208E", scope: !681, file: !621, line: 2521, type: !682, scopeLine: 2521, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !66, retainedNodes: !684)
!681 = !DINamespace(name: "{impl#24}", scope: !259)
!682 = !DISubroutineType(types: !683)
!683 = !{!625, !149, !642}
!684 = !{!685, !686}
!685 = !DILocalVariable(name: "self", arg: 1, scope: !680, file: !621, line: 2521, type: !149)
!686 = !DILocalVariable(name: "f", arg: 2, scope: !680, file: !621, line: 2521, type: !642)
!687 = !DILocation(line: 2521, column: 12, scope: !680)
!688 = !DILocalVariable(name: "self", arg: 1, scope: !689, file: !690, line: 1020, type: !149)
!689 = distinct !DILexicalBlock(scope: !691, file: !690, line: 1020, column: 5)
!690 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/core/src/slice/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "71bbaa1f5376cf26aa2adb7892a250f9")
!691 = distinct !DISubprogram(name: "iter<u8>", linkageName: "_ZN4core5slice29_$LT$impl$u20$$u5b$T$u5d$$GT$4iter17hfc3bb40111151350E", scope: !692, file: !690, line: 1020, type: !693, scopeLine: 1020, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !66, retainedNodes: !704)
!692 = !DINamespace(name: "{impl#0}", scope: !474)
!693 = !DISubroutineType(types: !694)
!694 = !{!695, !149}
!695 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<u8>", scope: !696, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !697, templateParams: !66, identifier: "dfe909ef45f7c501e4f9392f0a7ddd5f")
!696 = !DINamespace(name: "iter", scope: !474)
!697 = !{!698, !699, !700}
!698 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !695, file: !2, baseType: !61, size: 64, align: 64, flags: DIFlagPrivate)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "end_or_len", scope: !695, file: !2, baseType: !65, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !695, file: !2, baseType: !701, align: 8, offset: 128, flags: DIFlagPrivate)
!701 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&u8>", scope: !70, file: !2, align: 8, flags: DIFlagPublic, elements: !23, templateParams: !702, identifier: "98cf3c61d71667f2be4899dafc6fc74")
!702 = !{!703}
!703 = !DITemplateTypeParameter(name: "T", type: !32)
!704 = !{!688}
!705 = !DILocation(line: 1020, column: 17, scope: !689, inlinedAt: !706)
!706 = !DILocation(line: 2522, column: 37, scope: !680)
!707 = !DILocalVariable(name: "slice", arg: 1, scope: !708, file: !709, line: 89, type: !149)
!708 = distinct !DILexicalBlock(scope: !710, file: !709, line: 89, column: 5)
!709 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/core/src/slice/iter.rs", directory: "", checksumkind: CSK_MD5, checksum: "5ed64ef65fe7e9ccc245af8ae7fa541d")
!710 = distinct !DISubprogram(name: "new<u8>", linkageName: "_ZN4core5slice4iter13Iter$LT$T$GT$3new17h22c0677f6cdba88cE", scope: !695, file: !709, line: 89, type: !693, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !66, declaration: !711, retainedNodes: !712)
!711 = !DISubprogram(name: "new<u8>", linkageName: "_ZN4core5slice4iter13Iter$LT$T$GT$3new17h22c0677f6cdba88cE", scope: !695, file: !709, line: 89, type: !693, scopeLine: 89, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !66)
!712 = !{!707, !713, !715}
!713 = !DILocalVariable(name: "ptr", scope: !714, file: !709, line: 90, type: !65, align: 8)
!714 = distinct !DILexicalBlock(scope: !708, file: !709, line: 90, column: 9)
!715 = !DILocalVariable(name: "end_or_len", scope: !716, file: !709, line: 93, type: !65, align: 8)
!716 = distinct !DILexicalBlock(scope: !714, file: !709, line: 93, column: 13)
!717 = !DILocation(line: 89, column: 23, scope: !708, inlinedAt: !718)
!718 = !DILocation(line: 1021, column: 9, scope: !689, inlinedAt: !706)
!719 = !DILocalVariable(name: "self", arg: 1, scope: !720, file: !690, line: 753, type: !149)
!720 = distinct !DILexicalBlock(scope: !721, file: !690, line: 753, column: 5)
!721 = distinct !DISubprogram(name: "as_ptr<u8>", linkageName: "_ZN4core5slice29_$LT$impl$u20$$u5b$T$u5d$$GT$6as_ptr17h18d3b1af5070f29aE", scope: !692, file: !690, line: 753, type: !722, scopeLine: 753, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !66, retainedNodes: !724)
!722 = !DISubroutineType(types: !723)
!723 = !{!65, !149}
!724 = !{!719}
!725 = !DILocation(line: 753, column: 25, scope: !720, inlinedAt: !726)
!726 = !DILocation(line: 90, column: 25, scope: !708, inlinedAt: !718)
!727 = !DILocation(line: 2521, column: 19, scope: !680)
!728 = !DILocation(line: 93, column: 17, scope: !716, inlinedAt: !718)
!729 = !DILocation(line: 2522, column: 9, scope: !680)
!730 = !DILocation(line: 754, column: 9, scope: !720, inlinedAt: !726)
!731 = !DILocation(line: 90, column: 13, scope: !714, inlinedAt: !718)
!732 = !DILocalVariable(name: "self", arg: 1, scope: !733, file: !734, line: 939, type: !65)
!733 = distinct !DILexicalBlock(scope: !735, file: !734, line: 939, column: 5)
!734 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/core/src/ptr/const_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "09014d329840bfd2d530919196ac4f25")
!735 = distinct !DISubprogram(name: "add<u8>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$3add17h76d96752073964baE", scope: !736, file: !734, line: 939, type: !738, scopeLine: 939, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !66, retainedNodes: !740)
!736 = !DINamespace(name: "{impl#0}", scope: !737)
!737 = !DINamespace(name: "const_ptr", scope: !57)
!738 = !DISubroutineType(types: !739)
!739 = !{!65, !65, !9}
!740 = !{!732, !741}
!741 = !DILocalVariable(name: "count", arg: 2, scope: !733, file: !734, line: 939, type: !9)
!742 = !DILocation(line: 939, column: 29, scope: !733, inlinedAt: !743)
!743 = !DILocation(line: 93, column: 79, scope: !714, inlinedAt: !718)
!744 = !DILocation(line: 93, column: 33, scope: !714, inlinedAt: !718)
!745 = !DILocation(line: 93, column: 83, scope: !714, inlinedAt: !718)
!746 = !DILocation(line: 939, column: 35, scope: !733, inlinedAt: !743)
!747 = !DILocation(line: 944, column: 18, scope: !733, inlinedAt: !743)
!748 = !DILocation(line: 93, column: 30, scope: !714, inlinedAt: !718)
!749 = !DILocation(line: 93, column: 53, scope: !714, inlinedAt: !718)
!750 = !DILocalVariable(name: "addr", arg: 1, scope: !751, file: !752, line: 589, type: !9)
!751 = distinct !DILexicalBlock(scope: !753, file: !752, line: 589, column: 1)
!752 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "f7e71cc5fe46b5d7ce750e8b099ff7ff")
!753 = distinct !DISubprogram(name: "invalid<u8>", linkageName: "_ZN4core3ptr7invalid17hc8fe650c79a9614cE", scope: !57, file: !752, line: 589, type: !754, scopeLine: 589, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !66, retainedNodes: !756)
!754 = !DISubroutineType(types: !755)
!755 = !{!65, !9}
!756 = !{!750}
!757 = !DILocation(line: 589, column: 25, scope: !751, inlinedAt: !758)
!758 = !DILocation(line: 93, column: 45, scope: !714, inlinedAt: !718)
!759 = !DILocation(line: 595, column: 14, scope: !751, inlinedAt: !758)
!760 = !DILocation(line: 95, column: 48, scope: !716, inlinedAt: !718)
!761 = !DILocalVariable(name: "ptr", arg: 1, scope: !762, file: !763, line: 218, type: !767)
!762 = distinct !DILexicalBlock(scope: !764, file: !763, line: 218, column: 5)
!763 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/core/src/ptr/non_null.rs", directory: "", checksumkind: CSK_MD5, checksum: "d232b4a1150e9e47bf554073bdb98e48")
!764 = distinct !DISubprogram(name: "new_unchecked<u8>", linkageName: "_ZN4core3ptr8non_null16NonNull$LT$T$GT$13new_unchecked17h1d87ae3cb70d111cE", scope: !61, file: !763, line: 218, type: !765, scopeLine: 218, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !66, declaration: !768, retainedNodes: !769)
!765 = !DISubroutineType(types: !766)
!766 = !{!61, !767}
!767 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!768 = !DISubprogram(name: "new_unchecked<u8>", linkageName: "_ZN4core3ptr8non_null16NonNull$LT$T$GT$13new_unchecked17h1d87ae3cb70d111cE", scope: !61, file: !763, line: 218, type: !765, scopeLine: 218, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !66)
!769 = !{!761}
!770 = !DILocation(line: 218, column: 39, scope: !762, inlinedAt: !771)
!771 = !DILocation(line: 95, column: 25, scope: !716, inlinedAt: !718)
!772 = !DILocation(line: 222, column: 13, scope: !762, inlinedAt: !771)
!773 = !DILocation(line: 95, column: 64, scope: !716, inlinedAt: !718)
!774 = !DILocation(line: 95, column: 13, scope: !716, inlinedAt: !718)
!775 = !DILocation(line: 2523, column: 6, scope: !680)
!776 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN4core3fmt3num52_$LT$impl$u20$core..fmt..Debug$u20$for$u20$usize$GT$3fmt17h73ab642b6bf45271E", scope: !778, file: !777, line: 189, type: !780, scopeLine: 189, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !23, retainedNodes: !783)
!777 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/core/src/fmt/num.rs", directory: "", checksumkind: CSK_MD5, checksum: "e54845ef989d12b8a79056a0477bb701")
!778 = !DINamespace(name: "{impl#89}", scope: !779)
!779 = !DINamespace(name: "num", scope: !259)
!780 = !DISubroutineType(types: !781)
!781 = !{!625, !782, !642}
!782 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!783 = !{!784, !785}
!784 = !DILocalVariable(name: "self", arg: 1, scope: !776, file: !777, line: 189, type: !782)
!785 = !DILocalVariable(name: "f", arg: 2, scope: !776, file: !777, line: 189, type: !642)
!786 = !DILocation(line: 189, column: 20, scope: !776)
!787 = !DILocation(line: 189, column: 27, scope: !776)
!788 = !DILocalVariable(name: "self", arg: 1, scope: !789, file: !621, line: 1852, type: !642)
!789 = distinct !DILexicalBlock(scope: !790, file: !621, line: 1852, column: 5)
!790 = distinct !DISubprogram(name: "debug_lower_hex", linkageName: "_ZN4core3fmt9Formatter15debug_lower_hex17h3054a9b2ae5e6dcdE", scope: !643, file: !621, line: 1852, type: !791, scopeLine: 1852, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !23, declaration: !795, retainedNodes: !796)
!791 = !DISubroutineType(types: !792)
!792 = !{!793, !794}
!793 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!794 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::Formatter", baseType: !643, size: 64, align: 64, dwarfAddressSpace: 0)
!795 = !DISubprogram(name: "debug_lower_hex", linkageName: "_ZN4core3fmt9Formatter15debug_lower_hex17h3054a9b2ae5e6dcdE", scope: !643, file: !621, line: 1852, type: !791, scopeLine: 1852, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !23)
!796 = !{!788}
!797 = !DILocation(line: 1852, column: 24, scope: !789, inlinedAt: !798)
!798 = !DILocation(line: 190, column: 22, scope: !776)
!799 = !DILocalVariable(name: "self", arg: 1, scope: !800, file: !621, line: 1856, type: !642)
!800 = distinct !DILexicalBlock(scope: !801, file: !621, line: 1856, column: 5)
!801 = distinct !DISubprogram(name: "debug_upper_hex", linkageName: "_ZN4core3fmt9Formatter15debug_upper_hex17h6782199f91966039E", scope: !643, file: !621, line: 1856, type: !791, scopeLine: 1856, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !23, declaration: !802, retainedNodes: !803)
!802 = !DISubprogram(name: "debug_upper_hex", linkageName: "_ZN4core3fmt9Formatter15debug_upper_hex17h6782199f91966039E", scope: !643, file: !621, line: 1856, type: !791, scopeLine: 1856, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !23)
!803 = !{!799}
!804 = !DILocation(line: 1856, column: 24, scope: !800, inlinedAt: !805)
!805 = !DILocation(line: 192, column: 29, scope: !776)
!806 = !DILocation(line: 1853, column: 9, scope: !789, inlinedAt: !798)
!807 = !DILocation(line: 190, column: 20, scope: !776)
!808 = !DILocation(line: 1857, column: 9, scope: !800, inlinedAt: !805)
!809 = !DILocation(line: 192, column: 27, scope: !776)
!810 = !DILocation(line: 191, column: 21, scope: !776)
!811 = !DILocation(line: 195, column: 21, scope: !776)
!812 = !DILocation(line: 193, column: 21, scope: !776)
!813 = !DILocation(line: 190, column: 17, scope: !776)
!814 = !DILocation(line: 197, column: 14, scope: !776)
!815 = !{i8 0, i8 2}
!816 = distinct !DISubprogram(name: "entries<&u8, core::slice::iter::Iter<u8>>", linkageName: "_ZN4core3fmt8builders9DebugList7entries17h20be575e96fb94e0E", scope: !818, file: !817, line: 689, type: !827, scopeLine: 689, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !831, declaration: !830, retainedNodes: !834)
!817 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/core/src/fmt/builders.rs", directory: "", checksumkind: CSK_MD5, checksum: "e001ddbb6a5d5667cffdfcedcee2dd35")
!818 = !DICompositeType(tag: DW_TAG_structure_type, name: "DebugList", scope: !819, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !820, templateParams: !23, identifier: "304f8004b6f835e9ae1185b5d46bbe1")
!819 = !DINamespace(name: "builders", scope: !259)
!820 = !{!821}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !818, file: !2, baseType: !822, size: 128, align: 64, flags: DIFlagPrivate)
!822 = !DICompositeType(tag: DW_TAG_structure_type, name: "DebugInner", scope: !819, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !823, templateParams: !23, identifier: "b96d9060c3c904ce5b3034edf6f55d67")
!823 = !{!824, !825, !826}
!824 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !822, file: !2, baseType: !642, size: 64, align: 64, flags: DIFlagPrivate)
!825 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !822, file: !2, baseType: !625, size: 8, align: 8, offset: 64, flags: DIFlagPrivate)
!826 = !DIDerivedType(tag: DW_TAG_member, name: "has_fields", scope: !822, file: !2, baseType: !793, size: 8, align: 8, offset: 72, flags: DIFlagPrivate)
!827 = !DISubroutineType(types: !828)
!828 = !{!829, !829, !695}
!829 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::builders::DebugList", baseType: !818, size: 64, align: 64, dwarfAddressSpace: 0)
!830 = !DISubprogram(name: "entries<&u8, core::slice::iter::Iter<u8>>", linkageName: "_ZN4core3fmt8builders9DebugList7entries17h20be575e96fb94e0E", scope: !818, file: !817, line: 689, type: !827, scopeLine: 689, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !831)
!831 = !{!832, !833}
!832 = !DITemplateTypeParameter(name: "D", type: !32)
!833 = !DITemplateTypeParameter(name: "I", type: !695)
!834 = !{!835, !836, !837, !839}
!835 = !DILocalVariable(name: "self", arg: 1, scope: !816, file: !817, line: 689, type: !829)
!836 = !DILocalVariable(name: "entries", arg: 2, scope: !816, file: !817, line: 689, type: !695)
!837 = !DILocalVariable(name: "iter", scope: !838, file: !817, line: 694, type: !695, align: 8)
!838 = distinct !DILexicalBlock(scope: !816, file: !817, line: 694, column: 9)
!839 = !DILocalVariable(name: "entry", scope: !840, file: !817, line: 694, type: !32, align: 8)
!840 = distinct !DILexicalBlock(scope: !838, file: !817, line: 694, column: 30)
!841 = !DILocation(line: 689, column: 26, scope: !816)
!842 = !DILocation(line: 689, column: 37, scope: !816)
!843 = !DILocation(line: 694, column: 22, scope: !838)
!844 = !DILocation(line: 694, column: 13, scope: !840)
!845 = !DILocation(line: 694, column: 22, scope: !816)
!846 = !DILocation(line: 694, column: 9, scope: !838)
!847 = !DILocation(line: 689, column: 5, scope: !816)
!848 = !DILocation(line: 698, column: 6, scope: !816)
!849 = !DILocation(line: 694, column: 13, scope: !838)
!850 = !DILocation(line: 695, column: 13, scope: !840)
!851 = !DILocation(line: 696, column: 9, scope: !838)
!852 = distinct !DISubprogram(name: "new_v1", linkageName: "_ZN4core3fmt9Arguments6new_v117h2bd42c43f6f82d3fE", scope: !853, file: !621, line: 331, type: !919, scopeLine: 331, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !23, declaration: !921, retainedNodes: !922)
!853 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !259, file: !2, size: 384, align: 64, flags: DIFlagPublic, elements: !854, templateParams: !23, identifier: "fbbe119434458031918720245192cd9b")
!854 = !{!855, !861, !903}
!855 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !853, file: !2, baseType: !856, size: 128, align: 64, flags: DIFlagPrivate)
!856 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !2, size: 128, align: 64, elements: !857, templateParams: !23, identifier: "d76b83877ddcb5cca61caf6bdca727ac")
!857 = !{!858, !860}
!858 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !856, file: !2, baseType: !859, size: 64, align: 64)
!859 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !440, size: 64, align: 64, dwarfAddressSpace: 0)
!860 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !856, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!861 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !853, file: !2, baseType: !862, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!862 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::Placeholder]>", scope: !89, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !863, templateParams: !23, identifier: "3f0763e9dba8dc7649eb55ec793f82b7")
!863 = !{!864}
!864 = !DICompositeType(tag: DW_TAG_variant_part, scope: !862, file: !2, size: 128, align: 64, elements: !865, templateParams: !23, identifier: "65fc387767de928e1cd4d1ee4a329ddc", discriminator: !902)
!865 = !{!866, !898}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !864, file: !2, baseType: !867, size: 128, align: 64, extraData: i128 0)
!867 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !862, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !23, templateParams: !868, identifier: "b7b727cd1374fd42a671142a9ea5a26f")
!868 = !{!869}
!869 = !DITemplateTypeParameter(name: "T", type: !870)
!870 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Placeholder]", file: !2, size: 128, align: 64, elements: !871, templateParams: !23, identifier: "7ed8a4543f5da3d3ea22eb0d0ae63b5d")
!871 = !{!872, !897}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !870, file: !2, baseType: !873, size: 64, align: 64)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64, align: 64, dwarfAddressSpace: 0)
!874 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !258, file: !2, size: 448, align: 64, flags: DIFlagPublic, elements: !875, templateParams: !23, identifier: "db22a31fb8506d38d86008c519a684b4")
!875 = !{!876, !877, !878, !879, !880, !896}
!876 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !874, file: !2, baseType: !9, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!877 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !874, file: !2, baseType: !647, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!878 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !874, file: !2, baseType: !257, size: 8, align: 8, offset: 384, flags: DIFlagPublic)
!879 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !874, file: !2, baseType: !113, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !874, file: !2, baseType: !881, size: 128, align: 64, flags: DIFlagPublic)
!881 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !258, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !882, templateParams: !23, identifier: "c09bef3d4518c0ba899f0b6885f25658")
!882 = !{!883}
!883 = !DICompositeType(tag: DW_TAG_variant_part, scope: !881, file: !2, size: 128, align: 64, elements: !884, templateParams: !23, identifier: "8b7b65a476a212fe9e7d8598689dca9e", discriminator: !895)
!884 = !{!885, !889, !893}
!885 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !883, file: !2, baseType: !886, size: 128, align: 64, extraData: i128 0)
!886 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !881, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !887, templateParams: !23, identifier: "a9c021e3234f260796f871c043bfb9db")
!887 = !{!888}
!888 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !886, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!889 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !883, file: !2, baseType: !890, size: 128, align: 64, extraData: i128 1)
!890 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !881, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !891, templateParams: !23, identifier: "6a517bdc83de4935d8b683e708a39d7f")
!891 = !{!892}
!892 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !890, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!893 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !883, file: !2, baseType: !894, size: 128, align: 64, extraData: i128 2)
!894 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !881, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !23, identifier: "489690d9cd1f382a93c32ad4b95c006")
!895 = !DIDerivedType(tag: DW_TAG_member, scope: !881, file: !2, baseType: !133, size: 64, align: 64, flags: DIFlagArtificial)
!896 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !874, file: !2, baseType: !881, size: 128, align: 64, offset: 128, flags: DIFlagPublic)
!897 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !870, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!898 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !864, file: !2, baseType: !899, size: 128, align: 64)
!899 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !862, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !900, templateParams: !868, identifier: "4322c5f7abcbd5957cbf53e6b210ebc1")
!900 = !{!901}
!901 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !899, file: !2, baseType: !870, size: 128, align: 64, flags: DIFlagPublic)
!902 = !DIDerivedType(tag: DW_TAG_member, scope: !862, file: !2, baseType: !133, size: 64, align: 64, flags: DIFlagArtificial)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !853, file: !2, baseType: !904, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!904 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Argument]", file: !2, size: 128, align: 64, elements: !905, templateParams: !23, identifier: "328e4d0db9d439bdb659dbd84a34cd91")
!905 = !{!906, !918}
!906 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !904, file: !2, baseType: !907, size: 64, align: 64)
!907 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !908, size: 64, align: 64, dwarfAddressSpace: 0)
!908 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !258, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !909, templateParams: !23, identifier: "e825b7a6cffad0289192b16912b4da94")
!909 = !{!910, !914}
!910 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !908, file: !2, baseType: !911, size: 64, align: 64, flags: DIFlagPrivate)
!911 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::rt::{extern#0}::Opaque", baseType: !912, size: 64, align: 64, dwarfAddressSpace: 0)
!912 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !913, file: !2, align: 8, elements: !23, identifier: "669514fbed6981fc34939e4aba79e3bc")
!913 = !DINamespace(name: "{extern#0}", scope: !258)
!914 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !908, file: !2, baseType: !915, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!915 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::rt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !916, size: 64, align: 64, dwarfAddressSpace: 0)
!916 = !DISubroutineType(types: !917)
!917 = !{!625, !911, !642}
!918 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !904, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!919 = !DISubroutineType(types: !920)
!920 = !{!853, !856, !904}
!921 = !DISubprogram(name: "new_v1", linkageName: "_ZN4core3fmt9Arguments6new_v117h2bd42c43f6f82d3fE", scope: !853, file: !621, line: 331, type: !919, scopeLine: 331, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !23)
!922 = !{!923, !924}
!923 = !DILocalVariable(name: "pieces", arg: 1, scope: !852, file: !621, line: 331, type: !856)
!924 = !DILocalVariable(name: "args", arg: 2, scope: !852, file: !621, line: 331, type: !904)
!925 = !DILocation(line: 331, column: 19, scope: !852)
!926 = !DILocation(line: 331, column: 47, scope: !852)
!927 = !DILocation(line: 332, column: 12, scope: !852)
!928 = !DILocation(line: 332, column: 56, scope: !852)
!929 = !DILocation(line: 332, column: 41, scope: !852)
!930 = !DILocation(line: 333, column: 20, scope: !852)
!931 = !DILocalVariable(name: "pieces", arg: 1, scope: !932, file: !621, line: 321, type: !856)
!932 = distinct !DILexicalBlock(scope: !933, file: !621, line: 321, column: 5)
!933 = distinct !DISubprogram(name: "new_const", linkageName: "_ZN4core3fmt9Arguments9new_const17h8fdbc97b8318abf2E", scope: !853, file: !621, line: 321, type: !934, scopeLine: 321, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !23, declaration: !936, retainedNodes: !937)
!934 = !DISubroutineType(types: !935)
!935 = !{!853, !856}
!936 = !DISubprogram(name: "new_const", linkageName: "_ZN4core3fmt9Arguments9new_const17h8fdbc97b8318abf2E", scope: !853, file: !621, line: 321, type: !934, scopeLine: 321, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !23)
!937 = !{!931}
!938 = !DILocation(line: 321, column: 28, scope: !932, inlinedAt: !939)
!939 = !DILocation(line: 106, column: 38, scope: !940)
!940 = !DILexicalBlockFile(scope: !852, file: !941, discriminator: 0)
!941 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/core/src/panic.rs", directory: "", checksumkind: CSK_MD5, checksum: "20344942d88925c2c0cb1f59161dfcc4")
!942 = !DILocation(line: 322, column: 12, scope: !932, inlinedAt: !939)
!943 = !DILocation(line: 335, column: 9, scope: !852)
!944 = !DILocation(line: 336, column: 6, scope: !852)
!945 = !DILocation(line: 325, column: 9, scope: !932, inlinedAt: !939)
!946 = !DILocation(line: 333, column: 13, scope: !852)
!947 = !DILocation(line: 323, column: 13, scope: !932, inlinedAt: !939)
!948 = distinct !DISubprogram(name: "new_const", linkageName: "_ZN4core3fmt9Arguments9new_const17h8fdbc97b8318abf2E", scope: !853, file: !621, line: 321, type: !934, scopeLine: 321, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !23, declaration: !936, retainedNodes: !949)
!949 = !{!950}
!950 = !DILocalVariable(name: "pieces", arg: 1, scope: !948, file: !621, line: 321, type: !856)
!951 = !DILocation(line: 321, column: 28, scope: !948)
!952 = !DILocation(line: 322, column: 12, scope: !948)
!953 = !DILocation(line: 325, column: 9, scope: !948)
!954 = !DILocation(line: 326, column: 6, scope: !948)
!955 = !DILocation(line: 323, column: 13, scope: !948)
!956 = distinct !DISubprogram(name: "call_once<std::rt::lang_start::{closure_env#0}<()>, ()>", linkageName: "_ZN4core3ops8function6FnOnce40call_once$u7b$$u7b$vtable.shim$u7d$$u7d$17h008bafb720fa27e0E", scope: !958, file: !957, line: 250, type: !960, scopeLine: 250, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !966, retainedNodes: !963)
!957 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/core/src/ops/function.rs", directory: "", checksumkind: CSK_MD5, checksum: "abc772494ea8033dad5cae2e40e54b10")
!958 = !DINamespace(name: "FnOnce", scope: !959)
!959 = !DINamespace(name: "function", scope: !479)
!960 = !DISubroutineType(types: !961)
!961 = !{!409, !962}
!962 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut std::rt::lang_start::{closure_env#0}<()>", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!963 = !{!964, !965}
!964 = !DILocalVariable(arg: 1, scope: !956, file: !957, line: 250, type: !962)
!965 = !DILocalVariable(arg: 2, scope: !956, file: !957, line: 250, type: !7)
!966 = !{!967, !968}
!967 = !DITemplateTypeParameter(name: "Self", type: !14)
!968 = !DITemplateTypeParameter(name: "Args", type: !7)
!969 = !DILocation(line: 250, column: 5, scope: !956)
