; ModuleID = 'openssl_sys.e209a78505a89f1b-cgu.0'
source_filename = "openssl_sys.e209a78505a89f1b-cgu.0"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"core::fmt::Arguments<'_>" = type { { ptr, i64 }, { ptr, i64 }, %"core::option::Option<&[core::fmt::rt::Placeholder]>" }
%"core::option::Option<&[core::fmt::rt::Placeholder]>" = type { ptr, [1 x i64] }
%"core::fmt::rt::Argument<'_>" = type { ptr, ptr }
%"core::result::Result<u32, u32>" = type { i32, [1 x i32] }
%"std::sys_common::once::futex::OnceState" = type { i32, i8, [3 x i8] }
%"std::sync::once::OnceState" = type { %"std::sys_common::once::futex::OnceState" }
%"std::sys_common::once::futex::CompletionGuard<'_>" = type { ptr, i32, [1 x i32] }
%"{closure@/users/zyuxuan/.cargo/registry/src/index.crates.io-6f17d22bba15001f/openssl-sys-0.9.101/src/lib.rs:205:24: 205:26}" = type {}
%"core::ptr::metadata::PtrComponents<core::ffi::c_void>" = type { ptr, {} }
%"core::ptr::metadata::PtrRepr<core::ffi::c_void>" = type { [1 x i64] }
%"core::ptr::metadata::PtrComponents<*mut i8>" = type { ptr, {} }
%"core::ptr::metadata::PtrRepr<*mut i8>" = type { [1 x i64] }
%"core::ptr::metadata::PtrComponents<openssl::handwritten::types::OPENSSL_INIT_SETTINGS>" = type { ptr, {} }
%"core::ptr::metadata::PtrRepr<openssl::handwritten::types::OPENSSL_INIT_SETTINGS>" = type { [1 x i64] }


!46 = !DIEnumerator(name: "AcqRel", value: 3, isUnsigned: true)
!47 = !DIEnumerator(name: "SeqCst", value: 4, isUnsigned: true)
!48 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !49, file: !6, baseType: !41, size: 8, align: 8, flags: DIFlagEnumClass, elements: !51)
!49 = !DINamespace(name: "rt", scope: !50)
!50 = !DINamespace(name: "fmt", scope: !21)
!51 = !{!52, !53, !54, !55}
!52 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!53 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!54 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!55 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!56 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "c_void", scope: !57, file: !6, baseType: !41, size: 8, align: 8, flags: DIFlagEnumClass, elements: !58)
!57 = !DINamespace(name: "ffi", scope: !21)
!58 = !{!59, !60}
!59 = !DIEnumerator(name: "__variant1", value: 0, isUnsigned: true)
!60 = !DIEnumerator(name: "__variant2", value: 1, isUnsigned: true)
!61 = !{!0}
!62 = distinct !DISubprogram(name: "call<std::sync::once::{impl#2}::call_once::{closure_env#0}<openssl_sys::openssl::init::{closure_env#0}>>", linkageName: "_ZN3std10sys_common4once5futex4Once4call17h37aaf74e5f3dff11E", scope: !12, file: !63, line: 97, type: !64, scopeLine: 97, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !37, templateParams: !110, declaration: !109, retainedNodes: !112)
!63 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/std/src/sys_common/once/futex.rs", directory: "", checksumkind: CSK_MD5, checksum: "52b845e5ab67af06120954feca307828")
!64 = !DISubroutineType(types: !65)
!65 = !{null, !66, !67, !68, !95}
!66 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::sys_common::once::futex::Once", baseType: !12, size: 64, align: 64, dwarfAddressSpace: 0)
!67 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!68 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut std::sync::once::{impl#2}::call_once::{closure_env#0}<openssl_sys::openssl::init::{closure_env#0}>", baseType: !69, size: 64, align: 64, dwarfAddressSpace: 0)
!69 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<openssl_sys::openssl::init::{closure_env#0}>", scope: !70, file: !6, size: 64, align: 64, elements: !72, templateParams: !31, identifier: "257a0ea373a6d3b55cee49a07c19c6b5")
!70 = !DINamespace(name: "call_once", scope: !71)
!71 = !DINamespace(name: "{impl#2}", scope: !7)
!72 = !{!73}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__f", scope: !69, file: !6, baseType: !74, size: 64, align: 64)
!74 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::option::Option<openssl_sys::openssl::init::{closure_env#0}>", baseType: !75, size: 64, align: 64, dwarfAddressSpace: 0)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<openssl_sys::openssl::init::{closure_env#0}>", scope: !76, file: !6, size: 64, align: 64, flags: DIFlagPublic, elements: !77, templateParams: !31, identifier: "453a59e6d825cd5e17a957b24fb21f75")
!76 = !DINamespace(name: "option", scope: !21)
!77 = !{!78}
!78 = !DICompositeType(tag: DW_TAG_variant_part, scope: !75, file: !6, size: 64, align: 64, elements: !79, templateParams: !31, identifier: "f152533ed4a536828af2c655d098f4c2", discriminator: !94)
!79 = !{!80, !90}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !78, file: !6, baseType: !81, size: 64, align: 64, extraData: i128 0)
!81 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !75, file: !6, size: 64, align: 64, flags: DIFlagPublic, elements: !31, templateParams: !82, identifier: "c205222d446c31f3aae5c2a33fc3be85")
!82 = !{!83}
!83 = !DITemplateTypeParameter(name: "T", type: !84)
!84 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !85, file: !6, size: 64, align: 64, elements: !86, templateParams: !31, identifier: "77bbdfe7412d8d25cc62764fcbfa4c76")
!85 = !DINamespace(name: "init", scope: !2)
!86 = !{!87}
!87 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__init_options", scope: !84, file: !6, baseType: !88, size: 64, align: 64)
!88 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u64", baseType: !89, size: 64, align: 64, dwarfAddressSpace: 0)
!89 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!90 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !78, file: !6, baseType: !91, size: 64, align: 64)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !75, file: !6, size: 64, align: 64, flags: DIFlagPublic, elements: !92, templateParams: !82, identifier: "dc9265c11df4d683f26e7ca5421764be")
!92 = !{!93}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !91, file: !6, baseType: !84, size: 64, align: 64, flags: DIFlagPublic)
!94 = !DIDerivedType(tag: DW_TAG_member, scope: !75, file: !6, baseType: !89, size: 64, align: 64, flags: DIFlagArtificial)
!95 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !96, size: 64, align: 64, dwarfAddressSpace: 0)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !97, file: !6, size: 192, align: 64, flags: DIFlagPublic, elements: !99, templateParams: !31, identifier: "65eb7befd79c72afef1a37a712324bd")
!97 = !DINamespace(name: "location", scope: !98)
!98 = !DINamespace(name: "panic", scope: !21)
!99 = !{!100, !107, !108}
!100 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !96, file: !6, baseType: !101, size: 128, align: 64, flags: DIFlagPrivate)
!101 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !6, size: 128, align: 64, elements: !102, templateParams: !31, identifier: "857c99401054bcaa39f98e6e0c6d74b")
!102 = !{!103, !105}
!103 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !101, file: !6, baseType: !104, size: 64, align: 64)
!104 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64, align: 64, dwarfAddressSpace: 0)
!105 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !101, file: !6, baseType: !106, size: 64, align: 64, offset: 64)
!106 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!107 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !96, file: !6, baseType: !28, size: 32, align: 32, offset: 128, flags: DIFlagPrivate)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !96, file: !6, baseType: !28, size: 32, align: 32, offset: 160, flags: DIFlagPrivate)
!109 = !DISubprogram(name: "call<std::sync::once::{impl#2}::call_once::{closure_env#0}<openssl_sys::openssl::init::{closure_env#0}>>", linkageName: "_ZN3std10sys_common4once5futex4Once4call17h37aaf74e5f3dff11E", scope: !12, file: !63, line: 97, type: !64, scopeLine: 97, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !110)
!110 = !{!111}
!111 = !DITemplateTypeParameter(name: "impl FnMut(&public::OnceState)", type: !69)
!112 = !{!113, !114, !115, !116, !118, !120, !127, !139}
!113 = !DILocalVariable(name: "self", arg: 1, scope: !62, file: !63, line: 97, type: !66)
!114 = !DILocalVariable(name: "ignore_poisoning", arg: 2, scope: !62, file: !63, line: 97, type: !67)
!115 = !DILocalVariable(name: "f", arg: 3, scope: !62, file: !63, line: 97, type: !68)
!116 = !DILocalVariable(name: "state", scope: !117, file: !63, line: 98, type: !28, align: 4)
!117 = distinct !DILexicalBlock(scope: !62, file: !63, line: 98, column: 9)
!118 = !DILocalVariable(name: "new", scope: !119, file: !63, line: 107, type: !28, align: 4)
!119 = distinct !DILexicalBlock(scope: !117, file: !63, line: 109, column: 21)
!120 = !DILocalVariable(name: "waiter_queue", scope: !121, file: !63, line: 115, type: !122, align: 8)
!121 = distinct !DILexicalBlock(scope: !117, file: !63, line: 115, column: 21)
!122 = !DICompositeType(tag: DW_TAG_structure_type, name: "CompletionGuard", scope: !13, file: !6, size: 128, align: 64, flags: DIFlagPrivate, elements: !123, templateParams: !31, identifier: "7f2dd6ce58c86d2c109904e880b81234")
!123 = !{!124, !126}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !122, file: !6, baseType: !125, size: 64, align: 64, flags: DIFlagPrivate)
!125 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::sync::atomic::AtomicU32", baseType: !18, size: 64, align: 64, dwarfAddressSpace: 0)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "set_state_on_drop_to", scope: !122, file: !6, baseType: !28, size: 32, align: 32, offset: 64, flags: DIFlagPrivate)
!127 = !DILocalVariable(name: "f_state", scope: !128, file: !63, line: 118, type: !129, align: 4)
!128 = distinct !DILexicalBlock(scope: !121, file: !63, line: 118, column: 21)
!129 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnceState", scope: !7, file: !6, size: 64, align: 32, flags: DIFlagPublic, elements: !130, templateParams: !31, identifier: "bea4423bf62b15eaefe9914e90de8c6e")
!130 = !{!131}
!131 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !129, file: !6, baseType: !132, size: 64, align: 32, flags: DIFlagProtected)
!132 = !DICompositeType(tag: DW_TAG_structure_type, name: "OnceState", scope: !13, file: !6, size: 64, align: 32, flags: DIFlagPublic, elements: !133, templateParams: !31, identifier: "6417c4b75a96a82faa1ad50709d0825d")
!133 = !{!134, !135}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "poisoned", scope: !132, file: !6, baseType: !67, size: 8, align: 8, offset: 32, flags: DIFlagPrivate)
!135 = !DIDerivedType(tag: DW_TAG_member, name: "set_state_to", scope: !132, file: !6, baseType: !136, size: 32, align: 32, flags: DIFlagPrivate)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cell<u32>", scope: !25, file: !6, size: 32, align: 32, flags: DIFlagPublic, elements: !137, templateParams: !29, identifier: "14e42b1f7ffb31887ec050a810dce29d")
!137 = !{!138}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !136, file: !6, baseType: !24, size: 32, align: 32, flags: DIFlagPrivate)
!139 = !DILocalVariable(name: "new", scope: !117, file: !63, line: 131, type: !28, align: 4)
!140 = !DILocation(line: 3101, column: 1, scope: !141, inlinedAt: !153)
!141 = distinct !DILexicalBlock(scope: !143, file: !142, line: 2399, column: 13)
!142 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/core/src/sync/atomic.rs", directory: "", checksumkind: CSK_MD5, checksum: "aa4c9c1f34624ecab1bb6e307c35a709")
!143 = distinct !DISubprogram(name: "load", linkageName: "_ZN4core4sync6atomic9AtomicU324load17h5ff2d4ef33afd2baE", scope: !18, file: !142, line: 2399, type: !144, scopeLine: 2399, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !37, templateParams: !31, declaration: !146, retainedNodes: !147)
!144 = !DISubroutineType(types: !145)
!145 = !{!28, !125, !40}
!146 = !DISubprogram(name: "load", linkageName: "_ZN4core4sync6atomic9AtomicU324load17h5ff2d4ef33afd2baE", scope: !18, file: !142, line: 2399, type: !144, scopeLine: 2399, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !31)
!147 = !{!148, !149, !150, !152}
!148 = !DILocalVariable(name: "self", arg: 1, scope: !141, file: !142, line: 3101, type: !125)
!149 = !DILocalVariable(name: "order", scope: !141, file: !142, line: 3101, type: !40, align: 1)
!150 = !DILocalVariable(name: "self", arg: 1, scope: !151, file: !142, line: 3101, type: !125)
!151 = distinct !DILexicalBlock(scope: !143, file: !142, line: 2399, column: 13)
!152 = !DILocalVariable(name: "order", scope: !151, file: !142, line: 3101, type: !40, align: 1)
!153 = !DILocation(line: 98, column: 36, scope: !62)
!154 = !DILocation(line: 3101, column: 1, scope: !155, inlinedAt: !188)
!155 = distinct !DILexicalBlock(scope: !156, file: !142, line: 2615, column: 13)
!156 = distinct !DISubprogram(name: "compare_exchange_weak", linkageName: "_ZN4core4sync6atomic9AtomicU3221compare_exchange_weak17h657b6466127326c2E", scope: !18, file: !142, line: 2615, type: !157, scopeLine: 2615, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !37, templateParams: !31, declaration: !175, retainedNodes: !176)
!157 = !DISubroutineType(types: !158)
!158 = !{!159, !125, !28, !28, !40, !40}
!159 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<u32, u32>", scope: !160, file: !6, size: 64, align: 32, flags: DIFlagPublic, elements: !161, templateParams: !31, identifier: "4b54359ce8968b3bd018caf9cd37044d")
!160 = !DINamespace(name: "result", scope: !21)
!161 = !{!162}
!162 = !DICompositeType(tag: DW_TAG_variant_part, scope: !159, file: !6, size: 64, align: 32, elements: !163, templateParams: !31, identifier: "f5fd453dabd88a92702ef74eb75e3219", discriminator: !174)
!163 = !{!164, !170}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !162, file: !6, baseType: !165, size: 64, align: 32, extraData: i128 0)
!165 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !159, file: !6, size: 64, align: 32, flags: DIFlagPublic, elements: !166, templateParams: !168, identifier: "6c7af2dd4ac98a198861e49225793182")
!166 = !{!167}
!167 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !165, file: !6, baseType: !28, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!168 = !{!30, !169}
!169 = !DITemplateTypeParameter(name: "E", type: !28)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !162, file: !6, baseType: !171, size: 64, align: 32, extraData: i128 1)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !159, file: !6, size: 64, align: 32, flags: DIFlagPublic, elements: !172, templateParams: !168, identifier: "f24e4e4d1023e6bddb910dd7dca4ab55")
!172 = !{!173}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !171, file: !6, baseType: !28, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!174 = !DIDerivedType(tag: DW_TAG_member, scope: !159, file: !6, baseType: !28, size: 32, align: 32, flags: DIFlagArtificial)
!175 = !DISubprogram(name: "compare_exchange_weak", linkageName: "_ZN4core4sync6atomic9AtomicU3221compare_exchange_weak17h657b6466127326c2E", scope: !18, file: !142, line: 2615, type: !157, scopeLine: 2615, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !31)
!176 = !{!177, !178, !179, !180, !181, !182, !184, !185, !186, !187}
!177 = !DILocalVariable(name: "self", arg: 1, scope: !155, file: !142, line: 3101, type: !125)
!178 = !DILocalVariable(name: "current", arg: 2, scope: !155, file: !142, line: 3101, type: !28)
!179 = !DILocalVariable(name: "new", scope: !155, file: !142, line: 3101, type: !28, align: 4)
!180 = !DILocalVariable(name: "success", scope: !155, file: !142, line: 3101, type: !40, align: 1)
!181 = !DILocalVariable(name: "failure", scope: !155, file: !142, line: 3101, type: !40, align: 1)
!182 = !DILocalVariable(name: "self", arg: 1, scope: !183, file: !142, line: 3101, type: !125)
!183 = distinct !DILexicalBlock(scope: !156, file: !142, line: 2615, column: 13)
!184 = !DILocalVariable(name: "current", scope: !183, file: !142, line: 3101, type: !28, align: 4)
!185 = !DILocalVariable(name: "new", scope: !183, file: !142, line: 3101, type: !28, align: 4)
!186 = !DILocalVariable(name: "success", scope: !183, file: !142, line: 3101, type: !40, align: 1)
!187 = !DILocalVariable(name: "failure", scope: !183, file: !142, line: 3101, type: !40, align: 1)
!188 = !DILocation(line: 108, column: 36, scope: !119)
!189 = !DILocation(line: 394, column: 22, scope: !190, inlinedAt: !198)
!190 = distinct !DILexicalBlock(scope: !192, file: !191, line: 394, column: 5)
!191 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/core/src/cell.rs", directory: "", checksumkind: CSK_MD5, checksum: "b0d7fce865d67685e67f51481f8c133a")
!192 = distinct !DISubprogram(name: "new<u32>", linkageName: "_ZN4core4cell13Cell$LT$T$GT$3new17hf9f900f1019ea1f7E", scope: !136, file: !191, line: 394, type: !193, scopeLine: 394, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !37, templateParams: !29, declaration: !195, retainedNodes: !196)
!193 = !DISubroutineType(types: !194)
!194 = !{!136, !28}
!195 = !DISubprogram(name: "new<u32>", linkageName: "_ZN4core4cell13Cell$LT$T$GT$3new17hf9f900f1019ea1f7E", scope: !136, file: !191, line: 394, type: !193, scopeLine: 394, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !29)
!196 = !{!197}
!197 = !DILocalVariable(name: "value", scope: !190, file: !191, line: 394, type: !28, align: 4)
!198 = !DILocation(line: 121, column: 43, scope: !121)
!199 = !DILocation(line: 2047, column: 22, scope: !200, inlinedAt: !207)
!200 = distinct !DILexicalBlock(scope: !201, file: !191, line: 2047, column: 5)
!201 = distinct !DISubprogram(name: "new<u32>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3new17h213634da642f908aE", scope: !24, file: !191, line: 2047, type: !202, scopeLine: 2047, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !37, templateParams: !29, declaration: !204, retainedNodes: !205)
!202 = !DISubroutineType(types: !203)
!203 = !{!24, !28}
!204 = !DISubprogram(name: "new<u32>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3new17h213634da642f908aE", scope: !24, file: !191, line: 2047, type: !202, scopeLine: 2047, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !29)
!205 = !{!206}
!206 = !DILocalVariable(name: "value", scope: !200, file: !191, line: 2047, type: !28, align: 4)
!207 = !DILocation(line: 395, column: 23, scope: !190, inlinedAt: !198)
!208 = !DILocation(line: 3101, column: 1, scope: !183, inlinedAt: !209)
!209 = !DILocation(line: 132, column: 40, scope: !117)
!210 = !DILocation(line: 3101, column: 1, scope: !151, inlinedAt: !211)
!211 = !DILocation(line: 139, column: 40, scope: !117)
!212 = !DILocation(line: 97, column: 17, scope: !62)
!213 = !DILocation(line: 97, column: 24, scope: !62)
!214 = !DILocation(line: 97, column: 48, scope: !62)
!215 = !DILocation(line: 98, column: 13, scope: !117)
!216 = !DILocation(line: 115, column: 25, scope: !121)
!217 = !DILocation(line: 118, column: 25, scope: !128)
!218 = !DILocation(line: 98, column: 25, scope: !62)
!219 = !DILocalVariable(name: "self", arg: 1, scope: !220, file: !191, line: 2112, type: !225)
!220 = distinct !DILexicalBlock(scope: !221, file: !191, line: 2112, column: 5)
!221 = distinct !DISubprogram(name: "get<u32>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3get17h7c3ccd8f18cfa4caE", scope: !24, file: !191, line: 2112, type: !222, scopeLine: 2112, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !37, templateParams: !29, declaration: !226, retainedNodes: !227)
!222 = !DISubroutineType(types: !223)
!223 = !{!224, !225}
!224 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u32", baseType: !28, size: 64, align: 64, dwarfAddressSpace: 0)
!225 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::cell::UnsafeCell<u32>", baseType: !24, size: 64, align: 64, dwarfAddressSpace: 0)
!226 = !DISubprogram(name: "get<u32>", linkageName: "_ZN4core4cell19UnsafeCell$LT$T$GT$3get17h7c3ccd8f18cfa4caE", scope: !24, file: !191, line: 2112, type: !222, scopeLine: 2112, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !29)
!227 = !{!219, !228, !230, !232, !234}
!228 = !DILocalVariable(name: "self", arg: 1, scope: !229, file: !191, line: 2112, type: !225)
!229 = distinct !DILexicalBlock(scope: !221, file: !191, line: 2112, column: 5)
!230 = !DILocalVariable(name: "self", arg: 1, scope: !231, file: !191, line: 2112, type: !225)
!231 = distinct !DILexicalBlock(scope: !221, file: !191, line: 2112, column: 5)
!232 = !DILocalVariable(name: "self", arg: 1, scope: !233, file: !191, line: 2112, type: !225)
!233 = distinct !DILexicalBlock(scope: !221, file: !191, line: 2112, column: 5)
!234 = !DILocalVariable(name: "self", arg: 1, scope: !235, file: !191, line: 2112, type: !225)
!235 = distinct !DILexicalBlock(scope: !221, file: !191, line: 2112, column: 5)
!236 = !DILocation(line: 2112, column: 22, scope: !220, inlinedAt: !237)
!237 = !DILocation(line: 2401, column: 45, scope: !141, inlinedAt: !153)
!238 = !DILocation(line: 99, column: 9, scope: !117)
!239 = !DILocation(line: 100, column: 13, scope: !117)
!240 = !DILocation(line: 142, column: 22, scope: !117)
!241 = !DILocation(line: 101, column: 30, scope: !117)
!242 = !DILocation(line: 108, column: 25, scope: !119)
!243 = !DILocation(line: 108, column: 58, scope: !119)
!244 = !DILocation(line: 2112, column: 22, scope: !229, inlinedAt: !245)
!245 = !DILocation(line: 2622, column: 57, scope: !155, inlinedAt: !188)
!246 = !DILocation(line: 107, column: 28, scope: !119)
!247 = !{i32 0, i32 2}
!248 = !DILocation(line: 130, column: 24, scope: !117)
!249 = !DILocation(line: 145, column: 6, scope: !62)
!250 = !DILocation(line: 103, column: 28, scope: !117)
!251 = !DILocalVariable(name: "pieces", arg: 1, scope: !252, file: !253, line: 321, type: !258)
!252 = distinct !DILexicalBlock(scope: !254, file: !253, line: 321, column: 5)
!253 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "f2f9e528240e472a11f8ea13e1ff6e2a")
!254 = distinct !DISubprogram(name: "new_const", linkageName: "_ZN4core3fmt9Arguments9new_const17h0f78089fc43dcc78E", scope: !255, file: !253, line: 321, type: !372, scopeLine: 321, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !37, templateParams: !31, declaration: !374, retainedNodes: !375)
!255 = !DICompositeType(tag: DW_TAG_structure_type, name: "Arguments", scope: !50, file: !6, size: 384, align: 64, flags: DIFlagPublic, elements: !256, templateParams: !31, identifier: "fbbe119434458031918720245192cd9b")
!256 = !{!257, !263, !306}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "pieces", scope: !255, file: !6, baseType: !258, size: 128, align: 64, flags: DIFlagPrivate)
!258 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[&str]", file: !6, size: 128, align: 64, elements: !259, templateParams: !31, identifier: "d76b83877ddcb5cca61caf6bdca727ac")
!259 = !{!260, !262}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !258, file: !6, baseType: !261, size: 64, align: 64)
!261 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !101, size: 64, align: 64, dwarfAddressSpace: 0)
!262 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !258, file: !6, baseType: !106, size: 64, align: 64, offset: 64)
!263 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !255, file: !6, baseType: !264, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!264 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&[core::fmt::rt::Placeholder]>", scope: !76, file: !6, size: 128, align: 64, flags: DIFlagPublic, elements: !265, templateParams: !31, identifier: "3f0763e9dba8dc7649eb55ec793f82b7")
!265 = !{!266}
!266 = !DICompositeType(tag: DW_TAG_variant_part, scope: !264, file: !6, size: 128, align: 64, elements: !267, templateParams: !31, identifier: "65fc387767de928e1cd4d1ee4a329ddc", discriminator: !305)
!267 = !{!268, !301}
!268 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !266, file: !6, baseType: !269, size: 128, align: 64, extraData: i128 0)
!269 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !264, file: !6, size: 128, align: 64, flags: DIFlagPublic, elements: !31, templateParams: !270, identifier: "b7b727cd1374fd42a671142a9ea5a26f")
!270 = !{!271}
!271 = !DITemplateTypeParameter(name: "T", type: !272)
!272 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Placeholder]", file: !6, size: 128, align: 64, elements: !273, templateParams: !31, identifier: "7ed8a4543f5da3d3ea22eb0d0ae63b5d")
!273 = !{!274, !300}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !272, file: !6, baseType: !275, size: 64, align: 64)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !276, size: 64, align: 64, dwarfAddressSpace: 0)
!276 = !DICompositeType(tag: DW_TAG_structure_type, name: "Placeholder", scope: !49, file: !6, size: 448, align: 64, flags: DIFlagPublic, elements: !277, templateParams: !31, identifier: "db22a31fb8506d38d86008c519a684b4")
!277 = !{!278, !279, !281, !282, !283, !299}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !276, file: !6, baseType: !106, size: 64, align: 64, offset: 256, flags: DIFlagPublic)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !276, file: !6, baseType: !280, size: 32, align: 32, offset: 320, flags: DIFlagPublic)
!280 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!281 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !276, file: !6, baseType: !48, size: 8, align: 8, offset: 384, flags: DIFlagPublic)
!282 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !276, file: !6, baseType: !28, size: 32, align: 32, offset: 352, flags: DIFlagPublic)
!283 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !276, file: !6, baseType: !284, size: 128, align: 64, flags: DIFlagPublic)
!284 = !DICompositeType(tag: DW_TAG_structure_type, name: "Count", scope: !49, file: !6, size: 128, align: 64, flags: DIFlagPublic, elements: !285, templateParams: !31, identifier: "c09bef3d4518c0ba899f0b6885f25658")
!285 = !{!286}
!286 = !DICompositeType(tag: DW_TAG_variant_part, scope: !284, file: !6, size: 128, align: 64, elements: !287, templateParams: !31, identifier: "8b7b65a476a212fe9e7d8598689dca9e", discriminator: !298)
!287 = !{!288, !292, !296}
!288 = !DIDerivedType(tag: DW_TAG_member, name: "Is", scope: !286, file: !6, baseType: !289, size: 128, align: 64, extraData: i128 0)
!289 = !DICompositeType(tag: DW_TAG_structure_type, name: "Is", scope: !284, file: !6, size: 128, align: 64, flags: DIFlagPublic, elements: !290, templateParams: !31, identifier: "a9c021e3234f260796f871c043bfb9db")
!290 = !{!291}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !289, file: !6, baseType: !106, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!292 = !DIDerivedType(tag: DW_TAG_member, name: "Param", scope: !286, file: !6, baseType: !293, size: 128, align: 64, extraData: i128 1)
!293 = !DICompositeType(tag: DW_TAG_structure_type, name: "Param", scope: !284, file: !6, size: 128, align: 64, flags: DIFlagPublic, elements: !294, templateParams: !31, identifier: "6a517bdc83de4935d8b683e708a39d7f")
!294 = !{!295}
!295 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !293, file: !6, baseType: !106, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!296 = !DIDerivedType(tag: DW_TAG_member, name: "Implied", scope: !286, file: !6, baseType: !297, size: 128, align: 64, extraData: i128 2)
!297 = !DICompositeType(tag: DW_TAG_structure_type, name: "Implied", scope: !284, file: !6, size: 128, align: 64, flags: DIFlagPublic, elements: !31, identifier: "489690d9cd1f382a93c32ad4b95c006")
!298 = !DIDerivedType(tag: DW_TAG_member, scope: !284, file: !6, baseType: !89, size: 64, align: 64, flags: DIFlagArtificial)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !276, file: !6, baseType: !284, size: 128, align: 64, offset: 128, flags: DIFlagPublic)
!300 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !272, file: !6, baseType: !106, size: 64, align: 64, offset: 64)
!301 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !266, file: !6, baseType: !302, size: 128, align: 64)
!302 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !264, file: !6, size: 128, align: 64, flags: DIFlagPublic, elements: !303, templateParams: !270, identifier: "4322c5f7abcbd5957cbf53e6b210ebc1")
!303 = !{!304}
!304 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !302, file: !6, baseType: !272, size: 128, align: 64, flags: DIFlagPublic)
!305 = !DIDerivedType(tag: DW_TAG_member, scope: !264, file: !6, baseType: !89, size: 64, align: 64, flags: DIFlagArtificial)
!306 = !DIDerivedType(tag: DW_TAG_member, name: "args", scope: !255, file: !6, baseType: !307, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!307 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[core::fmt::rt::Argument]", file: !6, size: 128, align: 64, elements: !308, templateParams: !31, identifier: "328e4d0db9d439bdb659dbd84a34cd91")
!308 = !{!309, !371}
!309 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !307, file: !6, baseType: !310, size: 64, align: 64)
!310 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !311, size: 64, align: 64, dwarfAddressSpace: 0)
!311 = !DICompositeType(tag: DW_TAG_structure_type, name: "Argument", scope: !49, file: !6, size: 128, align: 64, flags: DIFlagPublic, elements: !312, templateParams: !31, identifier: "e825b7a6cffad0289192b16912b4da94")
!312 = !{!313, !317}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !311, file: !6, baseType: !314, size: 64, align: 64, flags: DIFlagPrivate)
!314 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::rt::{extern#0}::Opaque", baseType: !315, size: 64, align: 64, dwarfAddressSpace: 0)
!315 = !DICompositeType(tag: DW_TAG_structure_type, name: "Opaque", scope: !316, file: !6, align: 8, elements: !31, identifier: "669514fbed6981fc34939e4aba79e3bc")
!316 = !DINamespace(name: "{extern#0}", scope: !49)
!317 = !DIDerivedType(tag: DW_TAG_member, name: "formatter", scope: !311, file: !6, baseType: !318, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!318 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn(&core::fmt::rt::{extern#0}::Opaque, &mut core::fmt::Formatter) -> core::result::Result<(), core::fmt::Error>", baseType: !319, size: 64, align: 64, dwarfAddressSpace: 0)
!319 = !DISubroutineType(types: !320)
!320 = !{!321, !314, !339}
!321 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !160, file: !6, size: 8, align: 8, flags: DIFlagPublic, elements: !322, templateParams: !31, identifier: "ef21c1a4a7a3bb675edf359fd7da20c2")
!322 = !{!323}
!323 = !DICompositeType(tag: DW_TAG_variant_part, scope: !321, file: !6, size: 8, align: 8, elements: !324, templateParams: !31, identifier: "1e6064d2fa7899348d4637058c3df544", discriminator: !338)
!324 = !{!325, !334}
!325 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !323, file: !6, baseType: !326, size: 8, align: 8, extraData: i128 0)
!326 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !321, file: !6, size: 8, align: 8, flags: DIFlagPublic, elements: !327, templateParams: !330, identifier: "4676f9084c1926904df27c02f470a258")
!327 = !{!328}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !326, file: !6, baseType: !329, align: 8, offset: 8, flags: DIFlagPublic)
!329 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!330 = !{!331, !332}
!331 = !DITemplateTypeParameter(name: "T", type: !329)
!332 = !DITemplateTypeParameter(name: "E", type: !333)
!333 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !50, file: !6, align: 8, flags: DIFlagPublic, elements: !31, identifier: "525f7c35922c78aaf2831aa7e2d5fd8b")
!334 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !323, file: !6, baseType: !335, size: 8, align: 8, extraData: i128 1)
!335 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !321, file: !6, size: 8, align: 8, flags: DIFlagPublic, elements: !336, templateParams: !330, identifier: "4fc1bf8c8c918aa838a2a0aa40186b71")
!336 = !{!337}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !335, file: !6, baseType: !333, align: 8, offset: 8, flags: DIFlagPublic)
!338 = !DIDerivedType(tag: DW_TAG_member, scope: !321, file: !6, baseType: !41, size: 8, align: 8, flags: DIFlagArtificial)
!339 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !340, size: 64, align: 64, dwarfAddressSpace: 0)
!340 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !50, file: !6, size: 512, align: 64, flags: DIFlagPublic, elements: !341, templateParams: !31, identifier: "c2a81c20b281ad088a53ffd69742e2f1")
!341 = !{!342, !343, !344, !345, !359, !360}
!342 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !340, file: !6, baseType: !28, size: 32, align: 32, offset: 416, flags: DIFlagPrivate)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !340, file: !6, baseType: !280, size: 32, align: 32, offset: 384, flags: DIFlagPrivate)
!344 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !340, file: !6, baseType: !48, size: 8, align: 8, offset: 448, flags: DIFlagPrivate)
!345 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !340, file: !6, baseType: !346, size: 128, align: 64, flags: DIFlagPrivate)
!346 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !76, file: !6, size: 128, align: 64, flags: DIFlagPublic, elements: !347, templateParams: !31, identifier: "f4d83d61e370ffa2bf86fb2b476c03b9")
!347 = !{!348}
!348 = !DICompositeType(tag: DW_TAG_variant_part, scope: !346, file: !6, size: 128, align: 64, elements: !349, templateParams: !31, identifier: "2e6a6158b8523df5f27116dc0cb3efb2", discriminator: !358)
!349 = !{!350, !354}
!350 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !348, file: !6, baseType: !351, size: 128, align: 64, extraData: i128 0)
!351 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !346, file: !6, size: 128, align: 64, flags: DIFlagPublic, elements: !31, templateParams: !352, identifier: "bad25d21ed86c6e99411c76de143d53a")
!352 = !{!353}
!353 = !DITemplateTypeParameter(name: "T", type: !106)
!354 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !348, file: !6, baseType: !355, size: 128, align: 64, extraData: i128 1)
!355 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !346, file: !6, size: 128, align: 64, flags: DIFlagPublic, elements: !356, templateParams: !352, identifier: "825bd40f4b16f9f7d54c405cc2904cf6")
!356 = !{!357}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !355, file: !6, baseType: !106, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!358 = !DIDerivedType(tag: DW_TAG_member, scope: !346, file: !6, baseType: !89, size: 64, align: 64, flags: DIFlagArtificial)
!359 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !340, file: !6, baseType: !346, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!360 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !340, file: !6, baseType: !361, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!361 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !6, size: 128, align: 64, elements: !362, templateParams: !31, identifier: "d242d9e3b9076fd347f00d776e8d4173")
!362 = !{!363, !366}
!363 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !361, file: !6, baseType: !364, size: 64, align: 64)
!364 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !365, size: 64, align: 64, dwarfAddressSpace: 0)
!365 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !6, align: 8, elements: !31, identifier: "6f41b2858562f876d2b2674263e48852")
!366 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !361, file: !6, baseType: !367, size: 64, align: 64, offset: 64)
!367 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !368, size: 64, align: 64, dwarfAddressSpace: 0)
!368 = !DICompositeType(tag: DW_TAG_array_type, baseType: !106, size: 192, align: 64, elements: !369)
!369 = !{!370}
!370 = !DISubrange(count: 3, lowerBound: 0)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !307, file: !6, baseType: !106, size: 64, align: 64, offset: 64)
!372 = !DISubroutineType(types: !373)
!373 = !{!255, !258}
!374 = !DISubprogram(name: "new_const", linkageName: "_ZN4core3fmt9Arguments9new_const17h0f78089fc43dcc78E", scope: !255, file: !253, line: 321, type: !372, scopeLine: 321, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !31)
!375 = !{!251}
!376 = !DILocation(line: 321, column: 28, scope: !252, inlinedAt: !377)
!377 = !DILocation(line: 106, column: 38, scope: !378)
!378 = !DILexicalBlockFile(scope: !117, file: !379, discriminator: 0)
!379 = !DIFile(filename: "/rustc/aedd173a2c086e558c2b66d3743b344f977621a7/library/core/src/panic.rs", directory: "", checksumkind: CSK_MD5, checksum: "20344942d88925c2c0cb1f59161dfcc4")
!380 = !DILocation(line: 322, column: 12, scope: !252, inlinedAt: !377)
!381 = !DILocation(line: 325, column: 9, scope: !252, inlinedAt: !377)
!382 = !{i64 8}
!383 = !DILocation(line: 103, column: 21, scope: !117)
!384 = !DILocation(line: 323, column: 13, scope: !252, inlinedAt: !377)
!385 = !DILocation(line: 107, column: 32, scope: !119)
!386 = !DILocation(line: 110, column: 25, scope: !119)
!387 = !DILocation(line: 1, column: 1, scope: !388)
!388 = !DILexicalBlockFile(scope: !117, file: !4, discriminator: 0)
!389 = !DILocation(line: 116, column: 25, scope: !117)
!390 = !DILocation(line: 120, column: 39, scope: !121)
!391 = !DILocation(line: 119, column: 32, scope: !121)
!392 = !DILocation(line: 118, column: 35, scope: !121)
!393 = !{i8 0, i8 2}
!394 = !DILocation(line: 124, column: 21, scope: !128)
!395 = !{i64 4}
!396 = !DILocation(line: 127, column: 17, scope: !117)
!397 = !DILocation(line: 125, column: 57, scope: !128)
!398 = !DILocalVariable(name: "self", arg: 1, scope: !399, file: !191, line: 509, type: !403)
!399 = distinct !DILexicalBlock(scope: !400, file: !191, line: 509, column: 5)
!400 = distinct !DISubprogram(name: "get<u32>", linkageName: "_ZN4core4cell13Cell$LT$T$GT$3get17h483d8c36f240293eE", scope: !136, file: !191, line: 509, type: !401, scopeLine: 509, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !37, templateParams: !29, declaration: !404, retainedNodes: !405)
!401 = !DISubroutineType(types: !402)
!402 = !{!28, !403}
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::cell::Cell<u32>", baseType: !136, size: 64, align: 64, dwarfAddressSpace: 0)
!404 = !DISubprogram(name: "get<u32>", linkageName: "_ZN4core4cell13Cell$LT$T$GT$3get17h483d8c36f240293eE", scope: !136, file: !191, line: 509, type: !401, scopeLine: 509, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !29)
!405 = !{!398}
!406 = !DILocation(line: 509, column: 16, scope: !399, inlinedAt: !407)
!407 = !DILocation(line: 125, column: 84, scope: !128)
!408 = !DILocation(line: 512, column: 19, scope: !399, inlinedAt: !407)
!409 = !DILocation(line: 2112, column: 22, scope: !231, inlinedAt: !410)
!410 = !DILocation(line: 512, column: 30, scope: !399, inlinedAt: !407)
!411 = !DILocation(line: 512, column: 18, scope: !399, inlinedAt: !407)
!412 = !DILocation(line: 125, column: 21, scope: !128)
!413 = !DILocation(line: 97, column: 5, scope: !62)
!414 = !DILocation(line: 132, column: 29, scope: !117)
!415 = !DILocation(line: 2112, column: 22, scope: !233, inlinedAt: !416)
!416 = !DILocation(line: 2622, column: 57, scope: !183, inlinedAt: !209)
!417 = !DILocation(line: 131, column: 32, scope: !117)
!418 = !DILocation(line: 138, column: 21, scope: !117)
!419 = !{i32 0, i32 1000000001}
!420 = !DILocation(line: 139, column: 29, scope: !117)
!421 = !DILocation(line: 2112, column: 22, scope: !235, inlinedAt: !422)
!422 = !DILocation(line: 2401, column: 45, scope: !151, inlinedAt: !211)
!423 = !DILocation(line: 139, column: 21, scope: !117)
!424 = !DILocation(line: 128, column: 37, scope: !117)
!425 = !DILocation(line: 131, column: 36, scope: !117)
!426 = !DILocation(line: 134, column: 25, scope: !117)
!427 = distinct !DISubprogram(name: "call<std::sync::once::{impl#2}::call_once::{closure_env#0}<openssl_sys::openssl::assume_init::{closure_env#0}>>", linkageName: "_ZN3std10sys_common4once5futex4Once4call17hc241c1cac261eed7E", scope: !12, file: !63, line: 97, type: !428, scopeLine: 97, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !37, templateParams: !451, declaration: !450, retainedNodes: !453)
!428 = !DISubroutineType(types: !429)
!429 = !{null, !66, !67, !430, !95}
!430 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut std::sync::once::{impl#2}::call_once::{closure_env#0}<openssl_sys::openssl::assume_init::{closure_env#0}>", baseType: !431, size: 64, align: 64, dwarfAddressSpace: 0)
!431 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<openssl_sys::openssl::assume_init::{closure_env#0}>", scope: !70, file: !6, size: 64, align: 64, elements: !432, templateParams: !31, identifier: "7ed1727d0643755d586051e9f5fef08c")
!432 = !{!433}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__f", scope: !431, file: !6, baseType: !434, size: 64, align: 64)
!434 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::option::Option<openssl_sys::openssl::assume_init::{closure_env#0}>", baseType: !435, size: 64, align: 64, dwarfAddressSpace: 0)
!435 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<openssl_sys::openssl::assume_init::{closure_env#0}>", scope: !76, file: !6, size: 8, align: 8, flags: DIFlagPublic, elements: !436, templateParams: !31, identifier: "f10e3dae7eb3cb095962b294b2df5dce")
!436 = !{!437}
!437 = !DICompositeType(tag: DW_TAG_variant_part, scope: !435, file: !6, size: 8, align: 8, elements: !438, templateParams: !31, identifier: "4eb6df51006a08f5df9775c1054c12f9", discriminator: !449)
!438 = !{!439, !445}
!439 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !437, file: !6, baseType: !440, size: 8, align: 8, extraData: i128 0)
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !435, file: !6, size: 8, align: 8, flags: DIFlagPublic, elements: !31, templateParams: !441, identifier: "494416456a181d19f62e99db8353224c")
!441 = !{!442}
!442 = !DITemplateTypeParameter(name: "T", type: !443)
!443 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !444, file: !6, align: 8, elements: !31, identifier: "7c72da91e011daa2a4143b933bb95884")
!444 = !DINamespace(name: "assume_init", scope: !2)
!445 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !437, file: !6, baseType: !446, size: 8, align: 8, extraData: i128 1)
!446 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !435, file: !6, size: 8, align: 8, flags: DIFlagPublic, elements: !447, templateParams: !441, identifier: "709e15519e598b0cc92f86cdcd1b3434")
!447 = !{!448}
!448 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !446, file: !6, baseType: !443, align: 8, offset: 8, flags: DIFlagPublic)
!449 = !DIDerivedType(tag: DW_TAG_member, scope: !435, file: !6, baseType: !41, size: 8, align: 8, flags: DIFlagArtificial)
!450 = !DISubprogram(name: "call<std::sync::once::{impl#2}::call_once::{closure_env#0}<openssl_sys::openssl::assume_init::{closure_env#0}>>", linkageName: "_ZN3std10sys_common4once5futex4Once4call17hc241c1cac261eed7E", scope: !12, file: !63, line: 97, type: !428, scopeLine: 97, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !451)
!451 = !{!452}
!452 = !DITemplateTypeParameter(name: "impl FnMut(&public::OnceState)", type: !431)
!453 = !{!454, !455, !456, !457, !459, !461, !463, !465}
!454 = !DILocalVariable(name: "self", arg: 1, scope: !427, file: !63, line: 97, type: !66)
!455 = !DILocalVariable(name: "ignore_poisoning", arg: 2, scope: !427, file: !63, line: 97, type: !67)
!456 = !DILocalVariable(name: "f", arg: 3, scope: !427, file: !63, line: 97, type: !430)
!457 = !DILocalVariable(name: "state", scope: !458, file: !63, line: 98, type: !28, align: 4)
!458 = distinct !DILexicalBlock(scope: !427, file: !63, line: 98, column: 9)
!459 = !DILocalVariable(name: "new", scope: !460, file: !63, line: 107, type: !28, align: 4)
!460 = distinct !DILexicalBlock(scope: !458, file: !63, line: 109, column: 21)
!461 = !DILocalVariable(name: "waiter_queue", scope: !462, file: !63, line: 115, type: !122, align: 8)
!462 = distinct !DILexicalBlock(scope: !458, file: !63, line: 115, column: 21)
!463 = !DILocalVariable(name: "f_state", scope: !464, file: !63, line: 118, type: !129, align: 4)
!464 = distinct !DILexicalBlock(scope: !462, file: !63, line: 118, column: 21)
!465 = !DILocalVariable(name: "new", scope: !458, file: !63, line: 131, type: !28, align: 4)
!466 = !DILocation(line: 3101, column: 1, scope: !467, inlinedAt: !475)
!467 = distinct !DILexicalBlock(scope: !468, file: !142, line: 2399, column: 13)
!468 = distinct !DISubprogram(name: "load", linkageName: "_ZN4core4sync6atomic9AtomicU324load17h5ff2d4ef33afd2baE", scope: !18, file: !142, line: 2399, type: !144, scopeLine: 2399, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !37, templateParams: !31, declaration: !146, retainedNodes: !469)
!469 = !{!470, !471, !472, !474}
!470 = !DILocalVariable(name: "self", arg: 1, scope: !467, file: !142, line: 3101, type: !125)
!471 = !DILocalVariable(name: "order", scope: !467, file: !142, line: 3101, type: !40, align: 1)
!472 = !DILocalVariable(name: "self", arg: 1, scope: !473, file: !142, line: 3101, type: !125)
!473 = distinct !DILexicalBlock(scope: !468, file: !142, line: 2399, column: 13)
!474 = !DILocalVariable(name: "order", scope: !473, file: !142, line: 3101, type: !40, align: 1)
!475 = !DILocation(line: 98, column: 36, scope: !427)
!476 = !DILocation(line: 3101, column: 1, scope: !477, inlinedAt: !491)
!477 = distinct !DILexicalBlock(scope: !478, file: !142, line: 2615, column: 13)
!478 = distinct !DISubprogram(name: "compare_exchange_weak", linkageName: "_ZN4core4sync6atomic9AtomicU3221compare_exchange_weak17h657b6466127326c2E", scope: !18, file: !142, line: 2615, type: !157, scopeLine: 2615, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !37, templateParams: !31, declaration: !175, retainedNodes: !479)
!479 = !{!480, !481, !482, !483, !484, !485, !487, !488, !489, !490}
!480 = !DILocalVariable(name: "self", arg: 1, scope: !477, file: !142, line: 3101, type: !125)
!481 = !DILocalVariable(name: "current", arg: 2, scope: !477, file: !142, line: 3101, type: !28)
!482 = !DILocalVariable(name: "new", scope: !477, file: !142, line: 3101, type: !28, align: 4)
!483 = !DILocalVariable(name: "success", scope: !477, file: !142, line: 3101, type: !40, align: 1)
!484 = !DILocalVariable(name: "failure", scope: !477, file: !142, line: 3101, type: !40, align: 1)
