; ModuleID = '1b50h1evyg3imw5f'
source_filename = "1b50h1evyg3imw5f"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"core::result::Result<usize, std::io::error::Error>" = type { i64, [1 x i64] }
%"core::ptr::metadata::PtrRepr<[u8]>" = type { [2 x i64] }
%"core::result::Result<usize, std::io::error::Error>::Ok" = type { [1 x i64], i64 }
%"core::fmt::builders::DebugList<'_, '_>" = type { %"core::fmt::builders::DebugInner<'_, '_>" }
%"core::fmt::builders::DebugInner<'_, '_>" = type { ptr, i8, i8, [6 x i8] }
%"core::fmt::Formatter<'_>" = type { { i64, i64 }, { i64, i64 }, { ptr, ptr }, i32, i32, i8, [7 x i8] }
%"core::fmt::Arguments<'_>" = type { { ptr, i64 }, { ptr, i64 }, { ptr, i64 } }
%"core::result::Result<usize, curl::easy::handler::ReadError>" = type { i8, [15 x i8] }
%"core::result::Result<usize, std::io::error::Error>::Err" = type { [1 x i64], ptr }
%"curl::error::Error" = type { { ptr, i64 }, i32, [1 x i32] }
%"core::result::Result<(), curl::error::Error>::Err" = type { [1 x i64], %"curl::error::Error" }
%"alloc::string::String" = type { %"alloc::vec::Vec<u8>" }
%"alloc::vec::Vec<u8>" = type { { i64, ptr }, i64 }
%"alloc::string::FromUtf8Error" = type { %"alloc::vec::Vec<u8>", %"core::str::error::Utf8Error" }
%"core::str::error::Utf8Error" = type { i64, { i8, i8 }, [6 x i8] }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = !DICompositeType(tag: DW_TAG_structure_type, name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !14, templateParams: !23, identifier: "770490d8f687dae09a860715504ff0d5")
!4 = !{!5, !8, !10, !11, !12, !13}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!13 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<()>", scope: !15, file: !2, size: 64, align: 64, elements: !18, templateParams: !23, identifier: "362ac6f5686ac672e6371cd5ef186026")
!15 = !DINamespace(name: "lang_start", scope: !16)
!16 = !DINamespace(name: "rt", scope: !17)
!17 = !DINamespace(name: "std", scope: null)
!18 = !{!19}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !14, file: !2, baseType: !20, size: 64, align: 64)
!20 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn()", baseType: !21, size: 64, align: 64, dwarfAddressSpace: 0)
!21 = !DISubroutineType(types: !22)
!22 = !{null}
!23 = !{}
!24 = !DIGlobalVariableExpression(var: !25, expr: !DIExpression())
!25 = distinct !DIGlobalVariable(name: "<&u8 as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !26, isLocal: true, isDefinition: true)
!26 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&u8 as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !27, vtableHolder: !32, templateParams: !23, identifier: "7b718776883f65cf546e07d7563eceb1")
!27 = !{!28, !29, !30, !31}
!28 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !26, file: !2, baseType: !6, size: 64, align: 64)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !26, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!30 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !26, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!31 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !26, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!32 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&u8", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!33 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!34 = !DIGlobalVariableExpression(var: !35, expr: !DIExpression())
!35 = distinct !DIGlobalVariable(name: "<curl::error::Error as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !36, isLocal: true, isDefinition: true)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "<curl::error::Error as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !37, vtableHolder: !42, templateParams: !23, identifier: "c70ce94e4670a369b63acf8e7ab03ca5")
!37 = !{!38, !39, !40, !41}
!38 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !36, file: !2, baseType: !6, size: 64, align: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !36, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !36, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !36, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!42 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !43, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !45, templateParams: !23, identifier: "ddd388fc75f59d2442b2b60c361626ab")
!43 = !DINamespace(name: "error", scope: !44)
!44 = !DINamespace(name: "curl", scope: null)
!45 = !{!46, !48}
!46 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !42, file: !2, baseType: !47, size: 32, align: 32, offset: 128, flags: DIFlagPrivate)
!47 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "extra", scope: !42, file: !2, baseType: !49, size: 128, align: 64, flags: DIFlagPrivate)
!49 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<alloc::boxed::Box<str, alloc::alloc::Global>>", scope: !50, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !52, templateParams: !23, identifier: "5fa9598899bcc3c566f1984e6234f3c")
!50 = !DINamespace(name: "option", scope: !51)
!51 = !DINamespace(name: "core", scope: null)
!52 = !{!53}
!53 = !DICompositeType(tag: DW_TAG_variant_part, scope: !49, file: !2, size: 128, align: 64, elements: !54, templateParams: !23, identifier: "c7df87a01d89a09289978195589a760d", discriminator: !68)
!54 = !{!55, !64}
!55 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !53, file: !2, baseType: !56, size: 128, align: 64, extraData: i128 0)
!56 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !49, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !23, templateParams: !57, identifier: "c211eaeebe79bad0244e7668a2e3d30")
!57 = !{!58}
!58 = !DITemplateTypeParameter(name: "T", type: !59)
!59 = !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<str, alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !60, templateParams: !23, identifier: "8ec72dd7ce25d84661eea2a58784f4bf")
!60 = !{!61, !63}
!61 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !59, file: !2, baseType: !62, size: 64, align: 64)
!62 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!63 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !59, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!64 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !53, file: !2, baseType: !65, size: 128, align: 64)
!65 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !49, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !66, templateParams: !57, identifier: "4c46352e4738c09c4cf0d12acdbe3d24")
!66 = !{!67}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !65, file: !2, baseType: !59, size: 128, align: 64, flags: DIFlagPublic)
!68 = !DIDerivedType(tag: DW_TAG_member, scope: !49, file: !2, baseType: !69, size: 64, align: 64, flags: DIFlagArtificial)
!69 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!70 = !DIGlobalVariableExpression(var: !71, expr: !DIExpression())
!71 = distinct !DIGlobalVariable(name: "<alloc::string::FromUtf8Error as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !72, isLocal: true, isDefinition: true)
!72 = !DICompositeType(tag: DW_TAG_structure_type, name: "<alloc::string::FromUtf8Error as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !73, vtableHolder: !78, templateParams: !23, identifier: "749a9444e6bd448250d514ccf28c70a2")
!73 = !{!74, !75, !76, !77}
!74 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !72, file: !2, baseType: !6, size: 64, align: 64)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !72, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!76 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !72, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!77 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !72, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!78 = !DICompositeType(tag: DW_TAG_structure_type, name: "FromUtf8Error", scope: !79, file: !2, size: 320, align: 64, flags: DIFlagPublic, elements: !81, templateParams: !23, identifier: "19d64bb041d451c3750fb5eeaad11661")
!79 = !DINamespace(name: "string", scope: !80)
!80 = !DINamespace(name: "alloc", scope: null)
!81 = !{!82, !116}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "bytes", scope: !78, file: !2, baseType: !83, size: 192, align: 64, flags: DIFlagPrivate)
!83 = !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<u8, alloc::alloc::Global>", scope: !84, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !85, templateParams: !113, identifier: "8949b586a600dcc26d6ef56c002264cb")
!84 = !DINamespace(name: "vec", scope: !80)
!85 = !{!86, !115}
!86 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !83, file: !2, baseType: !87, size: 128, align: 64, flags: DIFlagPrivate)
!87 = !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<u8, alloc::alloc::Global>", scope: !88, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !89, templateParams: !113, identifier: "eb31d632bc1d31b7c35b448d1275aaa")
!88 = !DINamespace(name: "raw_vec", scope: !80)
!89 = !{!90, !106, !110}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !87, file: !2, baseType: !91, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!91 = !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<u8>", scope: !92, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !94, templateParams: !101, identifier: "a335dd000d4c617c66d0b6ca0f3402e2")
!92 = !DINamespace(name: "unique", scope: !93)
!93 = !DINamespace(name: "ptr", scope: !51)
!94 = !{!95, !103}
!95 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !91, file: !2, baseType: !96, size: 64, align: 64, flags: DIFlagPrivate)
!96 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !97, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !98, templateParams: !101, identifier: "cb2fa0300e1ee98393802a75329fa0a")
!97 = !DINamespace(name: "non_null", scope: !93)
!98 = !{!99}
!99 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !96, file: !2, baseType: !100, size: 64, align: 64, flags: DIFlagPrivate)
!100 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!101 = !{!102}
!102 = !DITemplateTypeParameter(name: "T", type: !33)
!103 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !91, file: !2, baseType: !104, align: 8, offset: 64, flags: DIFlagPrivate)
!104 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<u8>", scope: !105, file: !2, align: 8, flags: DIFlagPublic, elements: !23, templateParams: !101, identifier: "cd70a6180aabcea7921752320f50f339")
!105 = !DINamespace(name: "marker", scope: !51)
!106 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !87, file: !2, baseType: !107, size: 64, align: 64, flags: DIFlagPrivate)
!107 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cap", scope: !88, file: !2, size: 64, align: 64, flags: DIFlagPrivate, elements: !108, templateParams: !23, identifier: "deb3baec45383200e935f018a3902de2")
!108 = !{!109}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !107, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!110 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !87, file: !2, baseType: !111, align: 8, offset: 128, flags: DIFlagPrivate)
!111 = !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !112, file: !2, align: 8, flags: DIFlagPublic, elements: !23, identifier: "c55dd29d74827bd9b52a9450298a6411")
!112 = !DINamespace(name: "alloc", scope: !80)
!113 = !{!102, !114}
!114 = !DITemplateTypeParameter(name: "A", type: !111)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !83, file: !2, baseType: !9, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!116 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !78, file: !2, baseType: !117, size: 128, align: 64, offset: 192, flags: DIFlagPrivate)
!117 = !DICompositeType(tag: DW_TAG_structure_type, name: "Utf8Error", scope: !118, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !120, templateParams: !23, identifier: "8b8d1509513404952fbb0123af9086b2")
!118 = !DINamespace(name: "error", scope: !119)
!119 = !DINamespace(name: "str", scope: !51)
!120 = !{!121, !122}
!121 = !DIDerivedType(tag: DW_TAG_member, name: "valid_up_to", scope: !117, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagProtected)
!122 = !DIDerivedType(tag: DW_TAG_member, name: "error_len", scope: !117, file: !2, baseType: !123, size: 16, align: 8, offset: 64, flags: DIFlagProtected)
!123 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<u8>", scope: !50, file: !2, size: 16, align: 8, flags: DIFlagPublic, elements: !124, templateParams: !23, identifier: "bd2e693da9b5e277b1cc1bd6db536055")
!124 = !{!125}
!125 = !DICompositeType(tag: DW_TAG_variant_part, scope: !123, file: !2, size: 16, align: 8, elements: !126, templateParams: !23, identifier: "f493dafe2e261e54300f93c1c858af4", discriminator: !133)
!126 = !{!127, !129}
!127 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !125, file: !2, baseType: !128, size: 16, align: 8, extraData: i128 0)
!128 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !123, file: !2, size: 16, align: 8, flags: DIFlagPublic, elements: !23, templateParams: !101, identifier: "8bfcb23e1e95b7f810d1d0c496198c7d")
!129 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !125, file: !2, baseType: !130, size: 16, align: 8, extraData: i128 1)
!130 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !123, file: !2, size: 16, align: 8, flags: DIFlagPublic, elements: !131, templateParams: !101, identifier: "c9ed99b452ba3e5d99ae07c40235cc7f")
!131 = !{!132}
!132 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !130, file: !2, baseType: !33, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!133 = !DIDerivedType(tag: DW_TAG_member, scope: !123, file: !2, baseType: !33, size: 8, align: 8, flags: DIFlagArtificial)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(name: "<function::make_rpc::{closure_env#0} as core::ops::function::FnMut<(&mut [u8])>>::{vtable}", scope: null, file: !2, type: !136, isLocal: true, isDefinition: true)
!136 = !DICompositeType(tag: DW_TAG_structure_type, name: "<function::make_rpc::{closure_env#0} as core::ops::function::FnMut<(&mut [u8])>>::{vtable_type}", file: !2, size: 320, align: 64, flags: DIFlagArtificial, elements: !137, vtableHolder: !143, templateParams: !23, identifier: "94a8a589070d891ee6f53d0223f55e84")
!137 = !{!138, !139, !140, !141, !142}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !136, file: !2, baseType: !6, size: 64, align: 64)
!139 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !136, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!140 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !136, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!141 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !136, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!142 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !136, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!143 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !144, file: !2, size: 64, align: 64, elements: !146, templateParams: !23, identifier: "38ee49d39f58b5f2ddb293b4b0468639")
!144 = !DINamespace(name: "make_rpc", scope: !145)
!145 = !DINamespace(name: "function", scope: null)
!146 = !{!147}
!147 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__input_to_be_sent", scope: !143, file: !2, baseType: !148, size: 64, align: 64)
!148 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut &[u8]", baseType: !149, size: 64, align: 64, dwarfAddressSpace: 0)
!149 = !DICompositeType(tag: DW_TAG_structure_type, name: "&[u8]", file: !2, size: 128, align: 64, elements: !150, templateParams: !23, identifier: "4f7d759e2003ffb713a77bd933fd0146")
!150 = !{!151, !152}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !149, file: !2, baseType: !62, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !149, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!153 = !DIGlobalVariableExpression(var: !154, expr: !DIExpression())
!154 = distinct !DIGlobalVariable(name: "<function::make_rpc::{closure_env#1} as core::ops::function::FnMut<(&[u8])>>::{vtable}", scope: null, file: !2, type: !155, isLocal: true, isDefinition: true)
!155 = !DICompositeType(tag: DW_TAG_structure_type, name: "<function::make_rpc::{closure_env#1} as core::ops::function::FnMut<(&[u8])>>::{vtable_type}", file: !2, size: 320, align: 64, flags: DIFlagArtificial, elements: !156, vtableHolder: !162, templateParams: !23, identifier: "5d8c1a87c25f4750921876a3ec3f07bc")
!156 = !{!157, !158, !159, !160, !161}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !155, file: !2, baseType: !6, size: 64, align: 64)
!158 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !155, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !155, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!160 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !155, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!161 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !155, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!162 = !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#1}", scope: !144, file: !2, size: 64, align: 64, elements: !163, templateParams: !23, identifier: "c921d31c7dba2b85f3656141170a5bf2")
!163 = !{!164}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "_ref__html_data", scope: !162, file: !2, baseType: !165, size: 64, align: 64)
!165 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut alloc::string::String", baseType: !166, size: 64, align: 64, dwarfAddressSpace: 0)
!166 = !DICompositeType(tag: DW_TAG_structure_type, name: "String", scope: !79, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !167, templateParams: !23, identifier: "affaab2e7d1df8e48e4999e480b4b01")
!167 = !{!168}
!168 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !166, file: !2, baseType: !83, size: 192, align: 64, flags: DIFlagPrivate)
!169 = !DIGlobalVariableExpression(var: !170, expr: !DIExpression())
!170 = distinct !DIGlobalVariable(name: "<usize as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !171, isLocal: true, isDefinition: true)
!171 = !DICompositeType(tag: DW_TAG_structure_type, name: "<usize as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !172, vtableHolder: !9, templateParams: !23, identifier: "87aba3604281fd2831f1d0e331894648")
!172 = !{!173, !174, !175, !176}
!173 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !171, file: !2, baseType: !6, size: 64, align: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !171, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!175 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !171, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!176 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !171, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!177 = !DIGlobalVariableExpression(var: !178, expr: !DIExpression())
!178 = distinct !DIGlobalVariable(name: "<&core::option::Option<u8> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !179, isLocal: true, isDefinition: true)
!179 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&core::option::Option<u8> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !180, vtableHolder: !185, templateParams: !23, identifier: "50aa774cd344df0f826fd66a5fc42d6f")
!180 = !{!181, !182, !183, !184}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !179, file: !2, baseType: !6, size: 64, align: 64)
!182 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !179, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!183 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !179, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!184 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !179, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!185 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::option::Option<u8>", baseType: !123, size: 64, align: 64, dwarfAddressSpace: 0)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "<alloc::vec::Vec<u8, alloc::alloc::Global> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !188, isLocal: true, isDefinition: true)
!188 = !DICompositeType(tag: DW_TAG_structure_type, name: "<alloc::vec::Vec<u8, alloc::alloc::Global> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !189, vtableHolder: !83, templateParams: !23, identifier: "fa1d89b802565533e05ee3a482e83225")
!189 = !{!190, !191, !192, !193}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !188, file: !2, baseType: !6, size: 64, align: 64)
!191 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !188, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!192 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !188, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!193 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !188, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(name: "<&core::str::error::Utf8Error as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !196, isLocal: true, isDefinition: true)
!196 = !DICompositeType(tag: DW_TAG_structure_type, name: "<&core::str::error::Utf8Error as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !197, vtableHolder: !202, templateParams: !23, identifier: "ef371a415cc0008e22ab5afffcfb19cc")
!197 = !{!198, !199, !200, !201}
!198 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !196, file: !2, baseType: !6, size: 64, align: 64)
!199 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !196, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!200 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !196, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!201 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !196, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!202 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::str::error::Utf8Error", baseType: !117, size: 64, align: 64, dwarfAddressSpace: 0)
!203 = !{i32 8, !"PIC Level", i32 2}
!204 = !{i32 7, !"PIE Level", i32 2}
!205 = !{i32 2, !"RtLibUseGOT", i32 1}
!206 = !{i32 2, !"Dwarf Version", i32 4}
!207 = !{i32 2, !"Debug Info Version", i32 3}
!208 = !{!"rustc version 1.76.0 (07dca489a 2024-02-04)"}
!209 = distinct !DICompileUnit(language: DW_LANG_Rust, file: !210, producer: "clang LLVM (rustc version 1.76.0 (07dca489a 2024-02-04))", isOptimized: false, runtimeVersion: 0, emissionKind: FullDebug, enums: !211, globals: !338, splitDebugInlining: false, nameTableKind: None)
!210 = !DIFile(filename: "src/main.rs/@/1b50h1evyg3imw5f", directory: "/proj/zyuxuanssf-PG0/zyuxuan/faas-test/merge_func/merge-rust-and-swift/example/caller")
!211 = !{!212, !257, !265, !271}
!212 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ErrorKind", scope: !213, file: !2, baseType: !33, size: 8, align: 8, flags: DIFlagEnumClass, elements: !215)
!213 = !DINamespace(name: "error", scope: !214)
!214 = !DINamespace(name: "io", scope: !17)
!215 = !{!216, !217, !218, !219, !220, !221, !222, !223, !224, !225, !226, !227, !228, !229, !230, !231, !232, !233, !234, !235, !236, !237, !238, !239, !240, !241, !242, !243, !244, !245, !246, !247, !248, !249, !250, !251, !252, !253, !254, !255, !256}
!216 = !DIEnumerator(name: "NotFound", value: 0, isUnsigned: true)
!217 = !DIEnumerator(name: "PermissionDenied", value: 1, isUnsigned: true)
!218 = !DIEnumerator(name: "ConnectionRefused", value: 2, isUnsigned: true)
!219 = !DIEnumerator(name: "ConnectionReset", value: 3, isUnsigned: true)
!220 = !DIEnumerator(name: "HostUnreachable", value: 4, isUnsigned: true)
!221 = !DIEnumerator(name: "NetworkUnreachable", value: 5, isUnsigned: true)
!222 = !DIEnumerator(name: "ConnectionAborted", value: 6, isUnsigned: true)
!223 = !DIEnumerator(name: "NotConnected", value: 7, isUnsigned: true)
!224 = !DIEnumerator(name: "AddrInUse", value: 8, isUnsigned: true)
!225 = !DIEnumerator(name: "AddrNotAvailable", value: 9, isUnsigned: true)
!226 = !DIEnumerator(name: "NetworkDown", value: 10, isUnsigned: true)
!227 = !DIEnumerator(name: "BrokenPipe", value: 11, isUnsigned: true)
!228 = !DIEnumerator(name: "AlreadyExists", value: 12, isUnsigned: true)
!229 = !DIEnumerator(name: "WouldBlock", value: 13, isUnsigned: true)
!230 = !DIEnumerator(name: "NotADirectory", value: 14, isUnsigned: true)
!231 = !DIEnumerator(name: "IsADirectory", value: 15, isUnsigned: true)
!232 = !DIEnumerator(name: "DirectoryNotEmpty", value: 16, isUnsigned: true)
!233 = !DIEnumerator(name: "ReadOnlyFilesystem", value: 17, isUnsigned: true)
!234 = !DIEnumerator(name: "FilesystemLoop", value: 18, isUnsigned: true)
!235 = !DIEnumerator(name: "StaleNetworkFileHandle", value: 19, isUnsigned: true)
!236 = !DIEnumerator(name: "InvalidInput", value: 20, isUnsigned: true)
!237 = !DIEnumerator(name: "InvalidData", value: 21, isUnsigned: true)
!238 = !DIEnumerator(name: "TimedOut", value: 22, isUnsigned: true)
!239 = !DIEnumerator(name: "WriteZero", value: 23, isUnsigned: true)
!240 = !DIEnumerator(name: "StorageFull", value: 24, isUnsigned: true)
!241 = !DIEnumerator(name: "NotSeekable", value: 25, isUnsigned: true)
!242 = !DIEnumerator(name: "FilesystemQuotaExceeded", value: 26, isUnsigned: true)
!243 = !DIEnumerator(name: "FileTooLarge", value: 27, isUnsigned: true)
!244 = !DIEnumerator(name: "ResourceBusy", value: 28, isUnsigned: true)
!245 = !DIEnumerator(name: "ExecutableFileBusy", value: 29, isUnsigned: true)
!246 = !DIEnumerator(name: "Deadlock", value: 30, isUnsigned: true)
!247 = !DIEnumerator(name: "CrossesDevices", value: 31, isUnsigned: true)
!248 = !DIEnumerator(name: "TooManyLinks", value: 32, isUnsigned: true)
!249 = !DIEnumerator(name: "InvalidFilename", value: 33, isUnsigned: true)
!250 = !DIEnumerator(name: "ArgumentListTooLong", value: 34, isUnsigned: true)
!251 = !DIEnumerator(name: "Interrupted", value: 35, isUnsigned: true)
!252 = !DIEnumerator(name: "Unsupported", value: 36, isUnsigned: true)
!253 = !DIEnumerator(name: "UnexpectedEof", value: 37, isUnsigned: true)
!254 = !DIEnumerator(name: "OutOfMemory", value: 38, isUnsigned: true)
!255 = !DIEnumerator(name: "Other", value: 39, isUnsigned: true)
!256 = !DIEnumerator(name: "Uncategorized", value: 40, isUnsigned: true)
!257 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "Alignment", scope: !258, file: !2, baseType: !33, size: 8, align: 8, flags: DIFlagEnumClass, elements: !260)
!258 = !DINamespace(name: "rt", scope: !259)
!259 = !DINamespace(name: "fmt", scope: !51)
!260 = !{!261, !262, !263, !264}
!261 = !DIEnumerator(name: "Left", value: 0, isUnsigned: true)
!262 = !DIEnumerator(name: "Right", value: 1, isUnsigned: true)
!263 = !DIEnumerator(name: "Center", value: 2, isUnsigned: true)
!264 = !DIEnumerator(name: "Unknown", value: 3, isUnsigned: true)
!265 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ReadError", scope: !266, file: !2, baseType: !33, size: 8, align: 8, flags: DIFlagEnumClass, elements: !268)
!266 = !DINamespace(name: "handler", scope: !267)
!267 = !DINamespace(name: "easy", scope: !44)
!268 = !{!269, !270}
!269 = !DIEnumerator(name: "Abort", value: 0, isUnsigned: true)
!270 = !DIEnumerator(name: "Pause", value: 1, isUnsigned: true)
!271 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "AlignmentEnum64", scope: !272, file: !2, baseType: !69, size: 64, align: 64, flags: DIFlagEnumClass, elements: !273)
!272 = !DINamespace(name: "alignment", scope: !93)
!273 = !{!274, !275, !276, !277, !278, !279, !280, !281, !282, !283, !284, !285, !286, !287, !288, !289, !290, !291, !292, !293, !294, !295, !296, !297, !298, !299, !300, !301, !302, !303, !304, !305, !306, !307, !308, !309, !310, !311, !312, !313, !314, !315, !316, !317, !318, !319, !320, !321, !322, !323, !324, !325, !326, !327, !328, !329, !330, !331, !332, !333, !334, !335, !336, !337}
!274 = !DIEnumerator(name: "_Align1Shl0", value: 1, isUnsigned: true)
!275 = !DIEnumerator(name: "_Align1Shl1", value: 2, isUnsigned: true)
!276 = !DIEnumerator(name: "_Align1Shl2", value: 4, isUnsigned: true)
!277 = !DIEnumerator(name: "_Align1Shl3", value: 8, isUnsigned: true)
!278 = !DIEnumerator(name: "_Align1Shl4", value: 16, isUnsigned: true)
!279 = !DIEnumerator(name: "_Align1Shl5", value: 32, isUnsigned: true)
!280 = !DIEnumerator(name: "_Align1Shl6", value: 64, isUnsigned: true)
!281 = !DIEnumerator(name: "_Align1Shl7", value: 128, isUnsigned: true)
!282 = !DIEnumerator(name: "_Align1Shl8", value: 256, isUnsigned: true)
!283 = !DIEnumerator(name: "_Align1Shl9", value: 512, isUnsigned: true)
!284 = !DIEnumerator(name: "_Align1Shl10", value: 1024, isUnsigned: true)
!285 = !DIEnumerator(name: "_Align1Shl11", value: 2048, isUnsigned: true)
!286 = !DIEnumerator(name: "_Align1Shl12", value: 4096, isUnsigned: true)
!287 = !DIEnumerator(name: "_Align1Shl13", value: 8192, isUnsigned: true)
!288 = !DIEnumerator(name: "_Align1Shl14", value: 16384, isUnsigned: true)
!289 = !DIEnumerator(name: "_Align1Shl15", value: 32768, isUnsigned: true)
!290 = !DIEnumerator(name: "_Align1Shl16", value: 65536, isUnsigned: true)
!291 = !DIEnumerator(name: "_Align1Shl17", value: 131072, isUnsigned: true)
!292 = !DIEnumerator(name: "_Align1Shl18", value: 262144, isUnsigned: true)
!293 = !DIEnumerator(name: "_Align1Shl19", value: 524288, isUnsigned: true)
!294 = !DIEnumerator(name: "_Align1Shl20", value: 1048576, isUnsigned: true)
!295 = !DIEnumerator(name: "_Align1Shl21", value: 2097152, isUnsigned: true)
!296 = !DIEnumerator(name: "_Align1Shl22", value: 4194304, isUnsigned: true)
!297 = !DIEnumerator(name: "_Align1Shl23", value: 8388608, isUnsigned: true)
!298 = !DIEnumerator(name: "_Align1Shl24", value: 16777216, isUnsigned: true)
!299 = !DIEnumerator(name: "_Align1Shl25", value: 33554432, isUnsigned: true)
!300 = !DIEnumerator(name: "_Align1Shl26", value: 67108864, isUnsigned: true)
!301 = !DIEnumerator(name: "_Align1Shl27", value: 134217728, isUnsigned: true)
!302 = !DIEnumerator(name: "_Align1Shl28", value: 268435456, isUnsigned: true)
!303 = !DIEnumerator(name: "_Align1Shl29", value: 536870912, isUnsigned: true)
!304 = !DIEnumerator(name: "_Align1Shl30", value: 1073741824, isUnsigned: true)
!305 = !DIEnumerator(name: "_Align1Shl31", value: 2147483648, isUnsigned: true)
!306 = !DIEnumerator(name: "_Align1Shl32", value: 4294967296, isUnsigned: true)
!307 = !DIEnumerator(name: "_Align1Shl33", value: 8589934592, isUnsigned: true)
!308 = !DIEnumerator(name: "_Align1Shl34", value: 17179869184, isUnsigned: true)
!309 = !DIEnumerator(name: "_Align1Shl35", value: 34359738368, isUnsigned: true)
!310 = !DIEnumerator(name: "_Align1Shl36", value: 68719476736, isUnsigned: true)
!311 = !DIEnumerator(name: "_Align1Shl37", value: 137438953472, isUnsigned: true)
!312 = !DIEnumerator(name: "_Align1Shl38", value: 274877906944, isUnsigned: true)
!313 = !DIEnumerator(name: "_Align1Shl39", value: 549755813888, isUnsigned: true)
!314 = !DIEnumerator(name: "_Align1Shl40", value: 1099511627776, isUnsigned: true)
!315 = !DIEnumerator(name: "_Align1Shl41", value: 2199023255552, isUnsigned: true)
!316 = !DIEnumerator(name: "_Align1Shl42", value: 4398046511104, isUnsigned: true)
!317 = !DIEnumerator(name: "_Align1Shl43", value: 8796093022208, isUnsigned: true)
!318 = !DIEnumerator(name: "_Align1Shl44", value: 17592186044416, isUnsigned: true)
!319 = !DIEnumerator(name: "_Align1Shl45", value: 35184372088832, isUnsigned: true)
!320 = !DIEnumerator(name: "_Align1Shl46", value: 70368744177664, isUnsigned: true)
!321 = !DIEnumerator(name: "_Align1Shl47", value: 140737488355328, isUnsigned: true)
!322 = !DIEnumerator(name: "_Align1Shl48", value: 281474976710656, isUnsigned: true)
!323 = !DIEnumerator(name: "_Align1Shl49", value: 562949953421312, isUnsigned: true)
!324 = !DIEnumerator(name: "_Align1Shl50", value: 1125899906842624, isUnsigned: true)
!325 = !DIEnumerator(name: "_Align1Shl51", value: 2251799813685248, isUnsigned: true)
!326 = !DIEnumerator(name: "_Align1Shl52", value: 4503599627370496, isUnsigned: true)
!327 = !DIEnumerator(name: "_Align1Shl53", value: 9007199254740992, isUnsigned: true)
!328 = !DIEnumerator(name: "_Align1Shl54", value: 18014398509481984, isUnsigned: true)
!329 = !DIEnumerator(name: "_Align1Shl55", value: 36028797018963968, isUnsigned: true)
!330 = !DIEnumerator(name: "_Align1Shl56", value: 72057594037927936, isUnsigned: true)
!331 = !DIEnumerator(name: "_Align1Shl57", value: 144115188075855872, isUnsigned: true)
!332 = !DIEnumerator(name: "_Align1Shl58", value: 288230376151711744, isUnsigned: true)
!333 = !DIEnumerator(name: "_Align1Shl59", value: 576460752303423488, isUnsigned: true)
!334 = !DIEnumerator(name: "_Align1Shl60", value: 1152921504606846976, isUnsigned: true)
!335 = !DIEnumerator(name: "_Align1Shl61", value: 2305843009213693952, isUnsigned: true)
!336 = !DIEnumerator(name: "_Align1Shl62", value: 4611686018427387904, isUnsigned: true)
!337 = !DIEnumerator(name: "_Align1Shl63", value: 9223372036854775808, isUnsigned: true)
!338 = !{!0, !24, !34, !70, !134, !153, !169, !177, !186, !194}
!339 = distinct !DISubprogram(name: "__rust_begin_short_backtrace<fn(), ()>", linkageName: "_ZN3std10sys_common9backtrace28__rust_begin_short_backtrace17h463937ddfdc9d640E", scope: !341, file: !340, line: 151, type: !343, scopeLine: 151, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !349, retainedNodes: !345)
!340 = !DIFile(filename: "/rustc/07dca489ac2d933c78d3c5158e3f43beefeb02ce/library/std/src/sys_common/backtrace.rs", directory: "", checksumkind: CSK_MD5, checksum: "ea95829b2a6298387d0233825edf7299")
!341 = !DINamespace(name: "backtrace", scope: !342)
!342 = !DINamespace(name: "sys_common", scope: !17)
!343 = !DISubroutineType(types: !344)
!344 = !{null, !20}
!345 = !{!346, !347}
!346 = !DILocalVariable(name: "f", arg: 1, scope: !339, file: !340, line: 151, type: !20)
!347 = !DILocalVariable(name: "result", scope: !348, file: !340, line: 155, type: !7, align: 1)
!348 = distinct !DILexicalBlock(scope: !339, file: !340, line: 155, column: 5)
!349 = !{!350, !351}
!350 = !DITemplateTypeParameter(name: "F", type: !20)
!351 = !DITemplateTypeParameter(name: "T", type: !7)
!352 = !DILocalVariable(name: "dummy", scope: !353, file: !354, line: 285, type: !7, align: 1)
!353 = distinct !DILexicalBlock(scope: !355, file: !354, line: 285, column: 1)
!354 = !DIFile(filename: "/rustc/07dca489ac2d933c78d3c5158e3f43beefeb02ce/library/core/src/hint.rs", directory: "", checksumkind: CSK_MD5, checksum: "83ae27415b0777e10095874992cfc336")
!355 = distinct !DISubprogram(name: "black_box<()>", linkageName: "_ZN4core4hint9black_box17h3e7db833f0c6f520E", scope: !356, file: !354, line: 285, type: !357, scopeLine: 285, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !360, retainedNodes: !359)
!356 = !DINamespace(name: "hint", scope: !51)
!357 = !DISubroutineType(types: !358)
!358 = !{null, !7}
!359 = !{!352}
!360 = !{!351}
!361 = !DILocation(line: 285, column: 27, scope: !353, inlinedAt: !362)
!362 = !DILocation(line: 158, column: 5, scope: !348)
!363 = !DILocation(line: 155, column: 9, scope: !348)
!364 = !DILocation(line: 151, column: 43, scope: !339)
!365 = !DILocation(line: 155, column: 18, scope: !339)
!366 = !DILocation(line: 286, column: 5, scope: !353, inlinedAt: !362)
!367 = !{i32 3558172}
!368 = !DILocation(line: 161, column: 2, scope: !339)
!369 = distinct !DISubprogram(name: "read", linkageName: "_ZN3std2io5impls60_$LT$impl$u20$std..io..Read$u20$for$u20$$RF$$u5b$u8$u5d$$GT$4read17h408fc840a3c5fe98E", scope: !371, file: !370, line: 235, type: !373, scopeLine: 235, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !23, retainedNodes: !458)
!370 = !DIFile(filename: "/rustc/07dca489ac2d933c78d3c5158e3f43beefeb02ce/library/std/src/io/impls.rs", directory: "", checksumkind: CSK_MD5, checksum: "4eeba2116ba8a769f800e3b6c015d0f7")
!371 = !DINamespace(name: "{impl#8}", scope: !372)
!372 = !DINamespace(name: "impls", scope: !214)
!373 = !DISubroutineType(types: !374)
!374 = !{!375, !148, !454}
!375 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<usize, std::io::error::Error>", scope: !376, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !377, templateParams: !23, identifier: "234be43002d499788377ec9ae812a734")
!376 = !DINamespace(name: "result", scope: !51)
!377 = !{!378}
!378 = !DICompositeType(tag: DW_TAG_variant_part, scope: !375, file: !2, size: 128, align: 64, elements: !379, templateParams: !23, identifier: "18aecfbfdf3832902755254a8fd5d04", discriminator: !453)
!379 = !{!380, !449}
!380 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !378, file: !2, baseType: !381, size: 128, align: 64, extraData: i128 0)
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !375, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !382, templateParams: !384, identifier: "738de33cbc302617736383190eed4c34")
!382 = !{!383}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !381, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!384 = !{!385, !386}
!385 = !DITemplateTypeParameter(name: "T", type: !9)
!386 = !DITemplateTypeParameter(name: "E", type: !387)
!387 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !213, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !388, templateParams: !23, identifier: "6b8ce4ac7d780db030170874ef2bd023")
!388 = !{!389}
!389 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !387, file: !2, baseType: !390, size: 64, align: 64, flags: DIFlagPrivate)
!390 = !DICompositeType(tag: DW_TAG_structure_type, name: "Repr", scope: !391, file: !2, size: 64, align: 64, flags: DIFlagProtected, elements: !392, templateParams: !23, identifier: "4fc4c15dddf3f908bcad1727353d4472")
!391 = !DINamespace(name: "repr_bitpacked", scope: !213)
!392 = !{!393, !397}
!393 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !390, file: !2, baseType: !394, size: 64, align: 64, flags: DIFlagPrivate)
!394 = !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<()>", scope: !97, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !395, templateParams: !360, identifier: "8b9819334bd52bba7b4ae6681feef07a")
!395 = !{!396}
!396 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !394, file: !2, baseType: !6, size: 64, align: 64, flags: DIFlagPrivate)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !390, file: !2, baseType: !398, align: 8, offset: 64, flags: DIFlagPrivate)
!398 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<std::io::error::ErrorData<alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>>>", scope: !105, file: !2, align: 8, flags: DIFlagPublic, elements: !23, templateParams: !399, identifier: "a07d9bb61c0ddbe7fe7616d15f606846")
!399 = !{!400}
!400 = !DITemplateTypeParameter(name: "T", type: !401)
!401 = !DICompositeType(tag: DW_TAG_structure_type, name: "ErrorData<alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>>", scope: !213, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !402, templateParams: !23, identifier: "ccde735e6699897134173dc60f676d2")
!402 = !{!403}
!403 = !DICompositeType(tag: DW_TAG_variant_part, scope: !401, file: !2, size: 128, align: 64, elements: !404, templateParams: !23, identifier: "e859f47920554ca366a343c5dcec271e", discriminator: !448)
!404 = !{!405, !427, !431, !444}
!405 = !DIDerivedType(tag: DW_TAG_member, name: "Os", scope: !403, file: !2, baseType: !406, size: 128, align: 64, extraData: i128 0)
!406 = !DICompositeType(tag: DW_TAG_structure_type, name: "Os", scope: !401, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !407, templateParams: !410, identifier: "32f8c83dde83377656fb3388d4335a32")
!407 = !{!408}
!408 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !406, file: !2, baseType: !409, size: 32, align: 32, offset: 32, flags: DIFlagPrivate)
!409 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!410 = !{!411}
!411 = !DITemplateTypeParameter(name: "C", type: !412)
!412 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>", baseType: !413, size: 64, align: 64, dwarfAddressSpace: 0)
!413 = !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !213, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !414, templateParams: !23, identifier: "9bacd57a2140e3aabbdcd0c139659075")
!414 = !{!415, !416}
!415 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !413, file: !2, baseType: !212, size: 8, align: 8, offset: 128, flags: DIFlagPrivate)
!416 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !413, file: !2, baseType: !417, size: 128, align: 64, flags: DIFlagPrivate)
!417 = !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<(dyn core::error::Error + core::marker::Send + core::marker::Sync), alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !418, templateParams: !23, identifier: "796084215a4993ada58c66f50b02e654")
!418 = !{!419, !422}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !417, file: !2, baseType: !420, size: 64, align: 64)
!420 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !421, size: 64, align: 64, dwarfAddressSpace: 0)
!421 = !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn core::error::Error + core::marker::Send + core::marker::Sync)", file: !2, align: 8, elements: !23, identifier: "28caa73145f2caac16f6608dac93cb05")
!422 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !417, file: !2, baseType: !423, size: 64, align: 64, offset: 64)
!423 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 3]", baseType: !424, size: 64, align: 64, dwarfAddressSpace: 0)
!424 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 192, align: 64, elements: !425)
!425 = !{!426}
!426 = !DISubrange(count: 3, lowerBound: 0)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "Simple", scope: !403, file: !2, baseType: !428, size: 128, align: 64, extraData: i128 1)
!428 = !DICompositeType(tag: DW_TAG_structure_type, name: "Simple", scope: !401, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !429, templateParams: !410, identifier: "8309f5ec4e81d848cfa01c0c234a9b1f")
!429 = !{!430}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !428, file: !2, baseType: !212, size: 8, align: 8, offset: 8, flags: DIFlagPrivate)
!431 = !DIDerivedType(tag: DW_TAG_member, name: "SimpleMessage", scope: !403, file: !2, baseType: !432, size: 128, align: 64, extraData: i128 2)
!432 = !DICompositeType(tag: DW_TAG_structure_type, name: "SimpleMessage", scope: !401, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !433, templateParams: !410, identifier: "1b330a47485b632c7ea0e58a5bdef6e")
!433 = !{!434}
!434 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !432, file: !2, baseType: !435, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!435 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::io::error::SimpleMessage", baseType: !436, size: 64, align: 64, dwarfAddressSpace: 0)
!436 = !DICompositeType(tag: DW_TAG_structure_type, name: "SimpleMessage", scope: !213, file: !2, size: 192, align: 64, flags: DIFlagProtected, elements: !437, templateParams: !23, identifier: "66b67eaebcc177db8317df5690ae045a")
!437 = !{!438, !439}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !436, file: !2, baseType: !212, size: 8, align: 8, offset: 128, flags: DIFlagPrivate)
!439 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !436, file: !2, baseType: !440, size: 128, align: 64, flags: DIFlagPrivate)
!440 = !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !441, templateParams: !23, identifier: "857c99401054bcaa39f98e6e0c6d74b")
!441 = !{!442, !443}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !440, file: !2, baseType: !62, size: 64, align: 64)
!443 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !440, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!444 = !DIDerivedType(tag: DW_TAG_member, name: "Custom", scope: !403, file: !2, baseType: !445, size: 128, align: 64, extraData: i128 3)
!445 = !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !401, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !446, templateParams: !410, identifier: "5492f63794b4ac187447ac34e1cb5aa0")
!446 = !{!447}
!447 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !445, file: !2, baseType: !412, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!448 = !DIDerivedType(tag: DW_TAG_member, scope: !401, file: !2, baseType: !33, size: 8, align: 8, flags: DIFlagArtificial)
!449 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !378, file: !2, baseType: !450, size: 128, align: 64, extraData: i128 1)
!450 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !375, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !451, templateParams: !384, identifier: "199ee54037436f158d9ab9aa58bbca85")
!451 = !{!452}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !450, file: !2, baseType: !387, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!453 = !DIDerivedType(tag: DW_TAG_member, scope: !375, file: !2, baseType: !69, size: 64, align: 64, flags: DIFlagArtificial)
!454 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut [u8]", file: !2, size: 128, align: 64, elements: !455, templateParams: !23, identifier: "5acbf15c847666982b641ea58cf98317")
!455 = !{!456, !457}
!456 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !454, file: !2, baseType: !62, size: 64, align: 64)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !454, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!458 = !{!459, !460, !461, !463, !465}
!459 = !DILocalVariable(name: "self", arg: 1, scope: !369, file: !370, line: 235, type: !148)
!460 = !DILocalVariable(name: "buf", arg: 2, scope: !369, file: !370, line: 235, type: !454)
!461 = !DILocalVariable(name: "amt", scope: !462, file: !370, line: 236, type: !9, align: 8)
!462 = distinct !DILexicalBlock(scope: !369, file: !370, line: 236, column: 9)
!463 = !DILocalVariable(name: "a", scope: !464, file: !370, line: 237, type: !149, align: 8)
!464 = distinct !DILexicalBlock(scope: !462, file: !370, line: 237, column: 9)
!465 = !DILocalVariable(name: "b", scope: !464, file: !370, line: 237, type: !149, align: 8)
!466 = !DILocation(line: 235, column: 13, scope: !369)
!467 = !DILocation(line: 235, column: 24, scope: !369)
!468 = !DILocalVariable(name: "self", arg: 1, scope: !469, file: !470, line: 28, type: !454)
!469 = distinct !DILexicalBlock(scope: !471, file: !470, line: 28, column: 5)
!470 = !DIFile(filename: "/rustc/07dca489ac2d933c78d3c5158e3f43beefeb02ce/library/core/src/slice/index.rs", directory: "", checksumkind: CSK_MD5, checksum: "e7f22ccdd2c655ed8ac93890d4b7736c")
!471 = distinct !DISubprogram(name: "index_mut<u8, core::ops::range::RangeTo<usize>>", linkageName: "_ZN4core5slice5index77_$LT$impl$u20$core..ops..index..IndexMut$LT$I$GT$$u20$for$u20$$u5b$T$u5d$$GT$9index_mut17h932e56d59091711bE", scope: !472, file: !470, line: 28, type: !475, scopeLine: 28, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !494, retainedNodes: !492)
!472 = !DINamespace(name: "{impl#1}", scope: !473)
!473 = !DINamespace(name: "index", scope: !474)
!474 = !DINamespace(name: "slice", scope: !51)
!475 = !DISubroutineType(types: !476)
!476 = !{!454, !454, !477, !484}
!477 = !DICompositeType(tag: DW_TAG_structure_type, name: "RangeTo<usize>", scope: !478, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !480, templateParams: !482, identifier: "2460a225483ac318ceb7e9dbd023783f")
!478 = !DINamespace(name: "range", scope: !479)
!479 = !DINamespace(name: "ops", scope: !51)
!480 = !{!481}
!481 = !DIDerivedType(tag: DW_TAG_member, name: "end", scope: !477, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPublic)
!482 = !{!483}
!483 = !DITemplateTypeParameter(name: "Idx", type: !9)
!484 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::panic::location::Location", baseType: !485, size: 64, align: 64, dwarfAddressSpace: 0)
!485 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", scope: !486, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !488, templateParams: !23, identifier: "fb540937ace2d985e245a40d85b37b88")
!486 = !DINamespace(name: "location", scope: !487)
!487 = !DINamespace(name: "panic", scope: !51)
!488 = !{!489, !490, !491}
!489 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !485, file: !2, baseType: !440, size: 128, align: 64, flags: DIFlagPrivate)
!490 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !485, file: !2, baseType: !47, size: 32, align: 32, offset: 128, flags: DIFlagPrivate)
!491 = !DIDerivedType(tag: DW_TAG_member, name: "col", scope: !485, file: !2, baseType: !47, size: 32, align: 32, offset: 160, flags: DIFlagPrivate)
!492 = !{!468, !493}
!493 = !DILocalVariable(name: "index", scope: !469, file: !470, line: 28, type: !477, align: 8)
!494 = !{!102, !495}
!495 = !DITemplateTypeParameter(name: "I", type: !477)
!496 = !DILocation(line: 28, column: 18, scope: !469, inlinedAt: !497)
!497 = !DILocation(line: 245, column: 16, scope: !464)
!498 = !DILocalVariable(name: "slice", arg: 2, scope: !499, file: !470, line: 445, type: !454)
!499 = distinct !DILexicalBlock(scope: !500, file: !470, line: 445, column: 5)
!500 = distinct !DISubprogram(name: "index_mut<u8>", linkageName: "_ZN108_$LT$core..ops..range..RangeTo$LT$usize$GT$$u20$as$u20$core..slice..index..SliceIndex$LT$$u5b$T$u5d$$GT$$GT$9index_mut17h0aa0c6caf505f7f6E", scope: !501, file: !470, line: 445, type: !502, scopeLine: 445, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !101, retainedNodes: !504)
!501 = !DINamespace(name: "{impl#5}", scope: !473)
!502 = !DISubroutineType(types: !503)
!503 = !{!454, !477, !454, !484}
!504 = !{!505, !498}
!505 = !DILocalVariable(name: "self", scope: !499, file: !470, line: 445, type: !477, align: 8)
!506 = !DILocation(line: 445, column: 24, scope: !499, inlinedAt: !507)
!507 = !DILocation(line: 29, column: 15, scope: !469, inlinedAt: !497)
!508 = !DILocation(line: 236, column: 28, scope: !369)
!509 = !DILocalVariable(name: "v1", arg: 1, scope: !510, file: !511, line: 1207, type: !9)
!510 = distinct !DILexicalBlock(scope: !512, file: !511, line: 1207, column: 1)
!511 = !DIFile(filename: "/rustc/07dca489ac2d933c78d3c5158e3f43beefeb02ce/library/core/src/cmp.rs", directory: "", checksumkind: CSK_MD5, checksum: "e7dfb71b0febf697c510811a5bb6bf9e")
!512 = distinct !DISubprogram(name: "min<usize>", linkageName: "_ZN4core3cmp3min17h562d1c38a818c5f3E", scope: !513, file: !511, line: 1207, type: !514, scopeLine: 1207, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !518, retainedNodes: !516)
!513 = !DINamespace(name: "cmp", scope: !51)
!514 = !DISubroutineType(types: !515)
!515 = !{!9, !9, !9}
!516 = !{!509, !517}
!517 = !DILocalVariable(name: "v2", arg: 2, scope: !510, file: !511, line: 1207, type: !9)
!518 = !{!385}
!519 = !DILocation(line: 1207, column: 20, scope: !510, inlinedAt: !520)
!520 = !DILocation(line: 236, column: 19, scope: !369)
!521 = !DILocalVariable(name: "self", arg: 1, scope: !522, file: !511, line: 849, type: !9)
!522 = distinct !DILexicalBlock(scope: !523, file: !511, line: 849, column: 5)
!523 = distinct !DISubprogram(name: "min<usize>", linkageName: "_ZN4core3cmp3Ord3min17h6a2496068d7c38a0E", scope: !524, file: !511, line: 849, type: !514, scopeLine: 849, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !527, retainedNodes: !525)
!524 = !DINamespace(name: "Ord", scope: !513)
!525 = !{!521, !526}
!526 = !DILocalVariable(name: "other", arg: 2, scope: !522, file: !511, line: 849, type: !9)
!527 = !{!528}
!528 = !DITemplateTypeParameter(name: "Self", type: !9)
!529 = !DILocation(line: 849, column: 12, scope: !522, inlinedAt: !530)
!530 = !DILocation(line: 1208, column: 8, scope: !510, inlinedAt: !520)
!531 = !DILocation(line: 236, column: 39, scope: !369)
!532 = !{i64 1}
!533 = !DILocation(line: 1207, column: 27, scope: !510, inlinedAt: !520)
!534 = !DILocation(line: 849, column: 18, scope: !522, inlinedAt: !530)
!535 = !DILocation(line: 853, column: 9, scope: !522, inlinedAt: !530)
!536 = !DILocation(line: 236, column: 13, scope: !462)
!537 = !DILocalVariable(name: "mid", arg: 2, scope: !538, file: !539, line: 1866, type: !9)
!538 = distinct !DILexicalBlock(scope: !540, file: !539, line: 1866, column: 5)
!539 = !DIFile(filename: "/rustc/07dca489ac2d933c78d3c5158e3f43beefeb02ce/library/core/src/slice/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "a72c882159264612b29903a5fbfe3281")
!540 = distinct !DISubprogram(name: "split_at<u8>", linkageName: "_ZN4core5slice29_$LT$impl$u20$$u5b$T$u5d$$GT$8split_at17h5e0a08d50441d96eE", scope: !541, file: !539, line: 1866, type: !542, scopeLine: 1866, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !101, retainedNodes: !548)
!541 = !DINamespace(name: "{impl#0}", scope: !474)
!542 = !DISubroutineType(types: !543)
!543 = !{!544, !149, !9, !484}
!544 = !DICompositeType(tag: DW_TAG_structure_type, name: "(&[u8], &[u8])", file: !2, size: 256, align: 64, elements: !545, templateParams: !23, identifier: "7e3c2aba8f23de476f91602faae6c77d")
!545 = !{!546, !547}
!546 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !544, file: !2, baseType: !149, size: 128, align: 64)
!547 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !544, file: !2, baseType: !149, size: 128, align: 64, offset: 128)
!548 = !{!549, !537}
!549 = !DILocalVariable(name: "self", arg: 1, scope: !538, file: !539, line: 1866, type: !149)
!550 = !DILocation(line: 1866, column: 34, scope: !538, inlinedAt: !551)
!551 = !DILocation(line: 237, column: 27, scope: !462)
!552 = !DILocalVariable(name: "mid", arg: 2, scope: !553, file: !539, line: 1952, type: !9)
!553 = distinct !DILexicalBlock(scope: !554, file: !539, line: 1952, column: 5)
!554 = distinct !DISubprogram(name: "split_at_unchecked<u8>", linkageName: "_ZN4core5slice29_$LT$impl$u20$$u5b$T$u5d$$GT$18split_at_unchecked17he0c6f3eb587d6769E", scope: !541, file: !539, line: 1952, type: !555, scopeLine: 1952, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !101, retainedNodes: !557)
!555 = !DISubroutineType(types: !556)
!556 = !{!544, !149, !9}
!557 = !{!558, !552, !559, !561}
!558 = !DILocalVariable(name: "self", arg: 1, scope: !553, file: !539, line: 1952, type: !149)
!559 = !DILocalVariable(name: "len", scope: !560, file: !539, line: 1957, type: !9, align: 8)
!560 = distinct !DILexicalBlock(scope: !553, file: !539, line: 1957, column: 9)
!561 = !DILocalVariable(name: "ptr", scope: !562, file: !539, line: 1958, type: !100, align: 8)
!562 = distinct !DILexicalBlock(scope: !560, file: !539, line: 1958, column: 9)
!563 = !DILocation(line: 1952, column: 51, scope: !553, inlinedAt: !564)
!564 = !DILocation(line: 1870, column: 23, scope: !538, inlinedAt: !551)
!565 = !DILocalVariable(name: "len", arg: 2, scope: !566, file: !567, line: 94, type: !9)
!566 = distinct !DILexicalBlock(scope: !568, file: !567, line: 94, column: 1)
!567 = !DIFile(filename: "/rustc/07dca489ac2d933c78d3c5158e3f43beefeb02ce/library/core/src/slice/raw.rs", directory: "", checksumkind: CSK_MD5, checksum: "503b19e16c498622a7ca460c2aab934c")
!568 = distinct !DISubprogram(name: "from_raw_parts<u8>", linkageName: "_ZN4core5slice3raw14from_raw_parts17heba98cbbed9f66aeE", scope: !569, file: !567, line: 94, type: !570, scopeLine: 94, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !101, retainedNodes: !572)
!569 = !DINamespace(name: "raw", scope: !474)
!570 = !DISubroutineType(types: !571)
!571 = !{!149, !100, !9}
!572 = !{!573, !565, !574, !576}
!573 = !DILocalVariable(name: "data", arg: 1, scope: !566, file: !567, line: 94, type: !100)
!574 = !DILocalVariable(name: "data", arg: 1, scope: !575, file: !567, line: 94, type: !100)
!575 = distinct !DILexicalBlock(scope: !568, file: !567, line: 94, column: 1)
!576 = !DILocalVariable(name: "len", arg: 2, scope: !575, file: !567, line: 94, type: !9)
!577 = !DILocation(line: 94, column: 59, scope: !566, inlinedAt: !578)
!578 = !DILocation(line: 1966, column: 19, scope: !562, inlinedAt: !564)
!579 = !DILocalVariable(name: "len", arg: 2, scope: !580, file: !581, line: 770, type: !9)
!580 = distinct !DILexicalBlock(scope: !582, file: !581, line: 770, column: 1)
!581 = !DIFile(filename: "/rustc/07dca489ac2d933c78d3c5158e3f43beefeb02ce/library/core/src/ptr/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "95c8d74a3967910c36195e9fff1fc1c5")
!582 = distinct !DISubprogram(name: "slice_from_raw_parts<u8>", linkageName: "_ZN4core3ptr20slice_from_raw_parts17h283be407d9197d5eE", scope: !93, file: !581, line: 770, type: !583, scopeLine: 770, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !101, retainedNodes: !589)
!583 = !DISubroutineType(types: !584)
!584 = !{!585, !100, !9}
!585 = !DICompositeType(tag: DW_TAG_structure_type, name: "*const [u8]", file: !2, size: 128, align: 64, elements: !586, templateParams: !23, identifier: "a329dffc2f36de2e98a77091932cf429")
!586 = !{!587, !588}
!587 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !585, file: !2, baseType: !62, size: 64, align: 64)
!588 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !585, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!589 = !{!590, !579, !591, !593}
!590 = !DILocalVariable(name: "data", arg: 1, scope: !580, file: !581, line: 770, type: !100)
!591 = !DILocalVariable(name: "data", arg: 1, scope: !592, file: !581, line: 770, type: !100)
!592 = distinct !DILexicalBlock(scope: !582, file: !581, line: 770, column: 1)
!593 = !DILocalVariable(name: "len", arg: 2, scope: !592, file: !581, line: 770, type: !9)
!594 = !DILocation(line: 770, column: 54, scope: !580, inlinedAt: !595)
!595 = !DILocation(line: 102, column: 11, scope: !566, inlinedAt: !578)
!596 = !DILocalVariable(name: "metadata", arg: 2, scope: !597, file: !598, line: 113, type: !9)
!597 = distinct !DILexicalBlock(scope: !599, file: !598, line: 111, column: 1)
!598 = !DIFile(filename: "/rustc/07dca489ac2d933c78d3c5158e3f43beefeb02ce/library/core/src/ptr/metadata.rs", directory: "", checksumkind: CSK_MD5, checksum: "02a0aa93591cf45ea40bc18b5bf8fc0d")
!599 = distinct !DISubprogram(name: "from_raw_parts<[u8]>", linkageName: "_ZN4core3ptr8metadata14from_raw_parts17hfbd8a2b5ac3614f6E", scope: !600, file: !598, line: 111, type: !601, scopeLine: 111, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !101, retainedNodes: !603)
!600 = !DINamespace(name: "metadata", scope: !93)
!601 = !DISubroutineType(types: !602)
!602 = !{!585, !6, !9}
!603 = !{!604, !596, !605, !607}
!604 = !DILocalVariable(name: "data_address", arg: 1, scope: !597, file: !598, line: 112, type: !6)
!605 = !DILocalVariable(name: "data_address", arg: 1, scope: !606, file: !598, line: 112, type: !6)
!606 = distinct !DILexicalBlock(scope: !599, file: !598, line: 111, column: 1)
!607 = !DILocalVariable(name: "metadata", arg: 2, scope: !606, file: !598, line: 113, type: !9)
!608 = !DILocation(line: 113, column: 5, scope: !597, inlinedAt: !609)
!609 = !DILocation(line: 771, column: 5, scope: !580, inlinedAt: !595)
!610 = !DILocalVariable(name: "count", arg: 2, scope: !611, file: !612, line: 939, type: !9)
!611 = distinct !DILexicalBlock(scope: !613, file: !612, line: 939, column: 5)
!612 = !DIFile(filename: "/rustc/07dca489ac2d933c78d3c5158e3f43beefeb02ce/library/core/src/ptr/const_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "45215b99776792234ff8c1122228ed46")
!613 = distinct !DISubprogram(name: "add<u8>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$3add17hed2ca534bcc96895E", scope: !614, file: !612, line: 939, type: !616, scopeLine: 939, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !101, retainedNodes: !618)
!614 = !DINamespace(name: "{impl#0}", scope: !615)
!615 = !DINamespace(name: "const_ptr", scope: !93)
!616 = !DISubroutineType(types: !617)
!617 = !{!100, !100, !9}
!618 = !{!619, !610}
!619 = !DILocalVariable(name: "self", arg: 1, scope: !611, file: !612, line: 939, type: !100)
!620 = !DILocation(line: 939, column: 35, scope: !611, inlinedAt: !621)
!621 = !DILocation(line: 1966, column: 64, scope: !562, inlinedAt: !564)
!622 = !DILocation(line: 28, column: 29, scope: !469, inlinedAt: !497)
!623 = !DILocation(line: 445, column: 18, scope: !499, inlinedAt: !507)
!624 = !DILocation(line: 237, column: 22, scope: !462)
!625 = !DILocation(line: 1866, column: 27, scope: !538, inlinedAt: !551)
!626 = !DILocation(line: 1952, column: 44, scope: !553, inlinedAt: !564)
!627 = !DILocalVariable(name: "self", arg: 1, scope: !628, file: !539, line: 742, type: !149)
!628 = distinct !DILexicalBlock(scope: !629, file: !539, line: 742, column: 5)
!629 = distinct !DISubprogram(name: "as_ptr<u8>", linkageName: "_ZN4core5slice29_$LT$impl$u20$$u5b$T$u5d$$GT$6as_ptr17hc007be316c7daf71E", scope: !541, file: !539, line: 742, type: !630, scopeLine: 742, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !101, retainedNodes: !632)
!630 = !DISubroutineType(types: !631)
!631 = !{!100, !149}
!632 = !{!627}
!633 = !DILocation(line: 742, column: 25, scope: !628, inlinedAt: !634)
!634 = !DILocation(line: 1958, column: 24, scope: !560, inlinedAt: !564)
!635 = !DILocation(line: 1867, column: 17, scope: !538, inlinedAt: !551)
!636 = !DILocation(line: 1867, column: 9, scope: !538, inlinedAt: !551)
!637 = !DILocation(line: 1957, column: 19, scope: !553, inlinedAt: !564)
!638 = !DILocation(line: 1957, column: 13, scope: !560, inlinedAt: !564)
!639 = !DILocation(line: 743, column: 9, scope: !628, inlinedAt: !634)
!640 = !DILocation(line: 1958, column: 13, scope: !562, inlinedAt: !564)
!641 = !DILocation(line: 94, column: 43, scope: !566, inlinedAt: !578)
!642 = !DILocation(line: 770, column: 38, scope: !580, inlinedAt: !595)
!643 = !DILocalVariable(name: "self", arg: 1, scope: !644, file: !612, line: 60, type: !100)
!644 = distinct !DILexicalBlock(scope: !645, file: !612, line: 60, column: 5)
!645 = distinct !DISubprogram(name: "cast<u8, ()>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$4cast17hdc981ae48bcd831dE", scope: !614, file: !612, line: 60, type: !646, scopeLine: 60, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !651, retainedNodes: !648)
!646 = !DISubroutineType(types: !647)
!647 = !{!6, !100}
!648 = !{!643, !649}
!649 = !DILocalVariable(name: "self", arg: 1, scope: !650, file: !612, line: 60, type: !100)
!650 = distinct !DILexicalBlock(scope: !645, file: !612, line: 60, column: 5)
!651 = !{!102, !652}
!652 = !DITemplateTypeParameter(name: "U", type: !7)
!653 = !DILocation(line: 60, column: 26, scope: !644, inlinedAt: !654)
!654 = !DILocation(line: 771, column: 25, scope: !580, inlinedAt: !595)
!655 = !DILocation(line: 939, column: 29, scope: !611, inlinedAt: !621)
!656 = !DILocation(line: 61, column: 9, scope: !644, inlinedAt: !654)
!657 = !DILocation(line: 112, column: 5, scope: !597, inlinedAt: !609)
!658 = !DILocation(line: 118, column: 36, scope: !597, inlinedAt: !609)
!659 = !DILocation(line: 118, column: 14, scope: !597, inlinedAt: !609)
!660 = !DILocation(line: 237, column: 14, scope: !464)
!661 = !DILocation(line: 944, column: 18, scope: !611, inlinedAt: !621)
!662 = !DILocation(line: 94, column: 43, scope: !575, inlinedAt: !663)
!663 = !DILocation(line: 1966, column: 45, scope: !562, inlinedAt: !564)
!664 = !DILocation(line: 770, column: 38, scope: !592, inlinedAt: !665)
!665 = !DILocation(line: 102, column: 11, scope: !575, inlinedAt: !663)
!666 = !DILocation(line: 60, column: 26, scope: !650, inlinedAt: !667)
!667 = !DILocation(line: 771, column: 25, scope: !592, inlinedAt: !665)
!668 = !DILocation(line: 1966, column: 74, scope: !562, inlinedAt: !564)
!669 = !DILocation(line: 94, column: 59, scope: !575, inlinedAt: !663)
!670 = !DILocation(line: 770, column: 54, scope: !592, inlinedAt: !665)
!671 = !DILocation(line: 113, column: 5, scope: !606, inlinedAt: !672)
!672 = !DILocation(line: 771, column: 5, scope: !592, inlinedAt: !665)
!673 = !DILocation(line: 61, column: 9, scope: !650, inlinedAt: !667)
!674 = !DILocation(line: 112, column: 5, scope: !606, inlinedAt: !672)
!675 = !DILocation(line: 118, column: 36, scope: !606, inlinedAt: !672)
!676 = !DILocation(line: 118, column: 14, scope: !606, inlinedAt: !672)
!677 = !DILocation(line: 237, column: 17, scope: !464)
!678 = !DILocation(line: 242, column: 12, scope: !464)
!679 = !DILocation(line: 243, column: 22, scope: !464)
!680 = !DILocation(line: 446, column: 9, scope: !499, inlinedAt: !507)
!681 = !DILocation(line: 245, column: 13, scope: !464)
!682 = !DILocation(line: 243, column: 13, scope: !464)
!683 = !DILocation(line: 242, column: 9, scope: !464)
!684 = !DILocation(line: 248, column: 9, scope: !464)
!685 = !DILocation(line: 249, column: 9, scope: !464)
!686 = !DILocation(line: 250, column: 6, scope: !369)
!687 = distinct !DISubprogram(name: "lang_start<()>", linkageName: "_ZN3std2rt10lang_start17h6f93945a1883b181E", scope: !16, file: !688, line: 159, type: !689, scopeLine: 159, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !360, retainedNodes: !693)
!688 = !DIFile(filename: "/rustc/07dca489ac2d933c78d3c5158e3f43beefeb02ce/library/std/src/rt.rs", directory: "", checksumkind: CSK_MD5, checksum: "37ab242d99ebf1886f0e7617537b82aa")
!689 = !DISubroutineType(types: !690)
!690 = !{!691, !20, !691, !692, !33}
!691 = !DIBasicType(name: "isize", size: 64, encoding: DW_ATE_signed)
!692 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const *const u8", baseType: !100, size: 64, align: 64, dwarfAddressSpace: 0)
!693 = !{!694, !695, !696, !697, !698}
!694 = !DILocalVariable(name: "main", arg: 1, scope: !687, file: !688, line: 160, type: !20)
!695 = !DILocalVariable(name: "argc", arg: 2, scope: !687, file: !688, line: 161, type: !691)
!696 = !DILocalVariable(name: "argv", arg: 3, scope: !687, file: !688, line: 162, type: !692)
!697 = !DILocalVariable(name: "sigpipe", arg: 4, scope: !687, file: !688, line: 163, type: !33)
!698 = !DILocalVariable(name: "v", scope: !699, file: !688, line: 165, type: !691, align: 8)
!699 = distinct !DILexicalBlock(scope: !687, file: !688, line: 165, column: 5)
!700 = !DILocation(line: 160, column: 5, scope: !687)
!701 = !DILocation(line: 161, column: 5, scope: !687)
!702 = !DILocation(line: 162, column: 5, scope: !687)
!703 = !DILocation(line: 163, column: 5, scope: !687)
!704 = !DILocation(line: 166, column: 10, scope: !687)
!705 = !DILocation(line: 165, column: 17, scope: !687)
!706 = !DILocation(line: 165, column: 12, scope: !687)
!707 = !DILocation(line: 165, column: 12, scope: !699)
!708 = !DILocation(line: 172, column: 2, scope: !687)
!709 = distinct !DISubprogram(name: "{closure#0}<()>", linkageName: "_ZN3std2rt10lang_start28_$u7b$$u7b$closure$u7d$$u7d$17h14e6735284a1df53E", scope: !15, file: !688, line: 166, type: !710, scopeLine: 166, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !360, retainedNodes: !713)
!710 = !DISubroutineType(types: !711)
!711 = !{!409, !712}
!712 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::rt::lang_start::{closure_env#0}<()>", baseType: !14, size: 64, align: 64, dwarfAddressSpace: 0)
!713 = !{!714}
!714 = !DILocalVariable(name: "main", scope: !709, file: !688, line: 160, type: !20, align: 8)
!715 = !DILocation(line: 160, column: 5, scope: !709)
!716 = !DILocalVariable(name: "self", arg: 1, scope: !717, file: !718, line: 1958, type: !720)
!717 = distinct !DILexicalBlock(scope: !719, file: !718, line: 1958, column: 5)
!718 = !DIFile(filename: "/rustc/07dca489ac2d933c78d3c5158e3f43beefeb02ce/library/std/src/process.rs", directory: "", checksumkind: CSK_MD5, checksum: "4237b9da5f67550242d4bb113252837f")
!719 = distinct !DISubprogram(name: "to_i32", linkageName: "_ZN3std7process8ExitCode6to_i3217h263052bed0320da5E", scope: !720, file: !718, line: 1958, type: !731, scopeLine: 1958, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !23, declaration: !733, retainedNodes: !734)
!720 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExitCode", scope: !721, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !722, templateParams: !23, identifier: "9af09427e26754f4ebd62769cb29e948")
!721 = !DINamespace(name: "process", scope: !17)
!722 = !{!723}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !720, file: !2, baseType: !724, size: 8, align: 8, flags: DIFlagPrivate)
!724 = !DICompositeType(tag: DW_TAG_structure_type, name: "ExitCode", scope: !725, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !729, templateParams: !23, identifier: "d2785035c20c4a90b21beb6ab007b60b")
!725 = !DINamespace(name: "process_common", scope: !726)
!726 = !DINamespace(name: "process", scope: !727)
!727 = !DINamespace(name: "unix", scope: !728)
!728 = !DINamespace(name: "sys", scope: !17)
!729 = !{!730}
!730 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !724, file: !2, baseType: !33, size: 8, align: 8, flags: DIFlagPrivate)
!731 = !DISubroutineType(types: !732)
!732 = !{!409, !720}
!733 = !DISubprogram(name: "to_i32", linkageName: "_ZN3std7process8ExitCode6to_i3217h263052bed0320da5E", scope: !720, file: !718, line: 1958, type: !731, scopeLine: 1958, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !23)
!734 = !{!716}
!735 = !DILocation(line: 1958, column: 19, scope: !717, inlinedAt: !736)
!736 = !DILocation(line: 166, column: 92, scope: !709)
!737 = !DILocation(line: 166, column: 77, scope: !709)
!738 = !DILocation(line: 166, column: 18, scope: !709)
!739 = !DILocation(line: 1959, column: 9, scope: !717, inlinedAt: !736)
!740 = !DILocalVariable(name: "self", arg: 1, scope: !741, file: !742, line: 638, type: !746)
!741 = distinct !DILexicalBlock(scope: !743, file: !742, line: 638, column: 5)
!742 = !DIFile(filename: "/rustc/07dca489ac2d933c78d3c5158e3f43beefeb02ce/library/std/src/sys/unix/process/process_common.rs", directory: "", checksumkind: CSK_MD5, checksum: "4680747caf523eeb22777b3df0db2e9b")
!743 = distinct !DISubprogram(name: "as_i32", linkageName: "_ZN3std3sys4unix7process14process_common8ExitCode6as_i3217h31b2b1512d850fb9E", scope: !724, file: !742, line: 638, type: !744, scopeLine: 638, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !23, declaration: !747, retainedNodes: !748)
!744 = !DISubroutineType(types: !745)
!745 = !{!409, !746}
!746 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::sys::unix::process::process_common::ExitCode", baseType: !724, size: 64, align: 64, dwarfAddressSpace: 0)
!747 = !DISubprogram(name: "as_i32", linkageName: "_ZN3std3sys4unix7process14process_common8ExitCode6as_i3217h31b2b1512d850fb9E", scope: !724, file: !742, line: 638, type: !744, scopeLine: 638, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !23)
!748 = !{!740}
!749 = !DILocation(line: 638, column: 19, scope: !741, inlinedAt: !750)
!750 = !DILocation(line: 1959, column: 16, scope: !717, inlinedAt: !736)
!751 = !DILocation(line: 639, column: 9, scope: !741, inlinedAt: !750)
!752 = !DILocation(line: 166, column: 100, scope: !709)
!753 = distinct !DISubprogram(name: "fmt<core::str::error::Utf8Error>", linkageName: "_ZN42_$LT$$RF$T$u20$as$u20$core..fmt..Debug$GT$3fmt17hcd6242b8dec4a517E", scope: !755, file: !754, line: 2294, type: !756, scopeLine: 2294, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !805, retainedNodes: !802)
!754 = !DIFile(filename: "/rustc/07dca489ac2d933c78d3c5158e3f43beefeb02ce/library/core/src/fmt/mod.rs", directory: "", checksumkind: CSK_MD5, checksum: "f2f9e528240e472a11f8ea13e1ff6e2a")
!755 = !DINamespace(name: "{impl#53}", scope: !259)
!756 = !DISubroutineType(types: !757)
!757 = !{!758, !774, !775}
!758 = !DICompositeType(tag: DW_TAG_structure_type, name: "Result<(), core::fmt::Error>", scope: !376, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !759, templateParams: !23, identifier: "6f12e79a25707103db5dd031aa6f5dd6")
!759 = !{!760}
!760 = !DICompositeType(tag: DW_TAG_variant_part, scope: !758, file: !2, size: 8, align: 8, elements: !761, templateParams: !23, identifier: "d18112441fefba8c6a2fcf108021498c", discriminator: !773)
!761 = !{!762, !769}
!762 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !760, file: !2, baseType: !763, size: 8, align: 8, extraData: i128 0)
!763 = !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !758, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !764, templateParams: !766, identifier: "531d21c9c5ee326fa482153f3e065f3")
!764 = !{!765}
!765 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !763, file: !2, baseType: !7, align: 8, offset: 8, flags: DIFlagPublic)
!766 = !{!351, !767}
!767 = !DITemplateTypeParameter(name: "E", type: !768)
!768 = !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !259, file: !2, align: 8, flags: DIFlagPublic, elements: !23, identifier: "e10d5ec44c311877d081d9c17aa8c322")
!769 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !760, file: !2, baseType: !770, size: 8, align: 8, extraData: i128 1)
!770 = !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !758, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !771, templateParams: !766, identifier: "7a86e30a05bb284293c1fc17765b863d")
!771 = !{!772}
!772 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !770, file: !2, baseType: !768, align: 8, offset: 8, flags: DIFlagPublic)
!773 = !DIDerivedType(tag: DW_TAG_member, scope: !758, file: !2, baseType: !33, size: 8, align: 8, flags: DIFlagArtificial)
!774 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&&core::str::error::Utf8Error", baseType: !202, size: 64, align: 64, dwarfAddressSpace: 0)
!775 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::Formatter", baseType: !776, size: 64, align: 64, dwarfAddressSpace: 0)
!776 = !DICompositeType(tag: DW_TAG_structure_type, name: "Formatter", scope: !259, file: !2, size: 512, align: 64, flags: DIFlagPublic, elements: !777, templateParams: !23, identifier: "f7daf8d9160913997f5700b9e4ab7a31")
!777 = !{!778, !779, !781, !782, !794, !795}
!778 = !DIDerivedType(tag: DW_TAG_member, name: "flags", scope: !776, file: !2, baseType: !47, size: 32, align: 32, offset: 416, flags: DIFlagPrivate)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "fill", scope: !776, file: !2, baseType: !780, size: 32, align: 32, offset: 384, flags: DIFlagPrivate)
!780 = !DIBasicType(name: "char", size: 32, encoding: DW_ATE_UTF)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !776, file: !2, baseType: !257, size: 8, align: 8, offset: 448, flags: DIFlagPrivate)
!782 = !DIDerivedType(tag: DW_TAG_member, name: "width", scope: !776, file: !2, baseType: !783, size: 128, align: 64, flags: DIFlagPrivate)
!783 = !DICompositeType(tag: DW_TAG_structure_type, name: "Option<usize>", scope: !50, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !784, templateParams: !23, identifier: "f0e780944e16bafaa72e874fd1f5912c")
!784 = !{!785}
!785 = !DICompositeType(tag: DW_TAG_variant_part, scope: !783, file: !2, size: 128, align: 64, elements: !786, templateParams: !23, identifier: "40a75e1404fd08ff6fe3d12b25ea6875", discriminator: !793)
!786 = !{!787, !789}
!787 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !785, file: !2, baseType: !788, size: 128, align: 64, extraData: i128 0)
!788 = !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !783, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !23, templateParams: !518, identifier: "3fa5987ae64a6035452637c0922a233d")
!789 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !785, file: !2, baseType: !790, size: 128, align: 64, extraData: i128 1)
!790 = !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !783, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !791, templateParams: !518, identifier: "e2aeb7ac6ed3bc0c1bc84e3e1ccf80d6")
!791 = !{!792}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !790, file: !2, baseType: !9, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!793 = !DIDerivedType(tag: DW_TAG_member, scope: !783, file: !2, baseType: !69, size: 64, align: 64, flags: DIFlagArtificial)
!794 = !DIDerivedType(tag: DW_TAG_member, name: "precision", scope: !776, file: !2, baseType: !783, size: 128, align: 64, offset: 128, flags: DIFlagPrivate)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !776, file: !2, baseType: !796, size: 128, align: 64, offset: 256, flags: DIFlagPrivate)
!796 = !DICompositeType(tag: DW_TAG_structure_type, name: "&mut dyn core::fmt::Write", file: !2, size: 128, align: 64, elements: !797, templateParams: !23, identifier: "767f5245ba39fca4d2293b5cf1f4529b")
!797 = !{!798, !801}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !796, file: !2, baseType: !799, size: 64, align: 64)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64, align: 64, dwarfAddressSpace: 0)
!800 = !DICompositeType(tag: DW_TAG_structure_type, name: "dyn core::fmt::Write", file: !2, align: 8, elements: !23, identifier: "dadf3ef315b9c09bb2f0a1665b1b54d4")
!801 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !796, file: !2, baseType: !423, size: 64, align: 64, offset: 64)
!802 = !{!803, !804}
!803 = !DILocalVariable(name: "self", arg: 1, scope: !753, file: !754, line: 2294, type: !774)
!804 = !DILocalVariable(name: "f", arg: 2, scope: !753, file: !754, line: 2294, type: !775)
!805 = !{!806}
!806 = !DITemplateTypeParameter(name: "T", type: !117)
!807 = !DILocation(line: 2294, column: 20, scope: !753)
!808 = !DILocation(line: 2294, column: 27, scope: !753)
!809 = !DILocation(line: 2294, column: 71, scope: !753)
!810 = !{i64 8}
!811 = !DILocation(line: 2294, column: 62, scope: !753)
!812 = !DILocation(line: 2294, column: 84, scope: !753)
!813 = distinct !DISubprogram(name: "fmt<u8>", linkageName: "_ZN48_$LT$$u5b$T$u5d$$u20$as$u20$core..fmt..Debug$GT$3fmt17hebe1025a4c25760cE", scope: !814, file: !754, line: 2521, type: !815, scopeLine: 2521, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !101, retainedNodes: !817)
!814 = !DINamespace(name: "{impl#24}", scope: !259)
!815 = !DISubroutineType(types: !816)
!816 = !{!758, !149, !775}
!817 = !{!818, !819}
!818 = !DILocalVariable(name: "self", arg: 1, scope: !813, file: !754, line: 2521, type: !149)
!819 = !DILocalVariable(name: "f", arg: 2, scope: !813, file: !754, line: 2521, type: !775)
!820 = !DILocation(line: 2521, column: 12, scope: !813)
!821 = !DILocalVariable(name: "self", arg: 1, scope: !822, file: !539, line: 1009, type: !149)
!822 = distinct !DILexicalBlock(scope: !823, file: !539, line: 1009, column: 5)
!823 = distinct !DISubprogram(name: "iter<u8>", linkageName: "_ZN4core5slice29_$LT$impl$u20$$u5b$T$u5d$$GT$4iter17h81d2d83c3b01ed17E", scope: !541, file: !539, line: 1009, type: !824, scopeLine: 1009, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !101, retainedNodes: !835)
!824 = !DISubroutineType(types: !825)
!825 = !{!826, !149}
!826 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iter<u8>", scope: !827, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !828, templateParams: !101, identifier: "e7159dfc1007f2b0cb65bd4bd6118129")
!827 = !DINamespace(name: "iter", scope: !474)
!828 = !{!829, !830, !831}
!829 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !826, file: !2, baseType: !96, size: 64, align: 64, flags: DIFlagPrivate)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "end_or_len", scope: !826, file: !2, baseType: !100, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!831 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !826, file: !2, baseType: !832, align: 8, offset: 128, flags: DIFlagPrivate)
!832 = !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<&u8>", scope: !105, file: !2, align: 8, flags: DIFlagPublic, elements: !23, templateParams: !833, identifier: "5af6e75e8d56776d21990cefba669343")
!833 = !{!834}
!834 = !DITemplateTypeParameter(name: "T", type: !32)
!835 = !{!821}
!836 = !DILocation(line: 1009, column: 17, scope: !822, inlinedAt: !837)
!837 = !DILocation(line: 2522, column: 37, scope: !813)
!838 = !DILocalVariable(name: "slice", arg: 1, scope: !839, file: !840, line: 90, type: !149)
!839 = distinct !DILexicalBlock(scope: !841, file: !840, line: 90, column: 5)
!840 = !DIFile(filename: "/rustc/07dca489ac2d933c78d3c5158e3f43beefeb02ce/library/core/src/slice/iter.rs", directory: "", checksumkind: CSK_MD5, checksum: "d4ea0af1af681752798ed14df75d03d0")
!841 = distinct !DISubprogram(name: "new<u8>", linkageName: "_ZN4core5slice4iter13Iter$LT$T$GT$3new17hfb288aa6bf2c737bE", scope: !826, file: !840, line: 90, type: !824, scopeLine: 90, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !101, declaration: !842, retainedNodes: !843)
!842 = !DISubprogram(name: "new<u8>", linkageName: "_ZN4core5slice4iter13Iter$LT$T$GT$3new17hfb288aa6bf2c737bE", scope: !826, file: !840, line: 90, type: !824, scopeLine: 90, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !101)
!843 = !{!838, !844, !846}
!844 = !DILocalVariable(name: "ptr", scope: !845, file: !840, line: 91, type: !100, align: 8)
!845 = distinct !DILexicalBlock(scope: !839, file: !840, line: 91, column: 9)
!846 = !DILocalVariable(name: "end_or_len", scope: !847, file: !840, line: 94, type: !100, align: 8)
!847 = distinct !DILexicalBlock(scope: !845, file: !840, line: 94, column: 13)
!848 = !DILocation(line: 90, column: 23, scope: !839, inlinedAt: !849)
!849 = !DILocation(line: 1010, column: 9, scope: !822, inlinedAt: !837)
!850 = !DILocalVariable(name: "self", arg: 1, scope: !851, file: !539, line: 742, type: !149)
!851 = distinct !DILexicalBlock(scope: !852, file: !539, line: 742, column: 5)
!852 = distinct !DISubprogram(name: "as_ptr<u8>", linkageName: "_ZN4core5slice29_$LT$impl$u20$$u5b$T$u5d$$GT$6as_ptr17hc007be316c7daf71E", scope: !541, file: !539, line: 742, type: !630, scopeLine: 742, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !101, retainedNodes: !853)
!853 = !{!850}
!854 = !DILocation(line: 742, column: 25, scope: !851, inlinedAt: !855)
!855 = !DILocation(line: 91, column: 25, scope: !839, inlinedAt: !849)
!856 = !DILocation(line: 2521, column: 19, scope: !813)
!857 = !DILocation(line: 94, column: 17, scope: !847, inlinedAt: !849)
!858 = !DILocation(line: 2522, column: 9, scope: !813)
!859 = !DILocation(line: 743, column: 9, scope: !851, inlinedAt: !855)
!860 = !DILocation(line: 91, column: 13, scope: !845, inlinedAt: !849)
!861 = !DILocalVariable(name: "self", arg: 1, scope: !862, file: !612, line: 939, type: !100)
!862 = distinct !DILexicalBlock(scope: !863, file: !612, line: 939, column: 5)
!863 = distinct !DISubprogram(name: "add<u8>", linkageName: "_ZN4core3ptr9const_ptr33_$LT$impl$u20$$BP$const$u20$T$GT$3add17hed2ca534bcc96895E", scope: !614, file: !612, line: 939, type: !616, scopeLine: 939, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !101, retainedNodes: !864)
!864 = !{!861, !865}
!865 = !DILocalVariable(name: "count", arg: 2, scope: !862, file: !612, line: 939, type: !9)
!866 = !DILocation(line: 939, column: 29, scope: !862, inlinedAt: !867)
!867 = !DILocation(line: 94, column: 79, scope: !845, inlinedAt: !849)
!868 = !DILocation(line: 94, column: 33, scope: !845, inlinedAt: !849)
!869 = !DILocation(line: 94, column: 83, scope: !845, inlinedAt: !849)
!870 = !DILocation(line: 939, column: 35, scope: !862, inlinedAt: !867)
!871 = !DILocation(line: 944, column: 18, scope: !862, inlinedAt: !867)
!872 = !DILocation(line: 94, column: 30, scope: !845, inlinedAt: !849)
!873 = !DILocation(line: 94, column: 53, scope: !845, inlinedAt: !849)
!874 = !DILocalVariable(name: "addr", arg: 1, scope: !875, file: !581, line: 589, type: !9)
!875 = distinct !DILexicalBlock(scope: !876, file: !581, line: 589, column: 1)
!876 = distinct !DISubprogram(name: "invalid<u8>", linkageName: "_ZN4core3ptr7invalid17hf018c203ac259c16E", scope: !93, file: !581, line: 589, type: !877, scopeLine: 589, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !101, retainedNodes: !879)
!877 = !DISubroutineType(types: !878)
!878 = !{!100, !9}
!879 = !{!874}
!880 = !DILocation(line: 589, column: 25, scope: !875, inlinedAt: !881)
!881 = !DILocation(line: 94, column: 45, scope: !845, inlinedAt: !849)
!882 = !DILocation(line: 595, column: 14, scope: !875, inlinedAt: !881)
!883 = !DILocation(line: 96, column: 48, scope: !847, inlinedAt: !849)
!884 = !DILocalVariable(name: "ptr", arg: 1, scope: !885, file: !886, line: 218, type: !890)
!885 = distinct !DILexicalBlock(scope: !887, file: !886, line: 218, column: 5)
!886 = !DIFile(filename: "/rustc/07dca489ac2d933c78d3c5158e3f43beefeb02ce/library/core/src/ptr/non_null.rs", directory: "", checksumkind: CSK_MD5, checksum: "66152698a4175681ccd7bfeaa6d9ef9a")
!887 = distinct !DISubprogram(name: "new_unchecked<u8>", linkageName: "_ZN4core3ptr8non_null16NonNull$LT$T$GT$13new_unchecked17h5f65720458647173E", scope: !96, file: !886, line: 218, type: !888, scopeLine: 218, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !101, declaration: !891, retainedNodes: !892)
!888 = !DISubroutineType(types: !889)
!889 = !{!96, !890}
!890 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut u8", baseType: !33, size: 64, align: 64, dwarfAddressSpace: 0)
!891 = !DISubprogram(name: "new_unchecked<u8>", linkageName: "_ZN4core3ptr8non_null16NonNull$LT$T$GT$13new_unchecked17h5f65720458647173E", scope: !96, file: !886, line: 218, type: !888, scopeLine: 218, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !101)
!892 = !{!884}
!893 = !DILocation(line: 218, column: 39, scope: !885, inlinedAt: !894)
!894 = !DILocation(line: 96, column: 25, scope: !847, inlinedAt: !849)
!895 = !DILocalVariable(name: "ptr", arg: 1, scope: !896, file: !886, line: 221, type: !890)
!896 = !DILexicalBlockFile(scope: !897, file: !886, discriminator: 0)
!897 = distinct !DILexicalBlock(scope: !899, file: !898, line: 2542, column: 13)
!898 = !DIFile(filename: "/rustc/07dca489ac2d933c78d3c5158e3f43beefeb02ce/library/core/src/intrinsics.rs", directory: "", checksumkind: CSK_MD5, checksum: "cce44e2a04c587bcf8c6286ed2962b67")
!899 = distinct !DISubprogram(name: "runtime<u8>", linkageName: "_ZN4core3ptr8non_null16NonNull$LT$T$GT$13new_unchecked7runtime17h25bb6c71e9ff8745E", scope: !900, file: !898, line: 2542, type: !902, scopeLine: 2542, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !101, retainedNodes: !904)
!900 = !DINamespace(name: "new_unchecked", scope: !901)
!901 = !DINamespace(name: "{impl#3}", scope: !97)
!902 = !DISubroutineType(types: !903)
!903 = !{null, !890}
!904 = !{!895}
!905 = !DILocation(line: 221, column: 13, scope: !896, inlinedAt: !906)
!906 = !DILocation(line: 2554, column: 13, scope: !907, inlinedAt: !894)
!907 = !DILexicalBlockFile(scope: !885, file: !898, discriminator: 0)
!908 = !DILocalVariable(name: "self", arg: 1, scope: !909, file: !910, line: 35, type: !890)
!909 = distinct !DILexicalBlock(scope: !911, file: !910, line: 35, column: 5)
!910 = !DIFile(filename: "/rustc/07dca489ac2d933c78d3c5158e3f43beefeb02ce/library/core/src/ptr/mut_ptr.rs", directory: "", checksumkind: CSK_MD5, checksum: "daec221a509278be5916b7c97356b97b")
!911 = distinct !DISubprogram(name: "is_null<u8>", linkageName: "_ZN4core3ptr7mut_ptr31_$LT$impl$u20$$BP$mut$u20$T$GT$7is_null17hb34e0029b4242663E", scope: !912, file: !910, line: 35, type: !914, scopeLine: 35, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !101, retainedNodes: !917)
!912 = !DINamespace(name: "{impl#0}", scope: !913)
!913 = !DINamespace(name: "mut_ptr", scope: !93)
!914 = !DISubroutineType(types: !915)
!915 = !{!916, !890}
!916 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!917 = !{!908}
!918 = !DILocation(line: 35, column: 26, scope: !909, inlinedAt: !919)
!919 = !DILocation(line: 221, column: 138, scope: !896, inlinedAt: !906)
!920 = !DILocation(line: 222, column: 13, scope: !885, inlinedAt: !894)
!921 = !DILocation(line: 96, column: 64, scope: !847, inlinedAt: !849)
!922 = !DILocation(line: 96, column: 13, scope: !847, inlinedAt: !849)
!923 = !DILocation(line: 2523, column: 6, scope: !813)
!924 = distinct !DISubprogram(name: "fmt", linkageName: "_ZN4core3fmt3num52_$LT$impl$u20$core..fmt..Debug$u20$for$u20$usize$GT$3fmt17h262f68462e93b67eE", scope: !926, file: !925, line: 189, type: !928, scopeLine: 189, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !23, retainedNodes: !931)
!925 = !DIFile(filename: "/rustc/07dca489ac2d933c78d3c5158e3f43beefeb02ce/library/core/src/fmt/num.rs", directory: "", checksumkind: CSK_MD5, checksum: "e54845ef989d12b8a79056a0477bb701")
!926 = !DINamespace(name: "{impl#89}", scope: !927)
!927 = !DINamespace(name: "num", scope: !259)
!928 = !DISubroutineType(types: !929)
!929 = !{!758, !930, !775}
!930 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&usize", baseType: !9, size: 64, align: 64, dwarfAddressSpace: 0)
!931 = !{!932, !933}
!932 = !DILocalVariable(name: "self", arg: 1, scope: !924, file: !925, line: 189, type: !930)
!933 = !DILocalVariable(name: "f", arg: 2, scope: !924, file: !925, line: 189, type: !775)
!934 = !DILocation(line: 189, column: 20, scope: !924)
!935 = !DILocation(line: 189, column: 27, scope: !924)
!936 = !DILocalVariable(name: "self", arg: 1, scope: !937, file: !754, line: 1852, type: !775)
!937 = distinct !DILexicalBlock(scope: !938, file: !754, line: 1852, column: 5)
!938 = distinct !DISubprogram(name: "debug_lower_hex", linkageName: "_ZN4core3fmt9Formatter15debug_lower_hex17h4e3ca91fbd9732e6E", scope: !776, file: !754, line: 1852, type: !939, scopeLine: 1852, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !23, declaration: !942, retainedNodes: !943)
!939 = !DISubroutineType(types: !940)
!940 = !{!916, !941}
!941 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&core::fmt::Formatter", baseType: !776, size: 64, align: 64, dwarfAddressSpace: 0)
!942 = !DISubprogram(name: "debug_lower_hex", linkageName: "_ZN4core3fmt9Formatter15debug_lower_hex17h4e3ca91fbd9732e6E", scope: !776, file: !754, line: 1852, type: !939, scopeLine: 1852, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !23)
!943 = !{!936}
!944 = !DILocation(line: 1852, column: 24, scope: !937, inlinedAt: !945)
!945 = !DILocation(line: 190, column: 22, scope: !924)
!946 = !DILocalVariable(name: "self", arg: 1, scope: !947, file: !754, line: 1856, type: !775)
!947 = distinct !DILexicalBlock(scope: !948, file: !754, line: 1856, column: 5)
!948 = distinct !DISubprogram(name: "debug_upper_hex", linkageName: "_ZN4core3fmt9Formatter15debug_upper_hex17h63d9c6085c110bccE", scope: !776, file: !754, line: 1856, type: !939, scopeLine: 1856, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !23, declaration: !949, retainedNodes: !950)
!949 = !DISubprogram(name: "debug_upper_hex", linkageName: "_ZN4core3fmt9Formatter15debug_upper_hex17h63d9c6085c110bccE", scope: !776, file: !754, line: 1856, type: !939, scopeLine: 1856, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !23)
!950 = !{!946}
!951 = !DILocation(line: 1856, column: 24, scope: !947, inlinedAt: !952)
!952 = !DILocation(line: 192, column: 29, scope: !924)
!953 = !DILocation(line: 1853, column: 9, scope: !937, inlinedAt: !945)
!954 = !DILocation(line: 190, column: 20, scope: !924)
!955 = !DILocation(line: 1857, column: 9, scope: !947, inlinedAt: !952)
!956 = !DILocation(line: 192, column: 27, scope: !924)
!957 = !DILocation(line: 191, column: 21, scope: !924)
!958 = !DILocation(line: 195, column: 21, scope: !924)
!959 = !DILocation(line: 193, column: 21, scope: !924)
!960 = !DILocation(line: 197, column: 14, scope: !924)
!961 = !{i8 0, i8 2}
!962 = distinct !DISubprogram(name: "entries<&u8, core::slice::iter::Iter<u8>>", linkageName: "_ZN4core3fmt8builders9DebugList7entries17hf4b8df9cb0866934E", scope: !964, file: !963, line: 689, type: !973, scopeLine: 689, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !209, templateParams: !977, declaration: !976, retainedNodes: !980)
!963 = !DIFile(filename: "/rustc/07dca489ac2d933c78d3c5158e3f43beefeb02ce/library/core/src/fmt/builders.rs", directory: "", checksumkind: CSK_MD5, checksum: "e001ddbb6a5d5667cffdfcedcee2dd35")
!964 = !DICompositeType(tag: DW_TAG_structure_type, name: "DebugList", scope: !965, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !966, templateParams: !23, identifier: "7633c8eb4e6ef533ceb84dd9b8b1e6fe")
!965 = !DINamespace(name: "builders", scope: !259)
!966 = !{!967}
!967 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !964, file: !2, baseType: !968, size: 128, align: 64, flags: DIFlagPrivate)
!968 = !DICompositeType(tag: DW_TAG_structure_type, name: "DebugInner", scope: !965, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !969, templateParams: !23, identifier: "b050a03ccab266538b1e5cd1ef67192c")
!969 = !{!970, !971, !972}
!970 = !DIDerivedType(tag: DW_TAG_member, name: "fmt", scope: !968, file: !2, baseType: !775, size: 64, align: 64, flags: DIFlagPrivate)
!971 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !968, file: !2, baseType: !758, size: 8, align: 8, offset: 64, flags: DIFlagPrivate)
!972 = !DIDerivedType(tag: DW_TAG_member, name: "has_fields", scope: !968, file: !2, baseType: !916, size: 8, align: 8, offset: 72, flags: DIFlagPrivate)
!973 = !DISubroutineType(types: !974)
!974 = !{!975, !975, !826}
!975 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&mut core::fmt::builders::DebugList", baseType: !964, size: 64, align: 64, dwarfAddressSpace: 0)
!976 = !DISubprogram(name: "entries<&u8, core::slice::iter::Iter<u8>>", linkageName: "_ZN4core3fmt8builders9DebugList7entries17hf4b8df9cb0866934E", scope: !964, file: !963, line: 689, type: !973, scopeLine: 689, flags: DIFlagPrototyped, spFlags: DISPFlagLocalToUnit, templateParams: !977)
!977 = !{!978, !979}
!978 = !DITemplateTypeParameter(name: "D", type: !32)
!979 = !DITemplateTypeParameter(name: "I", type: !826)
!980 = !{!981, !982, !983, !985}
!981 = !DILocalVariable(name: "self", arg: 1, scope: !962, file: !963, line: 689, type: !975)
!982 = !DILocalVariable(name: "entries", arg: 2, scope: !962, file: !963, line: 689, type: !826)
!983 = !DILocalVariable(name: "iter", scope: !984, file: !963, line: 694, type: !826, align: 8)
!984 = distinct !DILexicalBlock(scope: !962, file: !963, line: 694, column: 9)
!985 = !DILocalVariable(name: "entry", scope: !986, file: !963, line: 694, type: !32, align: 8)
!986 = distinct !DILexicalBlock(scope: !984, file: !963, line: 694, column: 30)
!987 = !DILocation(line: 689, column: 26, scope: !962)
!988 = !DILocation(line: 689, column: 37, scope: !962)
!989 = !DILocation(line: 694, column: 22, scope: !984)
!990 = !DILocation(line: 694, column: 13, scope: !986)
!991 = !DILocation(line: 694, column: 22, scope: !962)
!992 = !DILocation(line: 694, column: 9, scope: !984)
!993 = !DILocation(line: 689, column: 5, scope: !962)
!994 = !DILocation(line: 698, column: 6, scope: !962)
!995 = !DILocation(line: 694, column: 13, scope: !984)
