; ModuleID = 'gomodule'
source_filename = "gomodule"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

module asm "\09.section \22.go_export\22,\22e\22,@progbits"
module asm "\09.ascii \22v3;\\n\22"
module asm "\09.ascii \22package \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22pkgpath \22"
module asm "\09.ascii \22main\22"
module asm "\09.ascii \22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22bytes\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22base64\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22encoding/base64\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22encoding/base64\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22json\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22encoding/json\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22encoding/json\22"
module asm "\09.ascii \22\\\22\\n\22"
module asm "\09.ascii \22import \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \22"
module asm "\09.ascii \22fmt\22"
module asm "\09.ascii \22 \\\22\22"
module asm "\09.ascii \22fmt\22"

!0 = !{i32 7, !"PIC Level", i32 0}
!1 = !{i32 2, !"Debug Info Version", i32 3}
!2 = !{i32 2, !"Dwarf Version", i32 4}
!3 = distinct !DICompileUnit(language: DW_LANG_Go, file: !4, producer: "llvm-goc", isOptimized: true, runtimeVersion: 0, emissionKind: FullDebug, globals: !5)
!4 = !DIFile(filename: "caller.go", directory: "/proj/zyuxuanssf-PG0/faas-test/merge_func/merge-go-and-c/example/caller")
!5 = !{!6, !73, !85, !87, !103, !114, !116, !118, !120, !122, !124, !126, !128, !130, !132, !134, !136, !138, !140, !142, !144, !146, !148, !150, !152, !154, !156, !158, !160, !162, !164, !166, !168, !170, !172, !174, !176, !178, !180, !182, !184, !186, !188, !190, !192, !194, !196, !198, !200, !202, !204, !206, !208, !210, !212, !214, !216, !218, !220, !222, !224, !226, !228, !230, !232, !234, !236, !238, !240, !242, !244, !246, !248, !250, !252, !254, !256, !258, !260, !262, !264, !266, !268, !270, !272, !274, !276, !278, !280, !282, !284, !286, !288, !290, !292, !294, !296, !298, !300, !302, !304, !306, !308, !310, !312, !314, !316, !318, !320, !322, !324, !326, !328, !330, !332, !334, !336, !338, !340, !342, !344, !346, !348}
!6 = !DIGlobalVariableExpression(var: !7, expr: !DIExpression())
!7 = distinct !DIGlobalVariable(name: "os.Stdin", linkageName: "os.Stdin", scope: !3, file: !8, line: 5, type: !9, isLocal: false, isDefinition: true)
!8 = !DIFile(filename: "caller.go", directory: "")
!9 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !10, size: 64)
!10 = !DICompositeType(tag: DW_TAG_structure_type, name: "File", file: !8, line: 5, size: 64, align: 8, elements: !11)
!11 = !{!12}
!12 = !DIDerivedType(tag: DW_TAG_member, name: "file", file: !8, line: 5, baseType: !13, size: 64, align: 64)
!13 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !14, size: 64)
!14 = !DICompositeType(tag: DW_TAG_structure_type, name: ".os.file", file: !8, line: 5, size: 704, align: 8, elements: !15)
!15 = !{!16, !56, !62, !70, !71, !72}
!16 = !DIDerivedType(tag: DW_TAG_member, name: "pfd", file: !8, line: 5, baseType: !17, size: 448, align: 64)
!17 = !DICompositeType(tag: DW_TAG_structure_type, name: "FD", file: !8, line: 5, size: 448, align: 8, elements: !18)
!18 = !{!19, !27, !29, !34, !50, !51, !52, !54, !55}
!19 = !DIDerivedType(tag: DW_TAG_member, name: "fdmu", file: !8, line: 5, baseType: !20, size: 128, align: 64)
!20 = !DICompositeType(tag: DW_TAG_structure_type, name: ".internal/poll.fdMutex", file: !8, line: 5, size: 128, align: 8, elements: !21)
!21 = !{!22, !24, !26}
!22 = !DIDerivedType(tag: DW_TAG_member, name: "state", file: !8, line: 5, baseType: !23, size: 64, align: 64)
!23 = !DIBasicType(name: "uint64", size: 64, encoding: DW_ATE_unsigned)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "rsema", file: !8, line: 5, baseType: !25, size: 32, align: 32, offset: 64)
!25 = !DIBasicType(name: "uint32", size: 32, encoding: DW_ATE_unsigned)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "wsema", file: !8, line: 5, baseType: !25, size: 32, align: 32, offset: 96)
!27 = !DIDerivedType(tag: DW_TAG_member, name: "Sysfd", file: !8, line: 5, baseType: !28, size: 64, align: 64, offset: 128)
!28 = !DIBasicType(name: "int", size: 64, encoding: DW_ATE_signed)
!29 = !DIDerivedType(tag: DW_TAG_member, name: "pd", file: !8, line: 5, baseType: !30, size: 64, align: 64, offset: 192)
!30 = !DICompositeType(tag: DW_TAG_structure_type, name: ".internal/poll.pollDesc", file: !8, line: 5, size: 64, align: 8, elements: !31)
!31 = !{!32}
!32 = !DIDerivedType(tag: DW_TAG_member, name: "runtimeCtx", file: !8, line: 5, baseType: !33, size: 64, align: 64)
!33 = !DIBasicType(name: "uintptr", size: 64, encoding: DW_ATE_unsigned)
!34 = !DIDerivedType(tag: DW_TAG_member, name: "iovecs", file: !8, line: 5, baseType: !35, size: 64, align: 64, offset: 256)
!35 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !36, size: 64)
!36 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Iovec,int,int}", file: !37, size: 192, align: 8, elements: !38)
!37 = !DIFile(filename: "", directory: "")
!38 = !{!39, !48, !49}
!39 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !37, line: 1, baseType: !40, size: 64, align: 64)
!40 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !41, size: 64)
!41 = !DICompositeType(tag: DW_TAG_structure_type, name: "Iovec", file: !8, line: 5, size: 128, align: 8, elements: !42)
!42 = !{!43, !46}
!43 = !DIDerivedType(tag: DW_TAG_member, name: "Base", file: !8, line: 5, baseType: !44, size: 64, align: 64)
!44 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !45, size: 64)
!45 = !DIBasicType(name: "uint8", size: 8, encoding: DW_ATE_unsigned)
!46 = !DIDerivedType(tag: DW_TAG_member, name: "Len", file: !8, line: 5, baseType: !47, size: 64, align: 64, offset: 64)
!47 = !DIBasicType(name: "Iovec_len_t", size: 64, encoding: DW_ATE_unsigned)
!48 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !37, line: 1, baseType: !28, size: 64, align: 64, offset: 64)
!49 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !37, line: 1, baseType: !28, size: 64, align: 64, offset: 128)
!50 = !DIDerivedType(tag: DW_TAG_member, name: "csema", file: !8, line: 5, baseType: !25, size: 32, align: 32, offset: 320)
!51 = !DIDerivedType(tag: DW_TAG_member, name: "isBlocking", file: !8, line: 5, baseType: !25, size: 32, align: 32, offset: 352)
!52 = !DIDerivedType(tag: DW_TAG_member, name: "IsStream", file: !8, line: 5, baseType: !53, size: 8, align: 8, offset: 384)
!53 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_unsigned)
!54 = !DIDerivedType(tag: DW_TAG_member, name: "ZeroReadIsEOF", file: !8, line: 5, baseType: !53, size: 8, align: 8, offset: 392)
!55 = !DIDerivedType(tag: DW_TAG_member, name: "isFile", file: !8, line: 5, baseType: !53, size: 8, align: 8, offset: 400)
!56 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !8, line: 5, baseType: !57, size: 128, align: 64, offset: 448)
!57 = !DICompositeType(tag: DW_TAG_structure_type, name: "string", file: !58, line: 1, size: 128, align: 8, elements: !59)
!58 = !DIFile(filename: "<built-in>", directory: "")
!59 = !{!60, !61}
!60 = !DIDerivedType(tag: DW_TAG_member, name: "__data", file: !58, line: 1, baseType: !44, size: 64, align: 64)
!61 = !DIDerivedType(tag: DW_TAG_member, name: "__length", file: !58, line: 1, baseType: !28, size: 64, align: 64, offset: 64)
!62 = !DIDerivedType(tag: DW_TAG_member, name: "dirinfo", file: !8, line: 5, baseType: !63, size: 64, align: 64, offset: 576)
!63 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !64, size: 64)
!64 = !DICompositeType(tag: DW_TAG_structure_type, name: ".os.dirInfo", file: !8, line: 5, size: 64, align: 8, elements: !65)
!65 = !{!66}
!66 = !DIDerivedType(tag: DW_TAG_member, name: "dir", file: !8, line: 5, baseType: !67, size: 64, align: 64)
!67 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !68, size: 64)
!68 = !DICompositeType(tag: DW_TAG_structure_type, name: "DIR", file: !8, line: 5, align: 1, elements: !69)
!69 = !{}
!70 = !DIDerivedType(tag: DW_TAG_member, name: "nonblock", file: !8, line: 5, baseType: !53, size: 8, align: 8, offset: 640)
!71 = !DIDerivedType(tag: DW_TAG_member, name: "stdoutOrErr", file: !8, line: 5, baseType: !53, size: 8, align: 8, offset: 648)
!72 = !DIDerivedType(tag: DW_TAG_member, name: "appendMode", file: !8, line: 5, baseType: !53, size: 8, align: 8, offset: 656)
!73 = !DIGlobalVariableExpression(var: !74, expr: !DIExpression())
!74 = distinct !DIGlobalVariable(name: "runtime.writeBarrier", linkageName: "runtime.writeBarrier", scope: !3, file: !58, line: 1, type: !75, isLocal: false, isDefinition: true)
!75 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{bool,[3]uint8,bool,bool,uint64}", file: !37, size: 128, align: 8, elements: !76)
!76 = !{!77, !78, !82, !83, !84}
!77 = !DIDerivedType(tag: DW_TAG_member, name: "enabled", file: !37, line: 1, baseType: !53, size: 8, align: 8)
!78 = !DIDerivedType(tag: DW_TAG_member, name: "pad", file: !37, line: 1, baseType: !79, size: 24, align: 8, offset: 8)
!79 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 24, align: 1, elements: !80)
!80 = !{!81}
!81 = !DISubrange(count: 3, lowerBound: 0)
!82 = !DIDerivedType(tag: DW_TAG_member, name: "needed", file: !37, line: 1, baseType: !53, size: 8, align: 8, offset: 32)
!83 = !DIDerivedType(tag: DW_TAG_member, name: "cgo", file: !37, line: 1, baseType: !53, size: 8, align: 8, offset: 40)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "alignme", file: !37, line: 1, baseType: !23, size: 64, align: 64, offset: 64)
!85 = !DIGlobalVariableExpression(var: !86, expr: !DIExpression())
!86 = distinct !DIGlobalVariable(name: "os.Stdout", linkageName: "os.Stdout", scope: !3, file: !8, line: 5, type: !9, isLocal: false, isDefinition: true)
!87 = !DIGlobalVariableExpression(var: !88, expr: !DIExpression())
!88 = distinct !DIGlobalVariable(name: "encoding_1base64.StdEncoding", linkageName: "encoding_1base64.StdEncoding", scope: !3, file: !8, line: 10, type: !89, isLocal: false, isDefinition: true)
!89 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !90, size: 64)
!90 = !DICompositeType(tag: DW_TAG_structure_type, name: "Encoding", file: !8, line: 10, size: 2624, align: 4, elements: !91)
!91 = !{!92, !96, !100, !102}
!92 = !DIDerivedType(tag: DW_TAG_member, name: "encode", file: !8, line: 10, baseType: !93, size: 512, align: 8)
!93 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 512, align: 1, elements: !94)
!94 = !{!95}
!95 = !DISubrange(count: 64, lowerBound: 0)
!96 = !DIDerivedType(tag: DW_TAG_member, name: "decodeMap", file: !8, line: 10, baseType: !97, size: 2048, align: 8, offset: 512)
!97 = !DICompositeType(tag: DW_TAG_array_type, baseType: !45, size: 2048, align: 1, elements: !98)
!98 = !{!99}
!99 = !DISubrange(count: 256, lowerBound: 0)
!100 = !DIDerivedType(tag: DW_TAG_member, name: "padChar", file: !8, line: 10, baseType: !101, size: 32, align: 32, offset: 2560)
!101 = !DIBasicType(name: "int32", size: 32, encoding: DW_ATE_signed)
!102 = !DIDerivedType(tag: DW_TAG_member, name: "strict", file: !8, line: 10, baseType: !53, size: 8, align: 8, offset: 2592)
!103 = !DIGlobalVariableExpression(var: !104, expr: !DIExpression())
!104 = distinct !DIGlobalVariable(name: "bufio..types", linkageName: "bufio..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!105 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,[1]*void}", file: !37, size: 128, align: 8, elements: !106)
!106 = !{!107, !108}
!107 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !37, line: 1, baseType: !28, size: 64, align: 64)
!108 = !DIDerivedType(tag: DW_TAG_member, name: "types", file: !37, line: 1, baseType: !109, size: 64, align: 64, offset: 64)
!109 = !DICompositeType(tag: DW_TAG_array_type, baseType: !110, size: 64, align: 8, elements: !112)
!110 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !111, size: 64)
!111 = !DIBasicType(name: "void")
!112 = !{!113}
!113 = !DISubrange(count: 1, lowerBound: 0)
!114 = !DIGlobalVariableExpression(var: !115, expr: !DIExpression())
!115 = distinct !DIGlobalVariable(name: "bytes..types", linkageName: "bytes..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!116 = !DIGlobalVariableExpression(var: !117, expr: !DIExpression())
!117 = distinct !DIGlobalVariable(name: "compress_1flate..types", linkageName: "compress_1flate..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!118 = !DIGlobalVariableExpression(var: !119, expr: !DIExpression())
!119 = distinct !DIGlobalVariable(name: "compress_1gzip..types", linkageName: "compress_1gzip..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!120 = !DIGlobalVariableExpression(var: !121, expr: !DIExpression())
!121 = distinct !DIGlobalVariable(name: "context..types", linkageName: "context..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!122 = !DIGlobalVariableExpression(var: !123, expr: !DIExpression())
!123 = distinct !DIGlobalVariable(name: "crypto..types", linkageName: "crypto..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!124 = !DIGlobalVariableExpression(var: !125, expr: !DIExpression())
!125 = distinct !DIGlobalVariable(name: "crypto_1cipher..types", linkageName: "crypto_1cipher..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!126 = !DIGlobalVariableExpression(var: !127, expr: !DIExpression())
!127 = distinct !DIGlobalVariable(name: "crypto_1dsa..types", linkageName: "crypto_1dsa..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!128 = !DIGlobalVariableExpression(var: !129, expr: !DIExpression())
!129 = distinct !DIGlobalVariable(name: "crypto_1ecdsa..types", linkageName: "crypto_1ecdsa..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!130 = !DIGlobalVariableExpression(var: !131, expr: !DIExpression())
!131 = distinct !DIGlobalVariable(name: "crypto_1ed25519_1internal_1edwards25519..types", linkageName: "crypto_1ed25519_1internal_1edwards25519..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!132 = !DIGlobalVariableExpression(var: !133, expr: !DIExpression())
!133 = distinct !DIGlobalVariable(name: "crypto_1ed25519_1internal_1edwards25519_1field..types", linkageName: "crypto_1ed25519_1internal_1edwards25519_1field..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!134 = !DIGlobalVariableExpression(var: !135, expr: !DIExpression())
!135 = distinct !DIGlobalVariable(name: "crypto_1elliptic..types", linkageName: "crypto_1elliptic..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!136 = !DIGlobalVariableExpression(var: !137, expr: !DIExpression())
!137 = distinct !DIGlobalVariable(name: "crypto_1elliptic_1internal_1fiat..types", linkageName: "crypto_1elliptic_1internal_1fiat..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!138 = !DIGlobalVariableExpression(var: !139, expr: !DIExpression())
!139 = distinct !DIGlobalVariable(name: "crypto_1elliptic_1internal_1nistec..types", linkageName: "crypto_1elliptic_1internal_1nistec..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!140 = !DIGlobalVariableExpression(var: !141, expr: !DIExpression())
!141 = distinct !DIGlobalVariable(name: "crypto_1internal_1randutil..types", linkageName: "crypto_1internal_1randutil..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!142 = !DIGlobalVariableExpression(var: !143, expr: !DIExpression())
!143 = distinct !DIGlobalVariable(name: "crypto_1md5..types", linkageName: "crypto_1md5..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!144 = !DIGlobalVariableExpression(var: !145, expr: !DIExpression())
!145 = distinct !DIGlobalVariable(name: "crypto_1rand..types", linkageName: "crypto_1rand..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!146 = !DIGlobalVariableExpression(var: !147, expr: !DIExpression())
!147 = distinct !DIGlobalVariable(name: "crypto_1rsa..types", linkageName: "crypto_1rsa..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!148 = !DIGlobalVariableExpression(var: !149, expr: !DIExpression())
!149 = distinct !DIGlobalVariable(name: "crypto_1sha1..types", linkageName: "crypto_1sha1..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!150 = !DIGlobalVariableExpression(var: !151, expr: !DIExpression())
!151 = distinct !DIGlobalVariable(name: "crypto_1sha256..types", linkageName: "crypto_1sha256..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!152 = !DIGlobalVariableExpression(var: !153, expr: !DIExpression())
!153 = distinct !DIGlobalVariable(name: "crypto_1sha512..types", linkageName: "crypto_1sha512..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!154 = !DIGlobalVariableExpression(var: !155, expr: !DIExpression())
!155 = distinct !DIGlobalVariable(name: "crypto_1tls..types", linkageName: "crypto_1tls..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!156 = !DIGlobalVariableExpression(var: !157, expr: !DIExpression())
!157 = distinct !DIGlobalVariable(name: "crypto_1x509..types", linkageName: "crypto_1x509..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!158 = !DIGlobalVariableExpression(var: !159, expr: !DIExpression())
!159 = distinct !DIGlobalVariable(name: "crypto_1x509_1pkix..types", linkageName: "crypto_1x509_1pkix..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!160 = !DIGlobalVariableExpression(var: !161, expr: !DIExpression())
!161 = distinct !DIGlobalVariable(name: "encoding_1asn1..types", linkageName: "encoding_1asn1..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!162 = !DIGlobalVariableExpression(var: !163, expr: !DIExpression())
!163 = distinct !DIGlobalVariable(name: "encoding_1base64..types", linkageName: "encoding_1base64..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!164 = !DIGlobalVariableExpression(var: !165, expr: !DIExpression())
!165 = distinct !DIGlobalVariable(name: "encoding_1binary..types", linkageName: "encoding_1binary..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!166 = !DIGlobalVariableExpression(var: !167, expr: !DIExpression())
!167 = distinct !DIGlobalVariable(name: "encoding_1hex..types", linkageName: "encoding_1hex..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!168 = !DIGlobalVariableExpression(var: !169, expr: !DIExpression())
!169 = distinct !DIGlobalVariable(name: "encoding_1json..types", linkageName: "encoding_1json..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!170 = !DIGlobalVariableExpression(var: !171, expr: !DIExpression())
!171 = distinct !DIGlobalVariable(name: "encoding_1pem..types", linkageName: "encoding_1pem..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!172 = !DIGlobalVariableExpression(var: !173, expr: !DIExpression())
!173 = distinct !DIGlobalVariable(name: "errors..types", linkageName: "errors..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!174 = !DIGlobalVariableExpression(var: !175, expr: !DIExpression())
!175 = distinct !DIGlobalVariable(name: "fmt..types", linkageName: "fmt..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!176 = !DIGlobalVariableExpression(var: !177, expr: !DIExpression())
!177 = distinct !DIGlobalVariable(name: "golang_0org_1x_1crypto_1chacha20..types", linkageName: "golang_0org_1x_1crypto_1chacha20..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!178 = !DIGlobalVariableExpression(var: !179, expr: !DIExpression())
!179 = distinct !DIGlobalVariable(name: "golang_0org_1x_1crypto_1chacha20poly1305..types", linkageName: "golang_0org_1x_1crypto_1chacha20poly1305..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!180 = !DIGlobalVariableExpression(var: !181, expr: !DIExpression())
!181 = distinct !DIGlobalVariable(name: "golang_0org_1x_1crypto_1cryptobyte..types", linkageName: "golang_0org_1x_1crypto_1cryptobyte..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!182 = !DIGlobalVariableExpression(var: !183, expr: !DIExpression())
!183 = distinct !DIGlobalVariable(name: "golang_0org_1x_1crypto_1curve25519..types", linkageName: "golang_0org_1x_1crypto_1curve25519..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!184 = !DIGlobalVariableExpression(var: !185, expr: !DIExpression())
!185 = distinct !DIGlobalVariable(name: "golang_0org_1x_1crypto_1curve25519_1internal_1field..types", linkageName: "golang_0org_1x_1crypto_1curve25519_1internal_1field..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!186 = !DIGlobalVariableExpression(var: !187, expr: !DIExpression())
!187 = distinct !DIGlobalVariable(name: "golang_0org_1x_1net_1dns_1dnsmessage..types", linkageName: "golang_0org_1x_1net_1dns_1dnsmessage..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!188 = !DIGlobalVariableExpression(var: !189, expr: !DIExpression())
!189 = distinct !DIGlobalVariable(name: "golang_0org_1x_1net_1http2_1hpack..types", linkageName: "golang_0org_1x_1net_1http2_1hpack..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!190 = !DIGlobalVariableExpression(var: !191, expr: !DIExpression())
!191 = distinct !DIGlobalVariable(name: "golang_0org_1x_1net_1http_1httpguts..types", linkageName: "golang_0org_1x_1net_1http_1httpguts..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!192 = !DIGlobalVariableExpression(var: !193, expr: !DIExpression())
!193 = distinct !DIGlobalVariable(name: "golang_0org_1x_1net_1http_1httpproxy..types", linkageName: "golang_0org_1x_1net_1http_1httpproxy..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!194 = !DIGlobalVariableExpression(var: !195, expr: !DIExpression())
!195 = distinct !DIGlobalVariable(name: "golang_0org_1x_1net_1idna..types", linkageName: "golang_0org_1x_1net_1idna..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!196 = !DIGlobalVariableExpression(var: !197, expr: !DIExpression())
!197 = distinct !DIGlobalVariable(name: "golang_0org_1x_1text_1secure_1bidirule..types", linkageName: "golang_0org_1x_1text_1secure_1bidirule..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!198 = !DIGlobalVariableExpression(var: !199, expr: !DIExpression())
!199 = distinct !DIGlobalVariable(name: "golang_0org_1x_1text_1transform..types", linkageName: "golang_0org_1x_1text_1transform..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!200 = !DIGlobalVariableExpression(var: !201, expr: !DIExpression())
!201 = distinct !DIGlobalVariable(name: "golang_0org_1x_1text_1unicode_1bidi..types", linkageName: "golang_0org_1x_1text_1unicode_1bidi..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!202 = !DIGlobalVariableExpression(var: !203, expr: !DIExpression())
!203 = distinct !DIGlobalVariable(name: "golang_0org_1x_1text_1unicode_1norm..types", linkageName: "golang_0org_1x_1text_1unicode_1norm..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!204 = !DIGlobalVariableExpression(var: !205, expr: !DIExpression())
!205 = distinct !DIGlobalVariable(name: "hash_1crc32..types", linkageName: "hash_1crc32..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!206 = !DIGlobalVariableExpression(var: !207, expr: !DIExpression())
!207 = distinct !DIGlobalVariable(name: "internal_1cpu..types", linkageName: "internal_1cpu..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!208 = !DIGlobalVariableExpression(var: !209, expr: !DIExpression())
!209 = distinct !DIGlobalVariable(name: "internal_1intern..types", linkageName: "internal_1intern..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!210 = !DIGlobalVariableExpression(var: !211, expr: !DIExpression())
!211 = distinct !DIGlobalVariable(name: "internal_1oserror..types", linkageName: "internal_1oserror..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!212 = !DIGlobalVariableExpression(var: !213, expr: !DIExpression())
!213 = distinct !DIGlobalVariable(name: "internal_1poll..types", linkageName: "internal_1poll..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!214 = !DIGlobalVariableExpression(var: !215, expr: !DIExpression())
!215 = distinct !DIGlobalVariable(name: "internal_1reflectlite..types", linkageName: "internal_1reflectlite..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!216 = !DIGlobalVariableExpression(var: !217, expr: !DIExpression())
!217 = distinct !DIGlobalVariable(name: "internal_1testlog..types", linkageName: "internal_1testlog..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!218 = !DIGlobalVariableExpression(var: !219, expr: !DIExpression())
!219 = distinct !DIGlobalVariable(name: "io..types", linkageName: "io..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!220 = !DIGlobalVariableExpression(var: !221, expr: !DIExpression())
!221 = distinct !DIGlobalVariable(name: "io_1fs..types", linkageName: "io_1fs..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!222 = !DIGlobalVariableExpression(var: !223, expr: !DIExpression())
!223 = distinct !DIGlobalVariable(name: "io_1ioutil..types", linkageName: "io_1ioutil..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!224 = !DIGlobalVariableExpression(var: !225, expr: !DIExpression())
!225 = distinct !DIGlobalVariable(name: "log..types", linkageName: "log..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!226 = !DIGlobalVariableExpression(var: !227, expr: !DIExpression())
!227 = distinct !DIGlobalVariable(name: "math..types", linkageName: "math..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!228 = !DIGlobalVariableExpression(var: !229, expr: !DIExpression())
!229 = distinct !DIGlobalVariable(name: "math_1big..types", linkageName: "math_1big..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!230 = !DIGlobalVariableExpression(var: !231, expr: !DIExpression())
!231 = distinct !DIGlobalVariable(name: "math_1rand..types", linkageName: "math_1rand..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!232 = !DIGlobalVariableExpression(var: !233, expr: !DIExpression())
!233 = distinct !DIGlobalVariable(name: "mime..types", linkageName: "mime..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!234 = !DIGlobalVariableExpression(var: !235, expr: !DIExpression())
!235 = distinct !DIGlobalVariable(name: "mime_1multipart..types", linkageName: "mime_1multipart..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!236 = !DIGlobalVariableExpression(var: !237, expr: !DIExpression())
!237 = distinct !DIGlobalVariable(name: "mime_1quotedprintable..types", linkageName: "mime_1quotedprintable..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!238 = !DIGlobalVariableExpression(var: !239, expr: !DIExpression())
!239 = distinct !DIGlobalVariable(name: "net..types", linkageName: "net..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!240 = !DIGlobalVariableExpression(var: !241, expr: !DIExpression())
!241 = distinct !DIGlobalVariable(name: "net_1http..types", linkageName: "net_1http..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!242 = !DIGlobalVariableExpression(var: !243, expr: !DIExpression())
!243 = distinct !DIGlobalVariable(name: "net_1http_1internal..types", linkageName: "net_1http_1internal..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!244 = !DIGlobalVariableExpression(var: !245, expr: !DIExpression())
!245 = distinct !DIGlobalVariable(name: "net_1netip..types", linkageName: "net_1netip..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!246 = !DIGlobalVariableExpression(var: !247, expr: !DIExpression())
!247 = distinct !DIGlobalVariable(name: "net_1textproto..types", linkageName: "net_1textproto..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!248 = !DIGlobalVariableExpression(var: !249, expr: !DIExpression())
!249 = distinct !DIGlobalVariable(name: "os..types", linkageName: "os..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!250 = !DIGlobalVariableExpression(var: !251, expr: !DIExpression())
!251 = distinct !DIGlobalVariable(name: "path..types", linkageName: "path..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!252 = !DIGlobalVariableExpression(var: !253, expr: !DIExpression())
!253 = distinct !DIGlobalVariable(name: "path_1filepath..types", linkageName: "path_1filepath..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!254 = !DIGlobalVariableExpression(var: !255, expr: !DIExpression())
!255 = distinct !DIGlobalVariable(name: "reflect..types", linkageName: "reflect..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!256 = !DIGlobalVariableExpression(var: !257, expr: !DIExpression())
!257 = distinct !DIGlobalVariable(name: "runtime..types", linkageName: "runtime..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!258 = !DIGlobalVariableExpression(var: !259, expr: !DIExpression())
!259 = distinct !DIGlobalVariable(name: "sort..types", linkageName: "sort..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!260 = !DIGlobalVariableExpression(var: !261, expr: !DIExpression())
!261 = distinct !DIGlobalVariable(name: "strconv..types", linkageName: "strconv..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!262 = !DIGlobalVariableExpression(var: !263, expr: !DIExpression())
!263 = distinct !DIGlobalVariable(name: "sync..types", linkageName: "sync..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!264 = !DIGlobalVariableExpression(var: !265, expr: !DIExpression())
!265 = distinct !DIGlobalVariable(name: "syscall..types", linkageName: "syscall..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!266 = !DIGlobalVariableExpression(var: !267, expr: !DIExpression())
!267 = distinct !DIGlobalVariable(name: "time..types", linkageName: "time..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!268 = !DIGlobalVariableExpression(var: !269, expr: !DIExpression())
!269 = distinct !DIGlobalVariable(name: "unicode..types", linkageName: "unicode..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!270 = !DIGlobalVariableExpression(var: !271, expr: !DIExpression())
!271 = distinct !DIGlobalVariable(name: "container_1list..types", linkageName: "container_1list..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!272 = !DIGlobalVariableExpression(var: !273, expr: !DIExpression())
!273 = distinct !DIGlobalVariable(name: "crypto_1aes..types", linkageName: "crypto_1aes..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!274 = !DIGlobalVariableExpression(var: !275, expr: !DIExpression())
!275 = distinct !DIGlobalVariable(name: "crypto_1des..types", linkageName: "crypto_1des..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!276 = !DIGlobalVariableExpression(var: !277, expr: !DIExpression())
!277 = distinct !DIGlobalVariable(name: "crypto_1ed25519..types", linkageName: "crypto_1ed25519..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!278 = !DIGlobalVariableExpression(var: !279, expr: !DIExpression())
!279 = distinct !DIGlobalVariable(name: "crypto_1hmac..types", linkageName: "crypto_1hmac..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!280 = !DIGlobalVariableExpression(var: !281, expr: !DIExpression())
!281 = distinct !DIGlobalVariable(name: "crypto_1internal_1subtle..types", linkageName: "crypto_1internal_1subtle..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!282 = !DIGlobalVariableExpression(var: !283, expr: !DIExpression())
!283 = distinct !DIGlobalVariable(name: "crypto_1rc4..types", linkageName: "crypto_1rc4..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!284 = !DIGlobalVariableExpression(var: !285, expr: !DIExpression())
!285 = distinct !DIGlobalVariable(name: "crypto_1subtle..types", linkageName: "crypto_1subtle..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!286 = !DIGlobalVariableExpression(var: !287, expr: !DIExpression())
!287 = distinct !DIGlobalVariable(name: "encoding..types", linkageName: "encoding..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!288 = !DIGlobalVariableExpression(var: !289, expr: !DIExpression())
!289 = distinct !DIGlobalVariable(name: "golang_0org_1x_1crypto_1cryptobyte_1asn1..types", linkageName: "golang_0org_1x_1crypto_1cryptobyte_1asn1..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!290 = !DIGlobalVariableExpression(var: !291, expr: !DIExpression())
!291 = distinct !DIGlobalVariable(name: "golang_0org_1x_1crypto_1hkdf..types", linkageName: "golang_0org_1x_1crypto_1hkdf..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!292 = !DIGlobalVariableExpression(var: !293, expr: !DIExpression())
!293 = distinct !DIGlobalVariable(name: "golang_0org_1x_1crypto_1internal_1poly1305..types", linkageName: "golang_0org_1x_1crypto_1internal_1poly1305..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!294 = !DIGlobalVariableExpression(var: !295, expr: !DIExpression())
!295 = distinct !DIGlobalVariable(name: "golang_0org_1x_1crypto_1internal_1subtle..types", linkageName: "golang_0org_1x_1crypto_1internal_1subtle..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!296 = !DIGlobalVariableExpression(var: !297, expr: !DIExpression())
!297 = distinct !DIGlobalVariable(name: "hash..types", linkageName: "hash..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!298 = !DIGlobalVariableExpression(var: !299, expr: !DIExpression())
!299 = distinct !DIGlobalVariable(name: "internal_1abi..types", linkageName: "internal_1abi..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!300 = !DIGlobalVariableExpression(var: !301, expr: !DIExpression())
!301 = distinct !DIGlobalVariable(name: "internal_1bytealg..types", linkageName: "internal_1bytealg..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!302 = !DIGlobalVariableExpression(var: !303, expr: !DIExpression())
!303 = distinct !DIGlobalVariable(name: "internal_1fmtsort..types", linkageName: "internal_1fmtsort..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!304 = !DIGlobalVariableExpression(var: !305, expr: !DIExpression())
!305 = distinct !DIGlobalVariable(name: "internal_1goarch..types", linkageName: "internal_1goarch..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!306 = !DIGlobalVariableExpression(var: !307, expr: !DIExpression())
!307 = distinct !DIGlobalVariable(name: "internal_1godebug..types", linkageName: "internal_1godebug..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!308 = !DIGlobalVariableExpression(var: !309, expr: !DIExpression())
!309 = distinct !DIGlobalVariable(name: "internal_1goexperiment..types", linkageName: "internal_1goexperiment..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!310 = !DIGlobalVariableExpression(var: !311, expr: !DIExpression())
!311 = distinct !DIGlobalVariable(name: "internal_1goos..types", linkageName: "internal_1goos..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!312 = !DIGlobalVariableExpression(var: !313, expr: !DIExpression())
!313 = distinct !DIGlobalVariable(name: "internal_1itoa..types", linkageName: "internal_1itoa..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!314 = !DIGlobalVariableExpression(var: !315, expr: !DIExpression())
!315 = distinct !DIGlobalVariable(name: "internal_1nettrace..types", linkageName: "internal_1nettrace..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!316 = !DIGlobalVariableExpression(var: !317, expr: !DIExpression())
!317 = distinct !DIGlobalVariable(name: "internal_1race..types", linkageName: "internal_1race..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!318 = !DIGlobalVariableExpression(var: !319, expr: !DIExpression())
!319 = distinct !DIGlobalVariable(name: "internal_1singleflight..types", linkageName: "internal_1singleflight..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!320 = !DIGlobalVariableExpression(var: !321, expr: !DIExpression())
!321 = distinct !DIGlobalVariable(name: "internal_1syscall_1execenv..types", linkageName: "internal_1syscall_1execenv..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!322 = !DIGlobalVariableExpression(var: !323, expr: !DIExpression())
!323 = distinct !DIGlobalVariable(name: "internal_1syscall_1unix..types", linkageName: "internal_1syscall_1unix..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!324 = !DIGlobalVariableExpression(var: !325, expr: !DIExpression())
!325 = distinct !DIGlobalVariable(name: "internal_1unsafeheader..types", linkageName: "internal_1unsafeheader..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!326 = !DIGlobalVariableExpression(var: !327, expr: !DIExpression())
!327 = distinct !DIGlobalVariable(name: "math_1bits..types", linkageName: "math_1bits..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!328 = !DIGlobalVariableExpression(var: !329, expr: !DIExpression())
!329 = distinct !DIGlobalVariable(name: "net_1http_1httptrace..types", linkageName: "net_1http_1httptrace..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!330 = !DIGlobalVariableExpression(var: !331, expr: !DIExpression())
!331 = distinct !DIGlobalVariable(name: "net_1http_1internal_1ascii..types", linkageName: "net_1http_1internal_1ascii..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!332 = !DIGlobalVariableExpression(var: !333, expr: !DIExpression())
!333 = distinct !DIGlobalVariable(name: "net_1url..types", linkageName: "net_1url..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!334 = !DIGlobalVariableExpression(var: !335, expr: !DIExpression())
!335 = distinct !DIGlobalVariable(name: "runtime_1internal_1atomic..types", linkageName: "runtime_1internal_1atomic..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!336 = !DIGlobalVariableExpression(var: !337, expr: !DIExpression())
!337 = distinct !DIGlobalVariable(name: "runtime_1internal_1math..types", linkageName: "runtime_1internal_1math..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!338 = !DIGlobalVariableExpression(var: !339, expr: !DIExpression())
!339 = distinct !DIGlobalVariable(name: "runtime_1internal_1sys..types", linkageName: "runtime_1internal_1sys..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!340 = !DIGlobalVariableExpression(var: !341, expr: !DIExpression())
!341 = distinct !DIGlobalVariable(name: "strings..types", linkageName: "strings..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!342 = !DIGlobalVariableExpression(var: !343, expr: !DIExpression())
!343 = distinct !DIGlobalVariable(name: "sync_1atomic..types", linkageName: "sync_1atomic..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!344 = !DIGlobalVariableExpression(var: !345, expr: !DIExpression())
!345 = distinct !DIGlobalVariable(name: "unicode_1utf16..types", linkageName: "unicode_1utf16..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!346 = !DIGlobalVariableExpression(var: !347, expr: !DIExpression())
!347 = distinct !DIGlobalVariable(name: "unicode_1utf8..types", linkageName: "unicode_1utf8..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!348 = !DIGlobalVariableExpression(var: !349, expr: !DIExpression())
!349 = distinct !DIGlobalVariable(name: "main..types", linkageName: "main..types", scope: !3, file: !37, type: !105, isLocal: false, isDefinition: true)
!350 = distinct !DISubprogram(name: "__go_init_main", scope: null, file: !8, line: 1, type: !351, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !69)
!351 = !DISubroutineType(types: !352)
!352 = !{!111}
!353 = !DILocation(line: 1, column: 1, scope: !354)
!354 = !DILexicalBlockFile(scope: !350, file: !58, discriminator: 0)
!355 = distinct !DISubprogram(name: "main.Response..eq", scope: null, file: !58, line: 1, type: !356, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !69)
!356 = !DISubroutineType(types: !357)
!357 = !{!53, !110, !110}
!358 = !DILocalVariable(name: "key1", arg: 1, scope: !355, file: !58, line: 1, type: !110)
!359 = !DILocation(line: 1, column: 1, scope: !355)
!360 = !DILocalVariable(name: "key2", arg: 2, scope: !355, file: !58, line: 1, type: !110)
!361 = !DILocalVariable(name: "$ret5", scope: !355, file: !58, line: 1, type: !53)
!362 = distinct !DISubprogram(name: "main.Request..eq", scope: null, file: !58, line: 1, type: !356, scopeLine: 1, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !69)
!363 = !DILocalVariable(name: "key1", arg: 1, scope: !362, file: !58, line: 1, type: !110)
!364 = !DILocation(line: 1, column: 1, scope: !362)
!365 = !DILocalVariable(name: "key2", arg: 2, scope: !362, file: !58, line: 1, type: !110)
!366 = !DILocalVariable(name: "$ret6", scope: !362, file: !58, line: 1, type: !53)
!367 = distinct !DISubprogram(name: "main.get_arg_from_caller", scope: null, file: !8, line: 24, type: !368, scopeLine: 24, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !69)
!368 = !DISubroutineType(types: !369)
!369 = !{!57}
!370 = !DILocalVariable(name: "$ret0", scope: !367, file: !8, line: 24, type: !57)
!371 = !DILocation(line: 24, column: 28, scope: !367)
!372 = !DILocation(line: 25, column: 30, scope: !373)
!373 = distinct !DILexicalBlock(scope: !367, file: !8, line: 24, column: 1)
!374 = !DILocation(line: 25, column: 19, scope: !373)
!375 = !DILocalVariable(name: "data", scope: !373, file: !8, line: 25, type: !376)
!376 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*uint8,int,int}", file: !37, size: 192, align: 8, elements: !377)
!377 = !{!378, !48, !49}
!378 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !37, line: 1, baseType: !44, size: 64, align: 64)
!379 = !DILocation(line: 25, column: 3, scope: !367)
!380 = !DILocalVariable(name: "err", scope: !373, file: !8, line: 25, type: !381)
!381 = !DICompositeType(tag: DW_TAG_structure_type, name: "error", file: !58, line: 1, size: 128, align: 8, elements: !382)
!382 = !{!383, !428}
!383 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !58, line: 1, baseType: !384, size: 64, align: 64)
!384 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !385, size: 64)
!385 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)string}", file: !37, size: 128, align: 8, elements: !386)
!386 = !{!387, !424}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !37, line: 1, baseType: !388, size: 64, align: 64)
!388 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !389, size: 64)
!389 = !DICompositeType(tag: DW_TAG_structure_type, name: "_type", file: !58, line: 1, size: 512, align: 8, elements: !390)
!390 = !{!391, !392, !393, !394, !395, !396, !397, !398, !404, !405, !407, !423}
!391 = !DIDerivedType(tag: DW_TAG_member, name: "size", file: !58, line: 1, baseType: !33, size: 64, align: 64)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "ptrdata", file: !58, line: 1, baseType: !33, size: 64, align: 64, offset: 64)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "hash", file: !58, line: 1, baseType: !25, size: 32, align: 32, offset: 128)
!394 = !DIDerivedType(tag: DW_TAG_member, name: "tflag", file: !58, line: 1, baseType: !45, size: 8, align: 8, offset: 160)
!395 = !DIDerivedType(tag: DW_TAG_member, name: "align", file: !58, line: 1, baseType: !45, size: 8, align: 8, offset: 168)
!396 = !DIDerivedType(tag: DW_TAG_member, name: "fieldAlign", file: !58, line: 1, baseType: !45, size: 8, align: 8, offset: 176)
!397 = !DIDerivedType(tag: DW_TAG_member, name: "kind", file: !58, line: 1, baseType: !45, size: 8, align: 8, offset: 184)
!398 = !DIDerivedType(tag: DW_TAG_member, name: "equal", file: !58, line: 1, baseType: !399, size: 64, align: 64, offset: 192)
!399 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !400, size: 64)
!400 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !58, line: 1, size: 64, align: 8, elements: !401)
!401 = !{!402}
!402 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !58, line: 1, baseType: !403, size: 64, align: 64)
!403 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !356, size: 64)
!404 = !DIDerivedType(tag: DW_TAG_member, name: "gcdata", file: !58, line: 1, baseType: !44, size: 64, align: 64, offset: 256)
!405 = !DIDerivedType(tag: DW_TAG_member, name: "string", file: !58, line: 1, baseType: !406, size: 64, align: 64, offset: 320)
!406 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !57, size: 64)
!407 = !DIDerivedType(tag: DW_TAG_member, name: "uncommonType", file: !58, line: 1, baseType: !408, size: 64, align: 64, offset: 384)
!408 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !409, size: 64)
!409 = !DICompositeType(tag: DW_TAG_structure_type, name: "uncommonType", file: !58, line: 1, size: 320, align: 8, elements: !410)
!410 = !{!411, !412, !413}
!411 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !58, line: 1, baseType: !406, size: 64, align: 64)
!412 = !DIDerivedType(tag: DW_TAG_member, name: "pkgPath", file: !58, line: 1, baseType: !406, size: 64, align: 64, offset: 64)
!413 = !DIDerivedType(tag: DW_TAG_member, name: "methods", file: !58, line: 1, baseType: !414, size: 192, align: 64, offset: 128)
!414 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*method,int,int}", file: !37, size: 192, align: 8, elements: !415)
!415 = !{!416, !48, !49}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !37, line: 1, baseType: !417, size: 64, align: 64)
!417 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !418, size: 64)
!418 = !DICompositeType(tag: DW_TAG_structure_type, name: "method", file: !58, line: 1, size: 320, align: 8, elements: !419)
!419 = !{!411, !412, !420, !421, !422}
!420 = !DIDerivedType(tag: DW_TAG_member, name: "mtyp", file: !58, line: 1, baseType: !110, size: 64, align: 64, offset: 128)
!421 = !DIDerivedType(tag: DW_TAG_member, name: "typ", file: !58, line: 1, baseType: !110, size: 64, align: 64, offset: 192)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "tfn", file: !58, line: 1, baseType: !110, size: 64, align: 64, offset: 256)
!423 = !DIDerivedType(tag: DW_TAG_member, name: "ptrToThis", file: !58, line: 1, baseType: !110, size: 64, align: 64, offset: 448)
!424 = !DIDerivedType(tag: DW_TAG_member, name: "Error", file: !37, line: 1, baseType: !425, size: 64, align: 64, offset: 64)
!425 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !426, size: 64)
!426 = !DISubroutineType(types: !427)
!427 = !{!57, !110}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !58, line: 1, baseType: !110, size: 64, align: 64, offset: 64)
!429 = !DILocation(line: 26, column: 10, scope: !373)
!430 = !DILocation(line: 26, column: 3, scope: !373)
!431 = !DILocation(line: 27, column: 8, scope: !373)
!432 = !DILocation(line: 29, column: 28, scope: !373)
!433 = !DILocation(line: 29, column: 18, scope: !373)
!434 = !DILocalVariable(name: "str", scope: !373, file: !8, line: 29, type: !57)
!435 = !DILocation(line: 29, column: 3, scope: !367)
!436 = !DILocation(line: 30, column: 3, scope: !373)
!437 = distinct !DISubprogram(name: "os.Exit", scope: null, file: !438, line: 62, type: !439, scopeLine: 62, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !69)
!438 = !DIFile(filename: "proc.go", directory: " /proj/zyuxuanssf-PG0/llvm-project-go/llvm/tools/gollvm/gofrontend/libgo/go/os")
!439 = !DISubroutineType(types: !440)
!440 = !{!111, !28}
!441 = !DILocalVariable(name: "code", arg: 1, scope: !437, file: !438, line: 62, type: !28)
!442 = !DILocation(line: 62, scope: !437)
!443 = !DILocation(line: 63, scope: !437)
!444 = !DILocation(line: 64, scope: !437)
!445 = !DILocation(line: 75, scope: !437)
!446 = !DILocation(line: 68, scope: !437)
!447 = !DILocation(line: 73, scope: !437)
!448 = distinct !DISubprogram(name: "main.send_value_to_caller", scope: null, file: !8, line: 33, type: !449, scopeLine: 33, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !69)
!449 = !DISubroutineType(types: !450)
!450 = !{!111, !57}
!451 = !DILocalVariable(name: "response", scope: !452, file: !8, line: 34, type: !453)
!452 = distinct !DILexicalBlock(scope: !448, file: !8, line: 33, column: 1)
!453 = !DICompositeType(tag: DW_TAG_structure_type, name: "Response", file: !8, line: 15, size: 256, align: 8, elements: !454)
!454 = !{!455, !456}
!455 = !DIDerivedType(tag: DW_TAG_member, name: "Err", file: !8, line: 16, baseType: !57, size: 128, align: 64)
!456 = !DIDerivedType(tag: DW_TAG_member, name: "Msg", file: !8, line: 17, baseType: !57, size: 128, align: 64, offset: 128)
!457 = !DILocation(line: 34, column: 3, scope: !448)
!458 = !DILocalVariable(name: "output", arg: 1, scope: !448, file: !8, line: 33, type: !57)
!459 = !DILocation(line: 33, column: 27, scope: !448)
!460 = !DILocation(line: 34, column: 15, scope: !452)
!461 = !DILocation(line: 38, column: 23, scope: !452)
!462 = !DILocalVariable(name: "jsonData", scope: !452, file: !8, line: 38, type: !376)
!463 = !DILocation(line: 38, column: 3, scope: !448)
!464 = !DILocalVariable(name: "sink$0", scope: !452, file: !8, line: 38, type: !381)
!465 = !DILocation(line: 40, column: 21, scope: !452)
!466 = !DILocation(line: 40, column: 6, scope: !452)
!467 = !DILocation(line: 40, column: 29, scope: !452)
!468 = distinct !DISubprogram(name: "main.make_rpc", scope: null, file: !8, line: 43, type: !469, scopeLine: 43, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !69)
!469 = !DISubroutineType(types: !470)
!470 = !{!57, !57, !57}
!471 = !DILocalVariable(name: "func_name", arg: 1, scope: !468, file: !8, line: 43, type: !57)
!472 = !DILocation(line: 43, column: 15, scope: !468)
!473 = !DILocalVariable(name: "data", arg: 2, scope: !468, file: !8, line: 43, type: !57)
!474 = !DILocation(line: 43, column: 33, scope: !468)
!475 = !DILocalVariable(name: "$ret1", scope: !468, file: !8, line: 43, type: !57)
!476 = !DILocation(line: 43, column: 46, scope: !468)
!477 = !DILocalVariable(name: "url", scope: !478, file: !8, line: 44, type: !57)
!478 = distinct !DILexicalBlock(scope: !468, file: !8, line: 43, column: 1)
!479 = !DILocation(line: 44, column: 3, scope: !468)
!480 = !DILocation(line: 45, column: 3, scope: !478)
!481 = !DILocation(line: 73, column: 1, scope: !468)
!482 = !DILocation(line: 45, column: 7, scope: !478)
!483 = !DILocation(line: 46, column: 3, scope: !478)
!484 = !DILocation(line: 46, column: 7, scope: !478)
!485 = !DILocation(line: 47, column: 21, scope: !478)
!486 = !DILocalVariable(name: "jsonData", scope: !478, file: !8, line: 47, type: !376)
!487 = !DILocation(line: 47, column: 3, scope: !468)
!488 = !DILocalVariable(name: "username", scope: !478, file: !8, line: 48, type: !57)
!489 = !DILocation(line: 48, column: 3, scope: !468)
!490 = !DILocalVariable(name: "password", scope: !478, file: !8, line: 49, type: !57)
!491 = !DILocation(line: 49, column: 3, scope: !468)
!492 = !DILocation(line: 50, column: 11, scope: !478)
!493 = !DILocalVariable(name: "auth", scope: !478, file: !8, line: 50, type: !57)
!494 = !DILocation(line: 50, column: 3, scope: !468)
!495 = !DILocation(line: 51, column: 25, scope: !478)
!496 = !DILocation(line: 51, column: 58, scope: !478)
!497 = !DILocation(line: 51, column: 36, scope: !478)
!498 = !DILocalVariable(name: "encodedAuth", scope: !478, file: !8, line: 51, type: !57)
!499 = !DILocation(line: 51, column: 3, scope: !468)
!500 = !DILocation(line: 52, column: 50, scope: !478)
!501 = !DILocation(line: 52, column: 20, scope: !478)
!502 = !DILocalVariable(name: "req", scope: !478, file: !8, line: 52, type: !503)
!503 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !504, size: 64)
!504 = !DICompositeType(tag: DW_TAG_structure_type, name: "Request", file: !8, line: 11, size: 1984, align: 8, elements: !505)
!505 = !{!506, !507, !527, !528, !529, !530, !544, !565, !577, !579, !583, !584, !585, !586, !587, !593, !594, !595, !596, !798, !801, !814}
!506 = !DIDerivedType(tag: DW_TAG_member, name: "Method", file: !8, line: 11, baseType: !57, size: 128, align: 64)
!507 = !DIDerivedType(tag: DW_TAG_member, name: "URL", file: !8, line: 11, baseType: !508, size: 64, align: 64, offset: 128)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !509, size: 64)
!509 = !DICompositeType(tag: DW_TAG_structure_type, name: "URL", file: !8, line: 11, size: 1152, align: 8, elements: !510)
!510 = !{!511, !512, !513, !520, !521, !522, !523, !524, !525, !526}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "Scheme", file: !8, line: 11, baseType: !57, size: 128, align: 64)
!512 = !DIDerivedType(tag: DW_TAG_member, name: "Opaque", file: !8, line: 11, baseType: !57, size: 128, align: 64, offset: 128)
!513 = !DIDerivedType(tag: DW_TAG_member, name: "User", file: !8, line: 11, baseType: !514, size: 64, align: 64, offset: 256)
!514 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !515, size: 64)
!515 = !DICompositeType(tag: DW_TAG_structure_type, name: "Userinfo", file: !8, line: 11, size: 320, align: 8, elements: !516)
!516 = !{!517, !518, !519}
!517 = !DIDerivedType(tag: DW_TAG_member, name: "username", file: !8, line: 11, baseType: !57, size: 128, align: 64)
!518 = !DIDerivedType(tag: DW_TAG_member, name: "password", file: !8, line: 11, baseType: !57, size: 128, align: 64, offset: 128)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "passwordSet", file: !8, line: 11, baseType: !53, size: 8, align: 8, offset: 256)
!520 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !8, line: 11, baseType: !57, size: 128, align: 64, offset: 320)
!521 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !8, line: 11, baseType: !57, size: 128, align: 64, offset: 448)
!522 = !DIDerivedType(tag: DW_TAG_member, name: "RawPath", file: !8, line: 11, baseType: !57, size: 128, align: 64, offset: 576)
!523 = !DIDerivedType(tag: DW_TAG_member, name: "ForceQuery", file: !8, line: 11, baseType: !53, size: 8, align: 8, offset: 704)
!524 = !DIDerivedType(tag: DW_TAG_member, name: "RawQuery", file: !8, line: 11, baseType: !57, size: 128, align: 64, offset: 768)
!525 = !DIDerivedType(tag: DW_TAG_member, name: "Fragment", file: !8, line: 11, baseType: !57, size: 128, align: 64, offset: 896)
!526 = !DIDerivedType(tag: DW_TAG_member, name: "RawFragment", file: !8, line: 11, baseType: !57, size: 128, align: 64, offset: 1024)
!527 = !DIDerivedType(tag: DW_TAG_member, name: "Proto", file: !8, line: 11, baseType: !57, size: 128, align: 64, offset: 192)
!528 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMajor", file: !8, line: 11, baseType: !28, size: 64, align: 64, offset: 320)
!529 = !DIDerivedType(tag: DW_TAG_member, name: "ProtoMinor", file: !8, line: 11, baseType: !28, size: 64, align: 64, offset: 384)
!530 = !DIDerivedType(tag: DW_TAG_member, name: "Header", file: !8, line: 11, baseType: !531, size: 64, align: 64, offset: 448)
!531 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !532, size: 64)
!532 = !DICompositeType(tag: DW_TAG_structure_type, name: "runtime.hmap", file: !58, line: 1, size: 384, align: 8, elements: !533)
!533 = !{!534, !535, !536, !537, !539, !540, !541, !542, !543}
!534 = !DIDerivedType(tag: DW_TAG_member, name: "count", file: !58, line: 1, baseType: !28, size: 64, align: 64)
!535 = !DIDerivedType(tag: DW_TAG_member, name: "flags", file: !58, line: 1, baseType: !45, size: 8, align: 8, offset: 64)
!536 = !DIDerivedType(tag: DW_TAG_member, name: "B", file: !58, line: 1, baseType: !45, size: 8, align: 8, offset: 72)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "noverflow", file: !58, line: 1, baseType: !538, size: 16, align: 16, offset: 80)
!538 = !DIBasicType(name: "uint16", size: 16, encoding: DW_ATE_unsigned)
!539 = !DIDerivedType(tag: DW_TAG_member, name: "hash0", file: !58, line: 1, baseType: !25, size: 32, align: 32, offset: 96)
!540 = !DIDerivedType(tag: DW_TAG_member, name: "buckets", file: !58, line: 1, baseType: !110, size: 64, align: 64, offset: 128)
!541 = !DIDerivedType(tag: DW_TAG_member, name: "oldbuckets", file: !58, line: 1, baseType: !110, size: 64, align: 64, offset: 192)
!542 = !DIDerivedType(tag: DW_TAG_member, name: "nevacuate", file: !58, line: 1, baseType: !33, size: 64, align: 64, offset: 256)
!543 = !DIDerivedType(tag: DW_TAG_member, name: "extra", file: !58, line: 1, baseType: !110, size: 64, align: 64, offset: 320)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "Body", file: !8, line: 11, baseType: !545, size: 128, align: 64, offset: 512)
!545 = !DICompositeType(tag: DW_TAG_structure_type, name: "ReadCloser", file: !8, line: 4, size: 128, align: 8, elements: !546)
!546 = !{!547, !564}
!547 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 4, baseType: !548, size: 64, align: 64)
!548 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !549, size: 64)
!549 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)error,*func(*void,struct{*uint8,int,int})struct{int,error}}", file: !37, size: 192, align: 8, elements: !550)
!550 = !{!551, !552, !556}
!551 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !37, line: 4, baseType: !388, size: 64, align: 64)
!552 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !37, line: 4, baseType: !553, size: 64, align: 64, offset: 64)
!553 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !554, size: 64)
!554 = !DISubroutineType(types: !555)
!555 = !{!381, !110}
!556 = !DIDerivedType(tag: DW_TAG_member, name: "Read", file: !37, line: 4, baseType: !557, size: 64, align: 64, offset: 128)
!557 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !558, size: 64)
!558 = !DISubroutineType(types: !559)
!559 = !{!560, !110, !376}
!560 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{int,error}", file: !37, size: 192, align: 8, elements: !561)
!561 = !{!562, !563}
!562 = !DIDerivedType(tag: DW_TAG_member, name: "n", file: !37, line: 4, baseType: !28, size: 64, align: 64)
!563 = !DIDerivedType(tag: DW_TAG_member, name: "err", file: !37, line: 4, baseType: !381, size: 128, align: 64, offset: 64)
!564 = !DIDerivedType(tag: DW_TAG_member, name: "__object", file: !8, line: 1, baseType: !110, size: 64, align: 64, offset: 64)
!565 = !DIDerivedType(tag: DW_TAG_member, name: "GetBody", file: !8, line: 11, baseType: !566, size: 64, align: 64, offset: 640)
!566 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !567, size: 64)
!567 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !8, line: 11, size: 64, align: 8, elements: !568)
!568 = !{!569}
!569 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !8, line: 11, baseType: !570, size: 64, align: 64)
!570 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !571, size: 64)
!571 = !DISubroutineType(types: !572)
!572 = !{!573}
!573 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{ReadCloser,error}", file: !37, size: 256, align: 8, elements: !574)
!574 = !{!575, !576}
!575 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !37, line: 11, baseType: !545, size: 128, align: 64)
!576 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !37, line: 11, baseType: !381, size: 128, align: 64, offset: 128)
!577 = !DIDerivedType(tag: DW_TAG_member, name: "ContentLength", file: !8, line: 11, baseType: !578, size: 64, align: 64, offset: 704)
!578 = !DIBasicType(name: "int64", size: 64, encoding: DW_ATE_signed)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "TransferEncoding", file: !8, line: 11, baseType: !580, size: 192, align: 64, offset: 768)
!580 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*string,int,int}", file: !37, size: 192, align: 8, elements: !581)
!581 = !{!582, !48, !49}
!582 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !37, line: 1, baseType: !406, size: 64, align: 64)
!583 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !8, line: 11, baseType: !53, size: 8, align: 8, offset: 960)
!584 = !DIDerivedType(tag: DW_TAG_member, name: "Host", file: !8, line: 11, baseType: !57, size: 128, align: 64, offset: 1024)
!585 = !DIDerivedType(tag: DW_TAG_member, name: "Form", file: !8, line: 11, baseType: !531, size: 64, align: 64, offset: 1152)
!586 = !DIDerivedType(tag: DW_TAG_member, name: "PostForm", file: !8, line: 11, baseType: !531, size: 64, align: 64, offset: 1216)
!587 = !DIDerivedType(tag: DW_TAG_member, name: "MultipartForm", file: !8, line: 11, baseType: !588, size: 64, align: 64, offset: 1280)
!588 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !589, size: 64)
!589 = !DICompositeType(tag: DW_TAG_structure_type, name: "Form", file: !8, line: 11, size: 128, align: 8, elements: !590)
!590 = !{!591, !592}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !8, line: 11, baseType: !531, size: 64, align: 64)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "File", file: !8, line: 11, baseType: !531, size: 64, align: 64, offset: 64)
!593 = !DIDerivedType(tag: DW_TAG_member, name: "Trailer", file: !8, line: 11, baseType: !531, size: 64, align: 64, offset: 1344)
!594 = !DIDerivedType(tag: DW_TAG_member, name: "RemoteAddr", file: !8, line: 11, baseType: !57, size: 128, align: 64, offset: 1408)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "RequestURI", file: !8, line: 11, baseType: !57, size: 128, align: 64, offset: 1536)
!596 = !DIDerivedType(tag: DW_TAG_member, name: "TLS", file: !8, line: 11, baseType: !597, size: 64, align: 64, offset: 1664)
!597 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !598, size: 64)
!598 = !DICompositeType(tag: DW_TAG_structure_type, name: "ConnectionState", file: !8, line: 11, size: 1408, align: 8, elements: !599)
!599 = !{!600, !601, !602, !603, !604, !605, !606, !607, !774, !779, !784, !785, !786}
!600 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !8, line: 11, baseType: !538, size: 16, align: 16)
!601 = !DIDerivedType(tag: DW_TAG_member, name: "HandshakeComplete", file: !8, line: 11, baseType: !53, size: 8, align: 8, offset: 16)
!602 = !DIDerivedType(tag: DW_TAG_member, name: "DidResume", file: !8, line: 11, baseType: !53, size: 8, align: 8, offset: 24)
!603 = !DIDerivedType(tag: DW_TAG_member, name: "CipherSuite", file: !8, line: 11, baseType: !538, size: 16, align: 16, offset: 32)
!604 = !DIDerivedType(tag: DW_TAG_member, name: "NegotiatedProtocol", file: !8, line: 11, baseType: !57, size: 128, align: 64, offset: 64)
!605 = !DIDerivedType(tag: DW_TAG_member, name: "NegotiatedProtocolIsMutual", file: !8, line: 11, baseType: !53, size: 8, align: 8, offset: 192)
!606 = !DIDerivedType(tag: DW_TAG_member, name: "ServerName", file: !8, line: 11, baseType: !57, size: 128, align: 64, offset: 256)
!607 = !DIDerivedType(tag: DW_TAG_member, name: "PeerCertificates", file: !8, line: 11, baseType: !608, size: 192, align: 64, offset: 384)
!608 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Certificate,int,int}", file: !37, size: 192, align: 8, elements: !609)
!609 = !{!610, !48, !49}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !37, line: 1, baseType: !611, size: 64, align: 64)
!611 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !612, size: 64)
!612 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !613, size: 64)
!613 = !DICompositeType(tag: DW_TAG_structure_type, name: "Certificate", file: !8, line: 11, size: 10624, align: 8, elements: !614)
!614 = !{!615, !616, !617, !618, !619, !620, !621, !623, !625, !629, !630, !643, !669, !670, !704, !705, !707, !717, !718, !723, !729, !730, !731, !732, !733, !734, !735, !736, !737, !738, !739, !740, !748, !753, !754, !755, !756, !767, !768, !769, !770, !771, !772, !773}
!615 = !DIDerivedType(tag: DW_TAG_member, name: "Raw", file: !8, line: 11, baseType: !376, size: 192, align: 64)
!616 = !DIDerivedType(tag: DW_TAG_member, name: "RawTBSCertificate", file: !8, line: 11, baseType: !376, size: 192, align: 64, offset: 192)
!617 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubjectPublicKeyInfo", file: !8, line: 11, baseType: !376, size: 192, align: 64, offset: 384)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "RawSubject", file: !8, line: 11, baseType: !376, size: 192, align: 64, offset: 576)
!619 = !DIDerivedType(tag: DW_TAG_member, name: "RawIssuer", file: !8, line: 11, baseType: !376, size: 192, align: 64, offset: 768)
!620 = !DIDerivedType(tag: DW_TAG_member, name: "Signature", file: !8, line: 11, baseType: !376, size: 192, align: 64, offset: 960)
!621 = !DIDerivedType(tag: DW_TAG_member, name: "SignatureAlgorithm", file: !8, line: 11, baseType: !622, size: 64, align: 64, offset: 1152)
!622 = !DIBasicType(name: "SignatureAlgorithm", size: 64, encoding: DW_ATE_signed)
!623 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKeyAlgorithm", file: !8, line: 11, baseType: !624, size: 64, align: 64, offset: 1216)
!624 = !DIBasicType(name: "PublicKeyAlgorithm", size: 64, encoding: DW_ATE_signed)
!625 = !DIDerivedType(tag: DW_TAG_member, name: "PublicKey", file: !8, line: 11, baseType: !626, size: 128, align: 64, offset: 1280)
!626 = !DICompositeType(tag: DW_TAG_structure_type, name: "any", file: !8, line: 11, size: 128, align: 8, elements: !627)
!627 = !{!628, !564}
!628 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !8, line: 1, baseType: !388, size: 64, align: 64)
!629 = !DIDerivedType(tag: DW_TAG_member, name: "Version", file: !8, line: 11, baseType: !28, size: 64, align: 64, offset: 1408)
!630 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !8, line: 11, baseType: !631, size: 64, align: 64, offset: 1472)
!631 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !632, size: 64)
!632 = !DICompositeType(tag: DW_TAG_structure_type, name: "Int", file: !8, line: 11, size: 256, align: 8, elements: !633)
!633 = !{!634, !635}
!634 = !DIDerivedType(tag: DW_TAG_member, name: "neg", file: !8, line: 11, baseType: !53, size: 8, align: 8)
!635 = !DIDerivedType(tag: DW_TAG_member, name: "abs", file: !8, line: 11, baseType: !636, size: 192, align: 64, offset: 64)
!636 = !DICompositeType(tag: DW_TAG_structure_type, name: ".math/big.nat", file: !8, line: 11, size: 192, align: 8, elements: !637)
!637 = !{!638, !641, !642}
!638 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !639, size: 64, align: 64)
!639 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !640, size: 64)
!640 = !DIBasicType(name: "Word", size: 64, encoding: DW_ATE_unsigned)
!641 = !DIDerivedType(tag: DW_TAG_member, name: "__count", file: !8, line: 1, baseType: !28, size: 64, align: 64, offset: 64)
!642 = !DIDerivedType(tag: DW_TAG_member, name: "__capacity", file: !8, line: 1, baseType: !28, size: 64, align: 64, offset: 128)
!643 = !DIDerivedType(tag: DW_TAG_member, name: "Issuer", file: !8, line: 11, baseType: !644, size: 1984, align: 64, offset: 1536)
!644 = !DICompositeType(tag: DW_TAG_structure_type, name: "Name", file: !8, line: 11, size: 1984, align: 8, elements: !645)
!645 = !{!646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !668}
!646 = !DIDerivedType(tag: DW_TAG_member, name: "Country", file: !8, line: 11, baseType: !580, size: 192, align: 64)
!647 = !DIDerivedType(tag: DW_TAG_member, name: "Organization", file: !8, line: 11, baseType: !580, size: 192, align: 64, offset: 192)
!648 = !DIDerivedType(tag: DW_TAG_member, name: "OrganizationalUnit", file: !8, line: 11, baseType: !580, size: 192, align: 64, offset: 384)
!649 = !DIDerivedType(tag: DW_TAG_member, name: "Locality", file: !8, line: 11, baseType: !580, size: 192, align: 64, offset: 576)
!650 = !DIDerivedType(tag: DW_TAG_member, name: "Province", file: !8, line: 11, baseType: !580, size: 192, align: 64, offset: 768)
!651 = !DIDerivedType(tag: DW_TAG_member, name: "StreetAddress", file: !8, line: 11, baseType: !580, size: 192, align: 64, offset: 960)
!652 = !DIDerivedType(tag: DW_TAG_member, name: "PostalCode", file: !8, line: 11, baseType: !580, size: 192, align: 64, offset: 1152)
!653 = !DIDerivedType(tag: DW_TAG_member, name: "SerialNumber", file: !8, line: 11, baseType: !57, size: 128, align: 64, offset: 1344)
!654 = !DIDerivedType(tag: DW_TAG_member, name: "CommonName", file: !8, line: 11, baseType: !57, size: 128, align: 64, offset: 1472)
!655 = !DIDerivedType(tag: DW_TAG_member, name: "Names", file: !8, line: 11, baseType: !656, size: 192, align: 64, offset: 1600)
!656 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*AttributeTypeAndValue,int,int}", file: !37, size: 192, align: 8, elements: !657)
!657 = !{!658, !48, !49}
!658 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !37, line: 1, baseType: !659, size: 64, align: 64)
!659 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !660, size: 64)
!660 = !DICompositeType(tag: DW_TAG_structure_type, name: "AttributeTypeAndValue", file: !8, line: 11, size: 320, align: 8, elements: !661)
!661 = !{!662, !667}
!662 = !DIDerivedType(tag: DW_TAG_member, name: "Type", file: !8, line: 11, baseType: !663, size: 192, align: 64)
!663 = !DICompositeType(tag: DW_TAG_structure_type, name: "ObjectIdentifier", file: !8, line: 11, size: 192, align: 8, elements: !664)
!664 = !{!665, !641, !642}
!665 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !666, size: 64, align: 64)
!666 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !28, size: 64)
!667 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !8, line: 11, baseType: !626, size: 128, align: 64, offset: 192)
!668 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraNames", file: !8, line: 11, baseType: !656, size: 192, align: 64, offset: 1792)
!669 = !DIDerivedType(tag: DW_TAG_member, name: "Subject", file: !8, line: 11, baseType: !644, size: 1984, align: 64, offset: 3520)
!670 = !DIDerivedType(tag: DW_TAG_member, name: "NotBefore", file: !8, line: 11, baseType: !671, size: 192, align: 64, offset: 5504)
!671 = !DICompositeType(tag: DW_TAG_structure_type, name: "Time", file: !8, line: 5, size: 192, align: 8, elements: !672)
!672 = !{!673, !674, !675}
!673 = !DIDerivedType(tag: DW_TAG_member, name: "wall", file: !8, line: 5, baseType: !23, size: 64, align: 64)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "ext", file: !8, line: 5, baseType: !578, size: 64, align: 64, offset: 64)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "loc", file: !8, line: 5, baseType: !676, size: 64, align: 64, offset: 128)
!676 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !677, size: 64)
!677 = !DICompositeType(tag: DW_TAG_structure_type, name: "Location", file: !8, line: 5, size: 832, align: 8, elements: !678)
!678 = !{!679, !680, !689, !700, !701, !702, !703}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "name", file: !8, line: 5, baseType: !57, size: 128, align: 64)
!680 = !DIDerivedType(tag: DW_TAG_member, name: "zone", file: !8, line: 5, baseType: !681, size: 192, align: 64, offset: 128)
!681 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zone,int,int}", file: !37, size: 192, align: 8, elements: !682)
!682 = !{!683, !48, !49}
!683 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !37, line: 1, baseType: !684, size: 64, align: 64)
!684 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !685, size: 64)
!685 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zone", file: !8, line: 5, size: 256, align: 8, elements: !686)
!686 = !{!679, !687, !688}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "offset", file: !8, line: 5, baseType: !28, size: 64, align: 64, offset: 128)
!688 = !DIDerivedType(tag: DW_TAG_member, name: "isDST", file: !8, line: 5, baseType: !53, size: 8, align: 8, offset: 192)
!689 = !DIDerivedType(tag: DW_TAG_member, name: "tx", file: !8, line: 5, baseType: !690, size: 192, align: 64, offset: 320)
!690 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*.time.zoneTrans,int,int}", file: !37, size: 192, align: 8, elements: !691)
!691 = !{!692, !48, !49}
!692 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !37, line: 1, baseType: !693, size: 64, align: 64)
!693 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !694, size: 64)
!694 = !DICompositeType(tag: DW_TAG_structure_type, name: ".time.zoneTrans", file: !8, line: 5, size: 128, align: 8, elements: !695)
!695 = !{!696, !697, !698, !699}
!696 = !DIDerivedType(tag: DW_TAG_member, name: "when", file: !8, line: 5, baseType: !578, size: 64, align: 64)
!697 = !DIDerivedType(tag: DW_TAG_member, name: "index", file: !8, line: 5, baseType: !45, size: 8, align: 8, offset: 64)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "isstd", file: !8, line: 5, baseType: !53, size: 8, align: 8, offset: 72)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "isutc", file: !8, line: 5, baseType: !53, size: 8, align: 8, offset: 80)
!700 = !DIDerivedType(tag: DW_TAG_member, name: "extend", file: !8, line: 5, baseType: !57, size: 128, align: 64, offset: 512)
!701 = !DIDerivedType(tag: DW_TAG_member, name: "cacheStart", file: !8, line: 5, baseType: !578, size: 64, align: 64, offset: 640)
!702 = !DIDerivedType(tag: DW_TAG_member, name: "cacheEnd", file: !8, line: 5, baseType: !578, size: 64, align: 64, offset: 704)
!703 = !DIDerivedType(tag: DW_TAG_member, name: "cacheZone", file: !8, line: 5, baseType: !684, size: 64, align: 64, offset: 768)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "NotAfter", file: !8, line: 11, baseType: !671, size: 192, align: 64, offset: 5696)
!705 = !DIDerivedType(tag: DW_TAG_member, name: "KeyUsage", file: !8, line: 11, baseType: !706, size: 64, align: 64, offset: 5888)
!706 = !DIBasicType(name: "KeyUsage", size: 64, encoding: DW_ATE_signed)
!707 = !DIDerivedType(tag: DW_TAG_member, name: "Extensions", file: !8, line: 11, baseType: !708, size: 192, align: 64, offset: 5952)
!708 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Extension,int,int}", file: !37, size: 192, align: 8, elements: !709)
!709 = !{!710, !48, !49}
!710 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !37, line: 1, baseType: !711, size: 64, align: 64)
!711 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !712, size: 64)
!712 = !DICompositeType(tag: DW_TAG_structure_type, name: "Extension", file: !8, line: 11, size: 448, align: 8, elements: !713)
!713 = !{!714, !715, !716}
!714 = !DIDerivedType(tag: DW_TAG_member, name: "Id", file: !8, line: 11, baseType: !663, size: 192, align: 64)
!715 = !DIDerivedType(tag: DW_TAG_member, name: "Critical", file: !8, line: 11, baseType: !53, size: 8, align: 8, offset: 192)
!716 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !8, line: 11, baseType: !376, size: 192, align: 64, offset: 256)
!717 = !DIDerivedType(tag: DW_TAG_member, name: "ExtraExtensions", file: !8, line: 11, baseType: !708, size: 192, align: 64, offset: 6144)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "UnhandledCriticalExtensions", file: !8, line: 11, baseType: !719, size: 192, align: 64, offset: 6336)
!719 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ObjectIdentifier,int,int}", file: !37, size: 192, align: 8, elements: !720)
!720 = !{!721, !48, !49}
!721 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !37, line: 1, baseType: !722, size: 64, align: 64)
!722 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !663, size: 64)
!723 = !DIDerivedType(tag: DW_TAG_member, name: "ExtKeyUsage", file: !8, line: 11, baseType: !724, size: 192, align: 64, offset: 6528)
!724 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*ExtKeyUsage,int,int}", file: !37, size: 192, align: 8, elements: !725)
!725 = !{!726, !48, !49}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !37, line: 1, baseType: !727, size: 64, align: 64)
!727 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !728, size: 64)
!728 = !DIBasicType(name: "ExtKeyUsage", size: 64, encoding: DW_ATE_signed)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "UnknownExtKeyUsage", file: !8, line: 11, baseType: !719, size: 192, align: 64, offset: 6720)
!730 = !DIDerivedType(tag: DW_TAG_member, name: "BasicConstraintsValid", file: !8, line: 11, baseType: !53, size: 8, align: 8, offset: 6912)
!731 = !DIDerivedType(tag: DW_TAG_member, name: "IsCA", file: !8, line: 11, baseType: !53, size: 8, align: 8, offset: 6920)
!732 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLen", file: !8, line: 11, baseType: !28, size: 64, align: 64, offset: 6976)
!733 = !DIDerivedType(tag: DW_TAG_member, name: "MaxPathLenZero", file: !8, line: 11, baseType: !53, size: 8, align: 8, offset: 7040)
!734 = !DIDerivedType(tag: DW_TAG_member, name: "SubjectKeyId", file: !8, line: 11, baseType: !376, size: 192, align: 64, offset: 7104)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "AuthorityKeyId", file: !8, line: 11, baseType: !376, size: 192, align: 64, offset: 7296)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPServer", file: !8, line: 11, baseType: !580, size: 192, align: 64, offset: 7488)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "IssuingCertificateURL", file: !8, line: 11, baseType: !580, size: 192, align: 64, offset: 7680)
!738 = !DIDerivedType(tag: DW_TAG_member, name: "DNSNames", file: !8, line: 11, baseType: !580, size: 192, align: 64, offset: 7872)
!739 = !DIDerivedType(tag: DW_TAG_member, name: "EmailAddresses", file: !8, line: 11, baseType: !580, size: 192, align: 64, offset: 8064)
!740 = !DIDerivedType(tag: DW_TAG_member, name: "IPAddresses", file: !8, line: 11, baseType: !741, size: 192, align: 64, offset: 8256)
!741 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*IP,int,int}", file: !37, size: 192, align: 8, elements: !742)
!742 = !{!743, !48, !49}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !37, line: 1, baseType: !744, size: 64, align: 64)
!744 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !745, size: 64)
!745 = !DICompositeType(tag: DW_TAG_structure_type, name: "IP", file: !8, line: 11, size: 192, align: 8, elements: !746)
!746 = !{!747, !641, !642}
!747 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !8, line: 1, baseType: !44, size: 64, align: 64)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "URIs", file: !8, line: 11, baseType: !749, size: 192, align: 64, offset: 8448)
!749 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**URL,int,int}", file: !37, size: 192, align: 8, elements: !750)
!750 = !{!751, !48, !49}
!751 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !37, line: 1, baseType: !752, size: 64, align: 64)
!752 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !508, size: 64)
!753 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomainsCritical", file: !8, line: 11, baseType: !53, size: 8, align: 8, offset: 8640)
!754 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedDNSDomains", file: !8, line: 11, baseType: !580, size: 192, align: 64, offset: 8704)
!755 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedDNSDomains", file: !8, line: 11, baseType: !580, size: 192, align: 64, offset: 8896)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedIPRanges", file: !8, line: 11, baseType: !757, size: 192, align: 64, offset: 9088)
!757 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**IPNet,int,int}", file: !37, size: 192, align: 8, elements: !758)
!758 = !{!759, !48, !49}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !37, line: 1, baseType: !760, size: 64, align: 64)
!760 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !761, size: 64)
!761 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !762, size: 64)
!762 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPNet", file: !8, line: 11, size: 384, align: 8, elements: !763)
!763 = !{!764, !765}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "IP", file: !8, line: 11, baseType: !745, size: 192, align: 64)
!765 = !DIDerivedType(tag: DW_TAG_member, name: "Mask", file: !8, line: 11, baseType: !766, size: 192, align: 64, offset: 192)
!766 = !DICompositeType(tag: DW_TAG_structure_type, name: "IPMask", file: !8, line: 11, size: 192, align: 8, elements: !746)
!767 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedIPRanges", file: !8, line: 11, baseType: !757, size: 192, align: 64, offset: 9280)
!768 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedEmailAddresses", file: !8, line: 11, baseType: !580, size: 192, align: 64, offset: 9472)
!769 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedEmailAddresses", file: !8, line: 11, baseType: !580, size: 192, align: 64, offset: 9664)
!770 = !DIDerivedType(tag: DW_TAG_member, name: "PermittedURIDomains", file: !8, line: 11, baseType: !580, size: 192, align: 64, offset: 9856)
!771 = !DIDerivedType(tag: DW_TAG_member, name: "ExcludedURIDomains", file: !8, line: 11, baseType: !580, size: 192, align: 64, offset: 10048)
!772 = !DIDerivedType(tag: DW_TAG_member, name: "CRLDistributionPoints", file: !8, line: 11, baseType: !580, size: 192, align: 64, offset: 10240)
!773 = !DIDerivedType(tag: DW_TAG_member, name: "PolicyIdentifiers", file: !8, line: 11, baseType: !719, size: 192, align: 64, offset: 10432)
!774 = !DIDerivedType(tag: DW_TAG_member, name: "VerifiedChains", file: !8, line: 11, baseType: !775, size: 192, align: 64, offset: 576)
!775 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{**Certificate,int,int},int,int}", file: !37, size: 192, align: 8, elements: !776)
!776 = !{!777, !48, !49}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !37, line: 1, baseType: !778, size: 64, align: 64)
!778 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !608, size: 64)
!779 = !DIDerivedType(tag: DW_TAG_member, name: "SignedCertificateTimestamps", file: !8, line: 11, baseType: !780, size: 192, align: 64, offset: 768)
!780 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*struct{*uint8,int,int},int,int}", file: !37, size: 192, align: 8, elements: !781)
!781 = !{!782, !48, !49}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !37, line: 1, baseType: !783, size: 64, align: 64)
!783 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !376, size: 64)
!784 = !DIDerivedType(tag: DW_TAG_member, name: "OCSPResponse", file: !8, line: 11, baseType: !376, size: 192, align: 64, offset: 960)
!785 = !DIDerivedType(tag: DW_TAG_member, name: "TLSUnique", file: !8, line: 11, baseType: !376, size: 192, align: 64, offset: 1152)
!786 = !DIDerivedType(tag: DW_TAG_member, name: "ekm", file: !8, line: 11, baseType: !787, size: 64, align: 64, offset: 1344)
!787 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !788, size: 64)
!788 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !8, line: 11, size: 64, align: 8, elements: !789)
!789 = !{!790}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !8, line: 11, baseType: !791, size: 64, align: 64)
!791 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !792, size: 64)
!792 = !DISubroutineType(types: !793)
!793 = !{!794, !57, !376, !28}
!794 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{struct{*uint8,int,int},error}", file: !37, size: 320, align: 8, elements: !795)
!795 = !{!796, !797}
!796 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !37, line: 11, baseType: !376, size: 192, align: 64)
!797 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !37, line: 11, baseType: !381, size: 128, align: 64, offset: 192)
!798 = !DIDerivedType(tag: DW_TAG_member, name: "Cancel", file: !8, line: 11, baseType: !799, size: 64, align: 64, offset: 1728)
!799 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !800, size: 64)
!800 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_channel", file: !58, line: 1, align: 1, elements: !69)
!801 = !DIDerivedType(tag: DW_TAG_member, name: "Response", file: !8, line: 11, baseType: !802, size: 64, align: 64, offset: 1792)
!802 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !803, size: 64)
!803 = !DICompositeType(tag: DW_TAG_structure_type, name: "Response", file: !8, line: 11, size: 1152, align: 8, elements: !804)
!804 = !{!805, !806, !527, !528, !529, !530, !544, !807, !808, !809, !810, !811, !812, !813}
!805 = !DIDerivedType(tag: DW_TAG_member, name: "Status", file: !8, line: 11, baseType: !57, size: 128, align: 64)
!806 = !DIDerivedType(tag: DW_TAG_member, name: "StatusCode", file: !8, line: 11, baseType: !28, size: 64, align: 64, offset: 128)
!807 = !DIDerivedType(tag: DW_TAG_member, name: "ContentLength", file: !8, line: 11, baseType: !578, size: 64, align: 64, offset: 640)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "TransferEncoding", file: !8, line: 11, baseType: !580, size: 192, align: 64, offset: 704)
!809 = !DIDerivedType(tag: DW_TAG_member, name: "Close", file: !8, line: 11, baseType: !53, size: 8, align: 8, offset: 896)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "Uncompressed", file: !8, line: 11, baseType: !53, size: 8, align: 8, offset: 904)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "Trailer", file: !8, line: 11, baseType: !531, size: 64, align: 64, offset: 960)
!812 = !DIDerivedType(tag: DW_TAG_member, name: "Request", file: !8, line: 11, baseType: !110, size: 64, align: 64, offset: 1024)
!813 = !DIDerivedType(tag: DW_TAG_member, name: "TLS", file: !8, line: 11, baseType: !597, size: 64, align: 64, offset: 1088)
!814 = !DIDerivedType(tag: DW_TAG_member, name: "ctx", file: !8, line: 11, baseType: !815, size: 128, align: 64, offset: 1856)
!815 = !DICompositeType(tag: DW_TAG_structure_type, name: "Context", file: !8, line: 11, size: 128, align: 8, elements: !816)
!816 = !{!817, !564}
!817 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 11, baseType: !818, size: 64, align: 64)
!818 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !819, size: 64)
!819 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void)struct{Time,bool},*func(*void).net/http.http2closeWaiter,*func(*void)error,*func(*void,any)any}", file: !37, size: 320, align: 8, elements: !820)
!820 = !{!821, !822, !830, !834, !835}
!821 = !DIDerivedType(tag: DW_TAG_member, name: "__type_descriptor", file: !37, line: 11, baseType: !388, size: 64, align: 64)
!822 = !DIDerivedType(tag: DW_TAG_member, name: "Deadline", file: !37, line: 11, baseType: !823, size: 64, align: 64, offset: 64)
!823 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !824, size: 64)
!824 = !DISubroutineType(types: !825)
!825 = !{!826, !110}
!826 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{Time,bool}", file: !37, size: 256, align: 8, elements: !827)
!827 = !{!828, !829}
!828 = !DIDerivedType(tag: DW_TAG_member, name: "deadline", file: !37, line: 11, baseType: !671, size: 192, align: 64)
!829 = !DIDerivedType(tag: DW_TAG_member, name: "ok", file: !37, line: 11, baseType: !53, size: 8, align: 8, offset: 192)
!830 = !DIDerivedType(tag: DW_TAG_member, name: "Done", file: !37, line: 11, baseType: !831, size: 64, align: 64, offset: 128)
!831 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !832, size: 64)
!832 = !DISubroutineType(types: !833)
!833 = !{!799, !110}
!834 = !DIDerivedType(tag: DW_TAG_member, name: "Err", file: !37, line: 11, baseType: !553, size: 64, align: 64, offset: 192)
!835 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !37, line: 11, baseType: !836, size: 64, align: 64, offset: 256)
!836 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !837, size: 64)
!837 = !DISubroutineType(types: !838)
!838 = !{!626, !110, !626}
!839 = !DILocation(line: 52, column: 3, scope: !468)
!840 = !DILocalVariable(name: "err", scope: !478, file: !8, line: 52, type: !381)
!841 = !DILocation(line: 54, column: 3, scope: !478)
!842 = !DILocation(line: 54, column: 6, scope: !478)
!843 = !DILocation(line: 54, column: 13, scope: !478)
!844 = !DILocation(line: 55, column: 41, scope: !478)
!845 = !DILocation(line: 55, column: 3, scope: !478)
!846 = !DILocation(line: 55, column: 6, scope: !478)
!847 = !DILocation(line: 55, column: 13, scope: !478)
!848 = !DILocation(line: 58, column: 13, scope: !478)
!849 = !DILocalVariable(name: "client", scope: !478, file: !8, line: 58, type: !850)
!850 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !851, size: 64)
!851 = !DICompositeType(tag: DW_TAG_structure_type, name: "Client", file: !8, line: 11, size: 384, align: 8, elements: !852)
!852 = !{!853, !868, !880, !915}
!853 = !DIDerivedType(tag: DW_TAG_member, name: "Transport", file: !8, line: 11, baseType: !854, size: 128, align: 64)
!854 = !DICompositeType(tag: DW_TAG_structure_type, name: "RoundTripper", file: !8, line: 11, size: 128, align: 8, elements: !855)
!855 = !{!856, !564}
!856 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 11, baseType: !857, size: 64, align: 64)
!857 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !858, size: 64)
!858 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,*Request)struct{*Response,error}}", file: !37, size: 128, align: 8, elements: !859)
!859 = !{!821, !860}
!860 = !DIDerivedType(tag: DW_TAG_member, name: "RoundTrip", file: !37, line: 11, baseType: !861, size: 64, align: 64, offset: 64)
!861 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !862, size: 64)
!862 = !DISubroutineType(types: !863)
!863 = !{!864, !110, !503}
!864 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*Response,error}", file: !37, size: 192, align: 8, elements: !865)
!865 = !{!866, !867}
!866 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !37, line: 11, baseType: !802, size: 64, align: 64)
!867 = !DIDerivedType(tag: DW_TAG_member, name: "UNNAMED", file: !37, line: 11, baseType: !381, size: 128, align: 64, offset: 64)
!868 = !DIDerivedType(tag: DW_TAG_member, name: "CheckRedirect", file: !8, line: 11, baseType: !869, size: 64, align: 64, offset: 128)
!869 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !870, size: 64)
!870 = !DICompositeType(tag: DW_TAG_structure_type, name: "__go_descriptor", file: !8, line: 11, size: 64, align: 8, elements: !871)
!871 = !{!872}
!872 = !DIDerivedType(tag: DW_TAG_member, name: "code", file: !8, line: 11, baseType: !873, size: 64, align: 64)
!873 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !874, size: 64)
!874 = !DISubroutineType(types: !875)
!875 = !{!381, !503, !876}
!876 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Request,int,int}", file: !37, size: 192, align: 8, elements: !877)
!877 = !{!878, !48, !49}
!878 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !37, line: 1, baseType: !879, size: 64, align: 64)
!879 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !503, size: 64)
!880 = !DIDerivedType(tag: DW_TAG_member, name: "Jar", file: !8, line: 11, baseType: !881, size: 128, align: 64, offset: 192)
!881 = !DICompositeType(tag: DW_TAG_structure_type, name: "CookieJar", file: !8, line: 11, size: 128, align: 8, elements: !882)
!882 = !{!883, !564}
!883 = !DIDerivedType(tag: DW_TAG_member, name: "__methods", file: !8, line: 11, baseType: !884, size: 64, align: 64)
!884 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !885, size: 64)
!885 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{*_type,*func(*void,*URL)struct{**Cookie,int,int},*func(*void,*URL,struct{**Cookie,int,int})void}", file: !37, size: 192, align: 8, elements: !886)
!886 = !{!821, !887, !911}
!887 = !DIDerivedType(tag: DW_TAG_member, name: "Cookies", file: !37, line: 11, baseType: !888, size: 64, align: 64, offset: 64)
!888 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !889, size: 64)
!889 = !DISubroutineType(types: !890)
!890 = !{!891, !110, !508}
!891 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{**Cookie,int,int}", file: !37, size: 192, align: 8, elements: !892)
!892 = !{!893, !48, !49}
!893 = !DIDerivedType(tag: DW_TAG_member, name: "__values", file: !37, line: 1, baseType: !894, size: 64, align: 64)
!894 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !895, size: 64)
!895 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !896, size: 64)
!896 = !DICompositeType(tag: DW_TAG_structure_type, name: "Cookie", file: !8, line: 11, size: 1344, align: 8, elements: !897)
!897 = !{!898, !899, !900, !901, !902, !903, !904, !905, !906, !907, !909, !910}
!898 = !DIDerivedType(tag: DW_TAG_member, name: "Name", file: !8, line: 11, baseType: !57, size: 128, align: 64)
!899 = !DIDerivedType(tag: DW_TAG_member, name: "Value", file: !8, line: 11, baseType: !57, size: 128, align: 64, offset: 128)
!900 = !DIDerivedType(tag: DW_TAG_member, name: "Path", file: !8, line: 11, baseType: !57, size: 128, align: 64, offset: 256)
!901 = !DIDerivedType(tag: DW_TAG_member, name: "Domain", file: !8, line: 11, baseType: !57, size: 128, align: 64, offset: 384)
!902 = !DIDerivedType(tag: DW_TAG_member, name: "Expires", file: !8, line: 11, baseType: !671, size: 192, align: 64, offset: 512)
!903 = !DIDerivedType(tag: DW_TAG_member, name: "RawExpires", file: !8, line: 11, baseType: !57, size: 128, align: 64, offset: 704)
!904 = !DIDerivedType(tag: DW_TAG_member, name: "MaxAge", file: !8, line: 11, baseType: !28, size: 64, align: 64, offset: 832)
!905 = !DIDerivedType(tag: DW_TAG_member, name: "Secure", file: !8, line: 11, baseType: !53, size: 8, align: 8, offset: 896)
!906 = !DIDerivedType(tag: DW_TAG_member, name: "HttpOnly", file: !8, line: 11, baseType: !53, size: 8, align: 8, offset: 904)
!907 = !DIDerivedType(tag: DW_TAG_member, name: "SameSite", file: !8, line: 11, baseType: !908, size: 64, align: 64, offset: 960)
!908 = !DIBasicType(name: "SameSite", size: 64, encoding: DW_ATE_signed)
!909 = !DIDerivedType(tag: DW_TAG_member, name: "Raw", file: !8, line: 11, baseType: !57, size: 128, align: 64, offset: 1024)
!910 = !DIDerivedType(tag: DW_TAG_member, name: "Unparsed", file: !8, line: 11, baseType: !580, size: 192, align: 64, offset: 1152)
!911 = !DIDerivedType(tag: DW_TAG_member, name: "SetCookies", file: !37, line: 11, baseType: !912, size: 64, align: 64, offset: 128)
!912 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !913, size: 64)
!913 = !DISubroutineType(types: !914)
!914 = !{!111, !110, !508, !891}
!915 = !DIDerivedType(tag: DW_TAG_member, name: "Timeout", file: !8, line: 11, baseType: !916, size: 64, align: 64, offset: 320)
!916 = !DIBasicType(name: "Duration", size: 64, encoding: DW_ATE_signed)
!917 = !DILocation(line: 58, column: 3, scope: !468)
!918 = !DILocation(line: 59, column: 16, scope: !478)
!919 = !DILocation(line: 59, column: 26, scope: !478)
!920 = !DILocation(line: 59, column: 22, scope: !478)
!921 = !DILocalVariable(name: "resp", scope: !478, file: !8, line: 59, type: !802)
!922 = !DILocation(line: 59, column: 3, scope: !468)
!923 = !DILocation(line: 59, column: 3, scope: !478)
!924 = !DILocation(line: 60, column: 10, scope: !478)
!925 = !DILocation(line: 60, column: 3, scope: !478)
!926 = !DILocation(line: 61, column: 48, scope: !478)
!927 = !DILocation(line: 64, column: 3, scope: !478)
!928 = !DILocation(line: 64, column: 9, scope: !478)
!929 = !DILocation(line: 64, column: 13, scope: !478)
!930 = !DILocation(line: 61, column: 9, scope: !478)
!931 = !DILocation(line: 62, column: 8, scope: !478)
!932 = !DILocation(line: 67, column: 31, scope: !478)
!933 = !DILocation(line: 67, column: 35, scope: !478)
!934 = !DILocation(line: 67, column: 23, scope: !478)
!935 = !DILocalVariable(name: "body", scope: !478, file: !8, line: 67, type: !376)
!936 = !DILocation(line: 67, column: 3, scope: !468)
!937 = !DILocation(line: 67, column: 3, scope: !478)
!938 = !DILocation(line: 68, column: 10, scope: !478)
!939 = !DILocation(line: 68, column: 3, scope: !478)
!940 = !DILocation(line: 69, column: 49, scope: !478)
!941 = !DILocation(line: 72, column: 10, scope: !478)
!942 = !DILocation(line: 69, column: 9, scope: !478)
!943 = !DILocation(line: 70, column: 8, scope: !478)
!944 = !DILocation(line: 72, column: 3, scope: !478)
!945 = !DILocation(line: 72, column: 3, scope: !468)
!946 = distinct !DISubprogram(name: "main.go..thunk0", scope: null, file: !8, line: 64, type: !947, scopeLine: 64, spFlags: DISPFlagLocalToUnit | DISPFlagDefinition, unit: !3, retainedNodes: !69)
!947 = !DISubroutineType(types: !948)
!948 = !{!53, !949}
!949 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !950, size: 64)
!950 = !DICompositeType(tag: DW_TAG_structure_type, name: "struct{ReadCloser}", file: !37, size: 128, align: 8, elements: !951)
!951 = !{!952}
!952 = !DIDerivedType(tag: DW_TAG_member, name: "object", file: !37, line: 64, baseType: !545, size: 128, align: 64)
!953 = !DILocalVariable(name: "__go_thunk_parameter", arg: 1, scope: !946, file: !8, line: 64, type: !949)
!954 = !DILocation(line: 64, column: 3, scope: !946)
!955 = !DILocalVariable(name: "$ret4", scope: !946, file: !8, line: 64, type: !53)
!956 = distinct !DISubprogram(name: "main.main", scope: null, file: !8, line: 75, type: !351, scopeLine: 75, spFlags: DISPFlagDefinition, unit: !3, retainedNodes: !69)
!957 = !DILocation(line: 76, column: 12, scope: !958)
!958 = distinct !DILexicalBlock(scope: !956, file: !8, line: 75, column: 1)
!959 = !DILocalVariable(name: "input", scope: !958, file: !8, line: 76, type: !57)
!960 = !DILocation(line: 76, column: 3, scope: !956)
!961 = !DILocation(line: 77, column: 7, scope: !958)
!962 = !DILocalVariable(name: "request", scope: !958, file: !8, line: 77, type: !963)
!963 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !964, size: 64)
!964 = !DICompositeType(tag: DW_TAG_structure_type, name: "Request", file: !8, line: 20, size: 128, align: 8, elements: !965)
!965 = !{!966}
!966 = !DIDerivedType(tag: DW_TAG_member, name: "Msg", file: !8, line: 21, baseType: !57, size: 128, align: 64)
