; ModuleID = 'function-4ae85c4c1c3eb68f.bc'
source_filename = "bah3d6oc870hlqxhmmr16jhmm"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"core::sync::atomic::AtomicUsize" = type { i64 }
%"r2d2::IdleConn<memcache::connection::Connection>" = type { %"r2d2::Conn<memcache::connection::Connection>", %"std::time::Instant" }
%"r2d2::Conn<memcache::connection::Connection>" = type { %"memcache::connection::Connection", %"std::time::Instant", %"r2d2::extensions::Extensions", i64 }
%"memcache::connection::Connection" = type { %"memcache::protocol::Protocol", ptr }
%"memcache::protocol::Protocol" = type { i64, [263 x i64] }
%"r2d2::extensions::Extensions" = type { %"std::collections::hash::map::HashMap<core::any::TypeId, alloc::boxed::Box<dyn core::any::Any + core::marker::Send + core::marker::Sync>>" }
%"std::collections::hash::map::HashMap<core::any::TypeId, alloc::boxed::Box<dyn core::any::Any + core::marker::Send + core::marker::Sync>>" = type { %"hashbrown::map::HashMap<core::any::TypeId, alloc::boxed::Box<dyn core::any::Any + core::marker::Send + core::marker::Sync>, std::hash::random::RandomState>" }

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<serde::de::impls::{impl#56}::deserialize::PrimitiveVisitor as serde::de::Expected>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<serde::de::impls::{impl#56}::deserialize::PrimitiveVisitor as serde::de::Expected>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !12, templateParams: !18, identifier: "bc8358024366add23617eb1d946d1755")
!4 = !{!5, !8, !10, !11}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PrimitiveVisitor", scope: !13, file: !2, align: 8, flags: DIFlagProtected, elements: !18, identifier: "8b5be6b7c0d093cd9ec85716a338406e")
!13 = !DINamespace(name: "deserialize", scope: !14)
!14 = !DINamespace(name: "{impl#56}", scope: !15)
!15 = !DINamespace(name: "impls", scope: !16)
!16 = !DINamespace(name: "de", scope: !17)
!17 = !DINamespace(name: "serde", scope: null)
!18 = !{}
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(name: "<&str as serde::de::Expected>::{vtable}", scope: null, file: !2, type: !21, isLocal: true, isDefinition: true)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<&str as serde::de::Expected>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !22, vtableHolder: !27, templateParams: !18, identifier: "3815d024eae868f9a000d477161154c")
!22 = !{!23, !24, !25, !26}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !21, file: !2, baseType: !6, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !21, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !21, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !21, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !28, templateParams: !18, identifier: "9277eecd40495f85161460476aacc992")
!28 = !{!29, !32}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !27, file: !2, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64, dwarfAddressSpace: 0)
!31 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !27, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "<r2d2::{impl#5}::new_inner::{closure_env#0}<memcache::connection::ConnectionManager> as core::ops::function::FnMut<()>>::{vtable}", scope: null, file: !2, type: !35, isLocal: true, isDefinition: true)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<r2d2::{impl#5}::new_inner::{closure_env#0}<memcache::connection::ConnectionManager> as core::ops::function::FnMut<()>>::{vtable_type}", file: !2, size: 320, align: 64, flags: DIFlagArtificial, elements: !36, vtableHolder: !42, templateParams: !18, identifier: "c6a7edca0cc78b17eb1eb21cf288a8c6")
!36 = !{!37, !38, !39, !40, !41}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !35, file: !2, baseType: !6, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !35, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !35, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !35, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !35, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!42 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<memcache::connection::ConnectionManager>", scope: !43, file: !2, size: 64, align: 64, elements: !46, templateParams: !18, identifier: "d5ee77495a5fb4a022e55cd9956ec980")
!43 = !DINamespace(name: "new_inner", scope: !44)
!44 = !DINamespace(name: "{impl#5}", scope: !45)
!45 = !DINamespace(name: "r2d2", scope: null)
!46 = !{!47}
!47 = !DIDerivedType(tag: DW_TAG_member, name: "s", scope: !42, file: !2, baseType: !48, size: 64, align: 64)
!48 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Weak<r2d2::SharedPool<memcache::connection::ConnectionManager>, alloc::alloc::Global>", scope: !49, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !51, templateParams: !1169, identifier: "929db7508dfd2ddd391b19ef8c71965")
!49 = !DINamespace(name: "sync", scope: !50)
!50 = !DINamespace(name: "alloc", scope: null)
!51 = !{!52, !1168}
!52 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !48, file: !2, baseType: !53, size: 64, align: 64, flags: DIFlagPrivate)
!53 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<r2d2::SharedPool<memcache::connection::ConnectionManager>>>", scope: !54, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !57, templateParams: !1166, identifier: "c3ca3c2e59bcfa12d3831d616a9d744e")
!54 = !DINamespace(name: "non_null", scope: !55)
!55 = !DINamespace(name: "ptr", scope: !56)
!56 = !DINamespace(name: "core", scope: null)
!57 = !{!58}
!58 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !53, file: !2, baseType: !59, size: 64, align: 64, flags: DIFlagPrivate)
!59 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<r2d2::SharedPool<memcache::connection::ConnectionManager>>", baseType: !60, size: 64, align: 64, dwarfAddressSpace: 0)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<r2d2::SharedPool<memcache::connection::ConnectionManager>>", scope: !49, file: !2, size: 2368, align: 64, flags: DIFlagPrivate, elements: !61, templateParams: !1164, identifier: "36de85c398d2342649737dae2652f2c3")
!61 = !{!62, !74, !75}
!62 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !60, file: !2, baseType: !63, size: 64, align: 64, flags: DIFlagPrivate)
!63 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !64, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !66, templateParams: !18, identifier: "7895742ee1c683d59df9ab63ad4ac5e3")
!64 = !DINamespace(name: "atomic", scope: !65)
!65 = !DINamespace(name: "sync", scope: !56)
!66 = !{!67}
!67 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !63, file: !2, baseType: !68, size: 64, align: 64, flags: DIFlagPrivate)
!68 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !69, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !70, templateParams: !72, identifier: "b2c1878745bff3418ec36c32186fb94c")
!69 = !DINamespace(name: "cell", scope: !56)
!70 = !{!71}
!71 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !68, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!72 = !{!73}
!73 = !DITemplateTypeParameter(name: "T", type: !9)
!74 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !60, file: !2, baseType: !63, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!75 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !60, file: !2, baseType: !76, size: 2240, align: 64, offset: 128, flags: DIFlagPrivate)
!76 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SharedPool<memcache::connection::ConnectionManager>", scope: !45, file: !2, size: 2240, align: 64, flags: DIFlagPrivate, elements: !77, templateParams: !1162, identifier: "b1959e6c47a20138d6116f5c993f95")
!77 = !{!78, !1001, !1060, !1161}
!78 = !DIDerivedType(tag: DW_TAG_member, name: "config", scope: !76, file: !2, baseType: !79, size: 960, align: 64, offset: 704, flags: DIFlagPrivate)
!79 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Config<memcache::connection::Connection, memcache::error::MemcacheError>", scope: !80, file: !2, size: 960, align: 64, flags: DIFlagPublic, elements: !81, templateParams: !397, identifier: "7cc6197a9fb7b546105ba2f9814a4f0e")
!80 = !DINamespace(name: "config", scope: !45)
!81 = !{!82, !84, !99, !101, !124, !125, !126, !137, !148, !159}
!82 = !DIDerivedType(tag: DW_TAG_member, name: "max_size", scope: !79, file: !2, baseType: !83, size: 32, align: 32, offset: 896, flags: DIFlagPublic)
!83 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!84 = !DIDerivedType(tag: DW_TAG_member, name: "min_idle", scope: !79, file: !2, baseType: !85, size: 64, align: 32, flags: DIFlagPublic)
!85 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Option<u32>", scope: !86, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !87, templateParams: !18, identifier: "55fc6c4dde7c62b0a183181b02e2498")
!86 = !DINamespace(name: "option", scope: !56)
!87 = !{!88}
!88 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !85, file: !2, size: 64, align: 32, elements: !89, templateParams: !18, identifier: "d645b803ce9223497d1caa2a55629086", discriminator: !98)
!89 = !{!90, !94}
!90 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !88, file: !2, baseType: !91, size: 64, align: 32, extraData: i128 0)
!91 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !85, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !18, templateParams: !92, identifier: "d065303923dc0a063c5c1e2f6770865")
!92 = !{!93}
!93 = !DITemplateTypeParameter(name: "T", type: !83)
!94 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !88, file: !2, baseType: !95, size: 64, align: 32, extraData: i128 1)
!95 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !85, file: !2, size: 64, align: 32, flags: DIFlagPublic, elements: !96, templateParams: !92, identifier: "473fb4baf38bf1efce56fe369292b35c")
!96 = !{!97}
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !95, file: !2, baseType: !83, size: 32, align: 32, offset: 32, flags: DIFlagPublic)
!98 = !DIDerivedType(tag: DW_TAG_member, scope: !85, file: !2, baseType: !83, size: 32, align: 32, flags: DIFlagArtificial)
!99 = !DIDerivedType(tag: DW_TAG_member, name: "test_on_check_out", scope: !79, file: !2, baseType: !100, size: 8, align: 8, offset: 928, flags: DIFlagPublic)
!100 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!101 = !DIDerivedType(tag: DW_TAG_member, name: "max_lifetime", scope: !79, file: !2, baseType: !102, size: 128, align: 64, offset: 192, flags: DIFlagPublic)
!102 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Option<core::time::Duration>", scope: !86, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !103, templateParams: !18, identifier: "8a32a6301ae3e8bc5949ab16de397a6")
!103 = !{!104}
!104 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !102, file: !2, size: 128, align: 64, elements: !105, templateParams: !18, identifier: "b21154ee5a0f6f1bd698897c3afaeb5b", discriminator: !123)
!105 = !{!106, !119}
!106 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !104, file: !2, baseType: !107, size: 128, align: 64, extraData: i128 1000000000)
!107 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !102, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !18, templateParams: !108, identifier: "4a0cf8ba902711c8afc4218f444eab5a")
!108 = !{!109}
!109 = !DITemplateTypeParameter(name: "T", type: !110)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Duration", scope: !111, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !112, templateParams: !18, identifier: "c1ffe30556db38ab290d78033b2c36c1")
!111 = !DINamespace(name: "time", scope: !56)
!112 = !{!113, !115}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "secs", scope: !110, file: !2, baseType: !114, size: 64, align: 64, flags: DIFlagPrivate)
!114 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!115 = !DIDerivedType(tag: DW_TAG_member, name: "nanos", scope: !110, file: !2, baseType: !116, size: 32, align: 32, offset: 64, flags: DIFlagPrivate)
!116 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Nanoseconds", scope: !111, file: !2, size: 32, align: 32, flags: DIFlagPrivate, elements: !117, templateParams: !18, identifier: "500152f77ad55c472244fd42617e910")
!117 = !{!118}
!118 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !116, file: !2, baseType: !83, size: 32, align: 32, flags: DIFlagPrivate)
!119 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !104, file: !2, baseType: !120, size: 128, align: 64)
!120 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !102, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !121, templateParams: !108, identifier: "a898865e959b063811f38922c505780f")
!121 = !{!122}
!122 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !120, file: !2, baseType: !110, size: 128, align: 64, flags: DIFlagPublic)
!123 = !DIDerivedType(tag: DW_TAG_member, scope: !102, file: !2, baseType: !83, size: 32, align: 32, offset: 64, flags: DIFlagArtificial)
!124 = !DIDerivedType(tag: DW_TAG_member, name: "idle_timeout", scope: !79, file: !2, baseType: !102, size: 128, align: 64, offset: 320, flags: DIFlagPublic)
!125 = !DIDerivedType(tag: DW_TAG_member, name: "connection_timeout", scope: !79, file: !2, baseType: !110, size: 128, align: 64, offset: 64, flags: DIFlagPublic)
!126 = !DIDerivedType(tag: DW_TAG_member, name: "error_handler", scope: !79, file: !2, baseType: !127, size: 128, align: 64, offset: 448, flags: DIFlagPublic)
!127 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<dyn r2d2::HandleError<memcache::error::MemcacheError>, alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !128, templateParams: !18, identifier: "a67c8a953c88c451dd3ca1b8ec98d93")
!128 = !{!129, !132}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !127, file: !2, baseType: !130, size: 64, align: 64)
!130 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !131, size: 64, align: 64, dwarfAddressSpace: 0)
!131 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dyn r2d2::HandleError<memcache::error::MemcacheError>", file: !2, align: 8, elements: !18, identifier: "59f87859a38a51ac8930b1c5ced5a991")
!132 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !127, file: !2, baseType: !133, size: 64, align: 64, offset: 64)
!133 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 5]", baseType: !134, size: 64, align: 64, dwarfAddressSpace: 0)
!134 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 320, align: 64, elements: !135)
!135 = !{!136}
!136 = !DISubrange(count: 5, lowerBound: 0)
!137 = !DIDerivedType(tag: DW_TAG_member, name: "event_handler", scope: !79, file: !2, baseType: !138, size: 128, align: 64, offset: 576, flags: DIFlagPublic)
!138 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<dyn r2d2::event::HandleEvent, alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !139, templateParams: !18, identifier: "dcd6a4fa2ca67ed124b884240bc9b8b4")
!139 = !{!140, !143}
!140 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !138, file: !2, baseType: !141, size: 64, align: 64)
!141 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !142, size: 64, align: 64, dwarfAddressSpace: 0)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dyn r2d2::event::HandleEvent", file: !2, align: 8, elements: !18, identifier: "43887f33caf31a8b8e18cd8e69cb5170")
!143 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !138, file: !2, baseType: !144, size: 64, align: 64, offset: 64)
!144 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 9]", baseType: !145, size: 64, align: 64, dwarfAddressSpace: 0)
!145 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 576, align: 64, elements: !146)
!146 = !{!147}
!147 = !DISubrange(count: 9, lowerBound: 0)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "connection_customizer", scope: !79, file: !2, baseType: !149, size: 128, align: 64, offset: 704, flags: DIFlagPublic)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<dyn r2d2::CustomizeConnection<memcache::connection::Connection, memcache::error::MemcacheError>, alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !150, templateParams: !18, identifier: "e542c2b31f72362de99a1d9d152c15f6")
!150 = !{!151, !154}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !149, file: !2, baseType: !152, size: 64, align: 64)
!152 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !153, size: 64, align: 64, dwarfAddressSpace: 0)
!153 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "dyn r2d2::CustomizeConnection<memcache::connection::Connection, memcache::error::MemcacheError>", file: !2, align: 8, elements: !18, identifier: "5a4fcbeae077af21371a935b708aa57e")
!154 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !149, file: !2, baseType: !155, size: 64, align: 64, offset: 64)
!155 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 6]", baseType: !156, size: 64, align: 64, dwarfAddressSpace: 0)
!156 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 384, align: 64, elements: !157)
!157 = !{!158}
!158 = !DISubrange(count: 6, lowerBound: 0)
!159 = !DIDerivedType(tag: DW_TAG_member, name: "thread_pool", scope: !79, file: !2, baseType: !160, size: 64, align: 64, offset: 832, flags: DIFlagPublic)
!160 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<scheduled_thread_pool::ScheduledThreadPool, alloc::alloc::Global>", scope: !49, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !161, templateParams: !396, identifier: "1138b654eb4dbc7e3bccd8164d688dad")
!161 = !{!162, !393, !395}
!162 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !160, file: !2, baseType: !163, size: 64, align: 64, flags: DIFlagPrivate)
!163 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<scheduled_thread_pool::ScheduledThreadPool>>", scope: !54, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !164, templateParams: !391, identifier: "9ced6ce8e75918bb39992d78d9529950")
!164 = !{!165}
!165 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !163, file: !2, baseType: !166, size: 64, align: 64, flags: DIFlagPrivate)
!166 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<scheduled_thread_pool::ScheduledThreadPool>", baseType: !167, size: 64, align: 64, dwarfAddressSpace: 0)
!167 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<scheduled_thread_pool::ScheduledThreadPool>", scope: !49, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !168, templateParams: !389, identifier: "308fc4b04df0b47fb84a6e862a9ab68a")
!168 = !{!169, !170, !171}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !167, file: !2, baseType: !63, size: 64, align: 64, flags: DIFlagPrivate)
!170 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !167, file: !2, baseType: !63, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!171 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !167, file: !2, baseType: !172, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!172 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScheduledThreadPool", scope: !173, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !174, templateParams: !18, identifier: "9c48a38aa41c7e05cc86190450b1013e")
!173 = !DINamespace(name: "scheduled_thread_pool", scope: null)
!174 = !{!175}
!175 = !DIDerivedType(tag: DW_TAG_member, name: "shared", scope: !172, file: !2, baseType: !176, size: 64, align: 64, flags: DIFlagPrivate)
!176 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<scheduled_thread_pool::SharedPool, alloc::alloc::Global>", scope: !49, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !177, templateParams: !388, identifier: "aa125123e3fe15379281f1fbdff360e1")
!177 = !{!178, !385, !387}
!178 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !176, file: !2, baseType: !179, size: 64, align: 64, flags: DIFlagPrivate)
!179 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<scheduled_thread_pool::SharedPool>>", scope: !54, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !180, templateParams: !383, identifier: "420b6ff1563a7566e814713a2afecb16")
!180 = !{!181}
!181 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !179, file: !2, baseType: !182, size: 64, align: 64, flags: DIFlagPrivate)
!182 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<scheduled_thread_pool::SharedPool>", baseType: !183, size: 64, align: 64, dwarfAddressSpace: 0)
!183 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<scheduled_thread_pool::SharedPool>", scope: !49, file: !2, size: 512, align: 64, flags: DIFlagPrivate, elements: !184, templateParams: !381, identifier: "86e4b0e6c21a62e3adce946ae946008a")
!184 = !{!185, !186, !187}
!185 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !183, file: !2, baseType: !63, size: 64, align: 64, flags: DIFlagPrivate)
!186 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !183, file: !2, baseType: !63, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!187 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !183, file: !2, baseType: !188, size: 384, align: 64, offset: 128, flags: DIFlagPrivate)
!188 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SharedPool", scope: !173, file: !2, size: 384, align: 64, flags: DIFlagPrivate, elements: !189, templateParams: !18, identifier: "aff47b2ef176899a25e55544d518bec9")
!189 = !{!190, !365}
!190 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !188, file: !2, baseType: !191, size: 320, align: 64, flags: DIFlagPrivate)
!191 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Mutex<parking_lot::raw_mutex::RawMutex, scheduled_thread_pool::InnerPool>", scope: !192, file: !2, size: 320, align: 64, flags: DIFlagPublic, elements: !194, templateParams: !363, identifier: "57a055ccf3a063e2c95862b0a14388f9")
!192 = !DINamespace(name: "mutex", scope: !193)
!193 = !DINamespace(name: "lock_api", scope: null)
!194 = !{!195, !209}
!195 = !DIDerivedType(tag: DW_TAG_member, name: "raw", scope: !191, file: !2, baseType: !196, size: 8, align: 8, flags: DIFlagPrivate)
!196 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RawMutex", scope: !197, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !199, templateParams: !18, identifier: "32d255d0e5f876e597d734e2a472fc7c")
!197 = !DINamespace(name: "raw_mutex", scope: !198)
!198 = !DINamespace(name: "parking_lot", scope: null)
!199 = !{!200}
!200 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !196, file: !2, baseType: !201, size: 8, align: 8, flags: DIFlagPrivate)
!201 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicU8", scope: !64, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !202, templateParams: !18, identifier: "f582c30fa2380ebc6095c0b387076c3e")
!202 = !{!203}
!203 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !201, file: !2, baseType: !204, size: 8, align: 8, flags: DIFlagPrivate)
!204 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u8>", scope: !69, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !205, templateParams: !207, identifier: "d0c6d3efd144a12e8c44524fbf620a5d")
!205 = !{!206}
!206 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !204, file: !2, baseType: !31, size: 8, align: 8, flags: DIFlagPrivate)
!207 = !{!208}
!208 = !DITemplateTypeParameter(name: "T", type: !31)
!209 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !191, file: !2, baseType: !210, size: 256, align: 64, offset: 64, flags: DIFlagPrivate)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<scheduled_thread_pool::InnerPool>", scope: !69, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !211, templateParams: !361, identifier: "18a572e71da8f1a112121e0b07be29f")
!211 = !{!212}
!212 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !210, file: !2, baseType: !213, size: 256, align: 64, flags: DIFlagPrivate)
!213 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "InnerPool", scope: !173, file: !2, size: 256, align: 64, flags: DIFlagPrivate, elements: !214, templateParams: !18, identifier: "339ee46a30445b293b0a73eb490a68d3")
!214 = !{!215, !355, !356}
!215 = !DIDerivedType(tag: DW_TAG_member, name: "queue", scope: !213, file: !2, baseType: !216, size: 192, align: 64, flags: DIFlagPrivate)
!216 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BinaryHeap<scheduled_thread_pool::Job, alloc::alloc::Global>", scope: !217, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !219, templateParams: !353, identifier: "869e847ff7317bd680a9ca69f9d191c")
!217 = !DINamespace(name: "binary_heap", scope: !218)
!218 = !DINamespace(name: "collections", scope: !50)
!219 = !{!220}
!220 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !216, file: !2, baseType: !221, size: 192, align: 64, flags: DIFlagPrivate)
!221 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<scheduled_thread_pool::Job, alloc::alloc::Global>", scope: !222, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !223, templateParams: !353, identifier: "e003d7d4f0bc9ff8980a94f8e744af90")
!222 = !DINamespace(name: "vec", scope: !50)
!223 = !{!224, !354}
!224 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !221, file: !2, baseType: !225, size: 128, align: 64, flags: DIFlagPrivate)
!225 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<scheduled_thread_pool::Job, alloc::alloc::Global>", scope: !226, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !227, templateParams: !353, identifier: "370a5dbaddd7c24b99e1e8753a895796")
!226 = !DINamespace(name: "raw_vec", scope: !50)
!227 = !{!228, !252}
!228 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !225, file: !2, baseType: !229, size: 128, align: 64, flags: DIFlagPrivate)
!229 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RawVecInner<alloc::alloc::Global>", scope: !226, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !230, templateParams: !250, identifier: "8795a9b9afc5c3d5c816ccd0b1f2254a")
!230 = !{!231, !243, !247}
!231 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !229, file: !2, baseType: !232, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!232 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<u8>", scope: !233, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !234, templateParams: !207, identifier: "45d3d32c3fa3ed011283cc027c70b446")
!233 = !DINamespace(name: "unique", scope: !55)
!234 = !{!235, !240}
!235 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !232, file: !2, baseType: !236, size: 64, align: 64, flags: DIFlagPrivate)
!236 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !54, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !237, templateParams: !207, identifier: "e4dd93bbf61e57243c4526436a25a1a7")
!237 = !{!238}
!238 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !236, file: !2, baseType: !239, size: 64, align: 64, flags: DIFlagPrivate)
!239 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !31, size: 64, align: 64, dwarfAddressSpace: 0)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !232, file: !2, baseType: !241, align: 8, offset: 64, flags: DIFlagPrivate)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<u8>", scope: !242, file: !2, align: 8, flags: DIFlagPublic, elements: !18, templateParams: !207, identifier: "bf56aa13654ce739a584ce5bf3966456")
!242 = !DINamespace(name: "marker", scope: !56)
!243 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !229, file: !2, baseType: !244, size: 64, align: 64, flags: DIFlagPrivate)
!244 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Cap", scope: !226, file: !2, size: 64, align: 64, flags: DIFlagPrivate, elements: !245, templateParams: !18, identifier: "49a4dd7d735085543d7b927df1dec353")
!245 = !{!246}
!246 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !244, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!247 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !229, file: !2, baseType: !248, align: 8, offset: 128, flags: DIFlagPrivate)
!248 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !249, file: !2, align: 8, flags: DIFlagPublic, elements: !18, identifier: "5e9c32a9496c2cdfe285ed82771e12cb")
!249 = !DINamespace(name: "alloc", scope: !50)
!250 = !{!251}
!251 = !DITemplateTypeParameter(name: "A", type: !248)
!252 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !225, file: !2, baseType: !253, align: 8, offset: 128, flags: DIFlagPrivate)
!253 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<scheduled_thread_pool::Job>", scope: !242, file: !2, align: 8, flags: DIFlagPublic, elements: !18, templateParams: !254, identifier: "bc6c4a6e222e238f4ab82793f3a06b7d")
!254 = !{!255}
!255 = !DITemplateTypeParameter(name: "T", type: !256)
!256 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Job", scope: !173, file: !2, size: 512, align: 64, flags: DIFlagPrivate, elements: !257, templateParams: !18, identifier: "cc911647860e3009384c8efeff03387f")
!257 = !{!258, !308, !329}
!258 = !DIDerivedType(tag: DW_TAG_member, name: "type_", scope: !256, file: !2, baseType: !259, size: 320, align: 64, flags: DIFlagPrivate)
!259 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "JobType", scope: !173, file: !2, size: 320, align: 64, flags: DIFlagPrivate, elements: !260, templateParams: !18, identifier: "c2b5ffc6c45c4bcd4df7cb53a9b1885b")
!260 = !{!261}
!261 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !259, file: !2, size: 320, align: 64, elements: !262, templateParams: !18, identifier: "457d231c47f0785e3fb16648fefc48f", discriminator: !307)
!262 = !{!263, !277, !288, !298, !303}
!263 = !DIDerivedType(tag: DW_TAG_member, name: "Once", scope: !261, file: !2, baseType: !264, size: 320, align: 64, extraData: i128 0)
!264 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Once", scope: !259, file: !2, size: 320, align: 64, flags: DIFlagPrivate, elements: !265, templateParams: !18, identifier: "577e194df4fcd624256adfe9253c8e3c")
!265 = !{!266}
!266 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !264, file: !2, baseType: !267, size: 128, align: 64, offset: 64, flags: DIFlagPrivate)
!267 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<(dyn core::ops::function::FnOnce<(), Output=()> + core::marker::Send), alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !268, templateParams: !18, identifier: "4b9f4a66c25b8ce3b8c21ce0921f43a")
!268 = !{!269, !272}
!269 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !267, file: !2, baseType: !270, size: 64, align: 64)
!270 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !271, size: 64, align: 64, dwarfAddressSpace: 0)
!271 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn core::ops::function::FnOnce<(), Output=()> + core::marker::Send)", file: !2, align: 8, elements: !18, identifier: "43838b18cb2c894c6aea89633b3ab532")
!272 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !267, file: !2, baseType: !273, size: 64, align: 64, offset: 64)
!273 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 4]", baseType: !274, size: 64, align: 64, dwarfAddressSpace: 0)
!274 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 256, align: 64, elements: !275)
!275 = !{!276}
!276 = !DISubrange(count: 4, lowerBound: 0)
!277 = !DIDerivedType(tag: DW_TAG_member, name: "FixedRate", scope: !261, file: !2, baseType: !278, size: 320, align: 64, extraData: i128 1)
!278 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FixedRate", scope: !259, file: !2, size: 320, align: 64, flags: DIFlagPrivate, elements: !279, templateParams: !18, identifier: "3a1a3013a8cf6b6686245e1ad7d11283")
!279 = !{!280, !287}
!280 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !278, file: !2, baseType: !281, size: 128, align: 64, offset: 64, flags: DIFlagPrivate)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<(dyn core::ops::function::FnMut<(), Output=()> + core::marker::Send), alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !282, templateParams: !18, identifier: "3e1dacbed58ff1a24cd3c9186d1a74f7")
!282 = !{!283, !286}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !281, file: !2, baseType: !284, size: 64, align: 64)
!284 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !285, size: 64, align: 64, dwarfAddressSpace: 0)
!285 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn core::ops::function::FnMut<(), Output=()> + core::marker::Send)", file: !2, align: 8, elements: !18, identifier: "388b5c235cb98dcd2adfb55f8faf8347")
!286 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !281, file: !2, baseType: !133, size: 64, align: 64, offset: 64)
!287 = !DIDerivedType(tag: DW_TAG_member, name: "rate", scope: !278, file: !2, baseType: !110, size: 128, align: 64, offset: 192, flags: DIFlagPrivate)
!288 = !DIDerivedType(tag: DW_TAG_member, name: "DynamicRate", scope: !261, file: !2, baseType: !289, size: 320, align: 64, extraData: i128 2)
!289 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DynamicRate", scope: !259, file: !2, size: 320, align: 64, flags: DIFlagPrivate, elements: !290, templateParams: !18, identifier: "e10548f0a5d9dbbf778d4eaf6c6862fd")
!290 = !{!291}
!291 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !289, file: !2, baseType: !292, size: 128, align: 64, offset: 64, flags: DIFlagPrivate)
!292 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<(dyn core::ops::function::FnMut<(), Output=core::option::Option<core::time::Duration>> + core::marker::Send), alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !293, templateParams: !18, identifier: "e349ca1b9da399f6e4045b78f498cca9")
!293 = !{!294, !297}
!294 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !292, file: !2, baseType: !295, size: 64, align: 64)
!295 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !296, size: 64, align: 64, dwarfAddressSpace: 0)
!296 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn core::ops::function::FnMut<(), Output=core::option::Option<core::time::Duration>> + core::marker::Send)", file: !2, align: 8, elements: !18, identifier: "5cbd519cf112f2fa51f5248b7a3f8f95")
!297 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !292, file: !2, baseType: !133, size: 64, align: 64, offset: 64)
!298 = !DIDerivedType(tag: DW_TAG_member, name: "FixedDelay", scope: !261, file: !2, baseType: !299, size: 320, align: 64, extraData: i128 3)
!299 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FixedDelay", scope: !259, file: !2, size: 320, align: 64, flags: DIFlagPrivate, elements: !300, templateParams: !18, identifier: "2f1d5219d3e6e5904f273a42ab973a08")
!300 = !{!301, !302}
!301 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !299, file: !2, baseType: !281, size: 128, align: 64, offset: 64, flags: DIFlagPrivate)
!302 = !DIDerivedType(tag: DW_TAG_member, name: "delay", scope: !299, file: !2, baseType: !110, size: 128, align: 64, offset: 192, flags: DIFlagPrivate)
!303 = !DIDerivedType(tag: DW_TAG_member, name: "DynamicDelay", scope: !261, file: !2, baseType: !304, size: 320, align: 64, extraData: i128 4)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "DynamicDelay", scope: !259, file: !2, size: 320, align: 64, flags: DIFlagPrivate, elements: !305, templateParams: !18, identifier: "5f0fa01e641e642af95885697e1dedb")
!305 = !{!306}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !304, file: !2, baseType: !292, size: 128, align: 64, offset: 64, flags: DIFlagPrivate)
!307 = !DIDerivedType(tag: DW_TAG_member, scope: !259, file: !2, baseType: !114, size: 64, align: 64, flags: DIFlagArtificial)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "time", scope: !256, file: !2, baseType: !309, size: 128, align: 64, offset: 320, flags: DIFlagPrivate)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Instant", scope: !310, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !312, templateParams: !18, identifier: "a53752bf7721396f146d15ee3e4987b")
!310 = !DINamespace(name: "time", scope: !311)
!311 = !DINamespace(name: "std", scope: null)
!312 = !{!313}
!313 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !309, file: !2, baseType: !314, size: 128, align: 64, flags: DIFlagPrivate)
!314 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Instant", scope: !315, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !319, templateParams: !18, identifier: "c7410e32e31f4bf71dc8526e95dbe259")
!315 = !DINamespace(name: "time", scope: !316)
!316 = !DINamespace(name: "unix", scope: !317)
!317 = !DINamespace(name: "pal", scope: !318)
!318 = !DINamespace(name: "sys", scope: !311)
!319 = !{!320}
!320 = !DIDerivedType(tag: DW_TAG_member, name: "t", scope: !314, file: !2, baseType: !321, size: 128, align: 64, flags: DIFlagPrivate)
!321 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Timespec", scope: !315, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !322, templateParams: !18, identifier: "b6d8502105fdeff2109e15d8a17adbc1")
!322 = !{!323, !325}
!323 = !DIDerivedType(tag: DW_TAG_member, name: "tv_sec", scope: !321, file: !2, baseType: !324, size: 64, align: 64, flags: DIFlagPrivate)
!324 = !DIBasicType(name: "i64", size: 64, encoding: DW_ATE_signed)
!325 = !DIDerivedType(tag: DW_TAG_member, name: "tv_nsec", scope: !321, file: !2, baseType: !326, size: 32, align: 32, offset: 64, flags: DIFlagPrivate)
!326 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Nanoseconds", scope: !315, file: !2, size: 32, align: 32, flags: DIFlagPrivate, elements: !327, templateParams: !18, identifier: "cc1e52262864f379999c3b6b8e652b66")
!327 = !{!328}
!328 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !326, file: !2, baseType: !83, size: 32, align: 32, flags: DIFlagPrivate)
!329 = !DIDerivedType(tag: DW_TAG_member, name: "canceled", scope: !256, file: !2, baseType: !330, size: 64, align: 64, offset: 448, flags: DIFlagPrivate)
!330 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<core::sync::atomic::AtomicBool, alloc::alloc::Global>", scope: !49, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !331, templateParams: !352, identifier: "50a5430e4ad2c7b0b249d80cb7a09aa")
!331 = !{!332, !349, !351}
!332 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !330, file: !2, baseType: !333, size: 64, align: 64, flags: DIFlagPrivate)
!333 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<core::sync::atomic::AtomicBool>>", scope: !54, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !334, templateParams: !347, identifier: "d918e0d7d46a3b443c2ee48ea2794277")
!334 = !{!335}
!335 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !333, file: !2, baseType: !336, size: 64, align: 64, flags: DIFlagPrivate)
!336 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<core::sync::atomic::AtomicBool>", baseType: !337, size: 64, align: 64, dwarfAddressSpace: 0)
!337 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<core::sync::atomic::AtomicBool>", scope: !49, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !338, templateParams: !345, identifier: "e9407fec27387f6beeecc35159d5cfe9")
!338 = !{!339, !340, !341}
!339 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !337, file: !2, baseType: !63, size: 64, align: 64, flags: DIFlagPrivate)
!340 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !337, file: !2, baseType: !63, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!341 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !337, file: !2, baseType: !342, size: 8, align: 8, offset: 128, flags: DIFlagPrivate)
!342 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicBool", scope: !64, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !343, templateParams: !18, identifier: "ddb2f54188924ff11438b5023cfea5db")
!343 = !{!344}
!344 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !342, file: !2, baseType: !204, size: 8, align: 8, flags: DIFlagPrivate)
!345 = !{!346}
!346 = !DITemplateTypeParameter(name: "T", type: !342)
!347 = !{!348}
!348 = !DITemplateTypeParameter(name: "T", type: !337)
!349 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !330, file: !2, baseType: !350, align: 8, offset: 64, flags: DIFlagPrivate)
!350 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<core::sync::atomic::AtomicBool>>", scope: !242, file: !2, align: 8, flags: DIFlagPublic, elements: !18, templateParams: !347, identifier: "32bcb2db1b434e1ad317d87ca7a6b3")
!351 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !330, file: !2, baseType: !248, align: 8, offset: 64, flags: DIFlagPrivate)
!352 = !{!346, !251}
!353 = !{!255, !251}
!354 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !221, file: !2, baseType: !9, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!355 = !DIDerivedType(tag: DW_TAG_member, name: "shutdown", scope: !213, file: !2, baseType: !100, size: 8, align: 8, offset: 192, flags: DIFlagPrivate)
!356 = !DIDerivedType(tag: DW_TAG_member, name: "on_drop_behavior", scope: !213, file: !2, baseType: !357, size: 8, align: 8, offset: 200, flags: DIFlagPrivate)
!357 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "OnPoolDropBehavior", scope: !173, file: !2, baseType: !31, size: 8, align: 8, flags: DIFlagEnumClass, elements: !358)
!358 = !{!359, !360}
!359 = !DIEnumerator(name: "CompletePendingScheduled", value: 0, isUnsigned: true)
!360 = !DIEnumerator(name: "DiscardPendingScheduled", value: 1, isUnsigned: true)
!361 = !{!362}
!362 = !DITemplateTypeParameter(name: "T", type: !213)
!363 = !{!364, !362}
!364 = !DITemplateTypeParameter(name: "R", type: !196)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "cvar", scope: !188, file: !2, baseType: !366, size: 64, align: 64, offset: 320, flags: DIFlagPrivate)
!366 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Condvar", scope: !367, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !368, templateParams: !18, identifier: "e60d9a0522be12bed3580633b157c7b7")
!367 = !DINamespace(name: "condvar", scope: !198)
!368 = !{!369}
!369 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !366, file: !2, baseType: !370, size: 64, align: 64, flags: DIFlagPrivate)
!370 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicPtr<parking_lot::raw_mutex::RawMutex>", scope: !64, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !371, templateParams: !379, identifier: "8e5d9246f3736ae29b63a00bd6fe4571")
!371 = !{!372}
!372 = !DIDerivedType(tag: DW_TAG_member, name: "p", scope: !370, file: !2, baseType: !373, size: 64, align: 64, flags: DIFlagPrivate)
!373 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<*mut parking_lot::raw_mutex::RawMutex>", scope: !69, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !374, templateParams: !377, identifier: "1f046be679267bd789da9067dc544f2c")
!374 = !{!375}
!375 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !373, file: !2, baseType: !376, size: 64, align: 64, flags: DIFlagPrivate)
!376 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut parking_lot::raw_mutex::RawMutex", baseType: !196, size: 64, align: 64, dwarfAddressSpace: 0)
!377 = !{!378}
!378 = !DITemplateTypeParameter(name: "T", type: !376)
!379 = !{!380}
!380 = !DITemplateTypeParameter(name: "T", type: !196)
!381 = !{!382}
!382 = !DITemplateTypeParameter(name: "T", type: !188)
!383 = !{!384}
!384 = !DITemplateTypeParameter(name: "T", type: !183)
!385 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !176, file: !2, baseType: !386, align: 8, offset: 64, flags: DIFlagPrivate)
!386 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<scheduled_thread_pool::SharedPool>>", scope: !242, file: !2, align: 8, flags: DIFlagPublic, elements: !18, templateParams: !383, identifier: "753d21da62e30ffaafb9d7b98b06b64e")
!387 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !176, file: !2, baseType: !248, align: 8, offset: 64, flags: DIFlagPrivate)
!388 = !{!382, !251}
!389 = !{!390}
!390 = !DITemplateTypeParameter(name: "T", type: !172)
!391 = !{!392}
!392 = !DITemplateTypeParameter(name: "T", type: !167)
!393 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !160, file: !2, baseType: !394, align: 8, offset: 64, flags: DIFlagPrivate)
!394 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<scheduled_thread_pool::ScheduledThreadPool>>", scope: !242, file: !2, align: 8, flags: DIFlagPublic, elements: !18, templateParams: !391, identifier: "c30831d9c776099c878063b9787b6b67")
!395 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !160, file: !2, baseType: !248, align: 8, offset: 64, flags: DIFlagPrivate)
!396 = !{!390, !251}
!397 = !{!398, !585}
!398 = !DITemplateTypeParameter(name: "C", type: !399)
!399 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Connection", scope: !400, file: !2, size: 16960, align: 64, flags: DIFlagPublic, elements: !402, templateParams: !18, identifier: "4e17a630d68010a7c6e0c0d0b9b25466")
!400 = !DINamespace(name: "connection", scope: !401)
!401 = !DINamespace(name: "memcache", scope: null)
!402 = !{!403, !560}
!403 = !DIDerivedType(tag: DW_TAG_member, name: "protocol", scope: !399, file: !2, baseType: !404, size: 16896, align: 64, flags: DIFlagPublic)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Protocol", scope: !405, file: !2, size: 16896, align: 64, flags: DIFlagPublic, elements: !406, templateParams: !18, identifier: "a1c1d65dc10e1f84c4b2973f0b9be6f9")
!405 = !DINamespace(name: "protocol", scope: !401)
!406 = !{!407}
!407 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !404, file: !2, size: 16896, align: 64, elements: !408, templateParams: !18, identifier: "49d461f340eb0a48117edd1a6ea1a878", discriminator: !559)
!408 = !{!409, !551}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "Ascii", scope: !407, file: !2, baseType: !410, size: 16896, align: 64)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Ascii", scope: !404, file: !2, size: 16896, align: 64, flags: DIFlagPublic, elements: !411, templateParams: !18, identifier: "b0323f8396a7f68caa8f048482359245")
!411 = !{!412}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !410, file: !2, baseType: !413, size: 16896, align: 64, flags: DIFlagPublic)
!413 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AsciiProtocol<memcache::stream::Stream>", scope: !414, file: !2, size: 16896, align: 64, flags: DIFlagPublic, elements: !415, templateParams: !549, identifier: "27209ac934c168a7664b73de82b7fc59")
!414 = !DINamespace(name: "ascii", scope: !405)
!415 = !{!416}
!416 = !DIDerivedType(tag: DW_TAG_member, name: "reader", scope: !413, file: !2, baseType: !417, size: 16896, align: 64, flags: DIFlagPrivate)
!417 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CappedLineReader<memcache::stream::Stream>", scope: !414, file: !2, size: 16896, align: 64, flags: DIFlagPrivate, elements: !418, templateParams: !549, identifier: "2b8fa0d10fd52a5106b3178bf77b0c4")
!418 = !{!419, !544, !545}
!419 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !417, file: !2, baseType: !420, size: 448, align: 64, flags: DIFlagPrivate)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Stream", scope: !421, file: !2, size: 448, align: 64, flags: DIFlagPublic, elements: !422, templateParams: !18, identifier: "697171831d58aec33c292f0cc43b0255")
!421 = !DINamespace(name: "stream", scope: !401)
!422 = !{!423}
!423 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !420, file: !2, size: 448, align: 64, elements: !424, templateParams: !18, identifier: "b4d6c3240096cfca4cf20f64ce99c26a", discriminator: !543)
!424 = !{!425, !454, !482, !492}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "Tcp", scope: !423, file: !2, baseType: !426, size: 448, align: 64, extraData: i128 9223372036854775808)
!426 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tcp", scope: !420, file: !2, size: 448, align: 64, flags: DIFlagPublic, elements: !427, templateParams: !18, identifier: "b097329b550e5ca4cd2b7dfcfe539e65")
!427 = !{!428}
!428 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !426, file: !2, baseType: !429, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!429 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TcpStream", scope: !430, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !432, templateParams: !18, identifier: "8097b0e899a257d15dbdb0eda0d0d9c4")
!430 = !DINamespace(name: "tcp", scope: !431)
!431 = !DINamespace(name: "net", scope: !311)
!432 = !{!433}
!433 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !429, file: !2, baseType: !434, size: 32, align: 32, flags: DIFlagPrivate)
!434 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TcpStream", scope: !435, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !437, templateParams: !18, identifier: "5dab18c89e4dca9b1098cdcb3d8e5696")
!435 = !DINamespace(name: "net", scope: !436)
!436 = !DINamespace(name: "sys_common", scope: !311)
!437 = !{!438}
!438 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !434, file: !2, baseType: !439, size: 32, align: 32, flags: DIFlagPrivate)
!439 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Socket", scope: !440, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !441, templateParams: !18, identifier: "8a168da92db623f475f94d7f638956c3")
!440 = !DINamespace(name: "net", scope: !316)
!441 = !{!442}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !439, file: !2, baseType: !443, size: 32, align: 32, flags: DIFlagPrivate)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FileDesc", scope: !444, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !445, templateParams: !18, identifier: "400ffb2c62627bb89e28adc3da4847dd")
!444 = !DINamespace(name: "fd", scope: !316)
!445 = !{!446}
!446 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !443, file: !2, baseType: !447, size: 32, align: 32, flags: DIFlagPrivate)
!447 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "OwnedFd", scope: !448, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !451, templateParams: !18, identifier: "cab55d4e44c9ab51d4a67e8af5c4be7e")
!448 = !DINamespace(name: "owned", scope: !449)
!449 = !DINamespace(name: "fd", scope: !450)
!450 = !DINamespace(name: "os", scope: !311)
!451 = !{!452}
!452 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !447, file: !2, baseType: !453, size: 32, align: 32, flags: DIFlagPrivate)
!453 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!454 = !DIDerivedType(tag: DW_TAG_member, name: "Udp", scope: !423, file: !2, baseType: !455, size: 448, align: 64)
!455 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Udp", scope: !420, file: !2, size: 448, align: 64, flags: DIFlagPublic, elements: !456, templateParams: !18, identifier: "23d5943c3d07c6bdf3a1767e7abf030e")
!456 = !{!457}
!457 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !455, file: !2, baseType: !458, size: 448, align: 64, flags: DIFlagPublic)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UdpStream", scope: !459, file: !2, size: 448, align: 64, flags: DIFlagPublic, elements: !460, templateParams: !18, identifier: "5dbb0a56a58e8b63d01d2b09ff10e211")
!459 = !DINamespace(name: "udp_stream", scope: !421)
!460 = !{!461, !469, !479, !480}
!461 = !DIDerivedType(tag: DW_TAG_member, name: "socket", scope: !458, file: !2, baseType: !462, size: 32, align: 32, offset: 384, flags: DIFlagPrivate)
!462 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UdpSocket", scope: !463, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !464, templateParams: !18, identifier: "50f8d530cf23d882115ec143103816ed")
!463 = !DINamespace(name: "udp", scope: !431)
!464 = !{!465}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !462, file: !2, baseType: !466, size: 32, align: 32, flags: DIFlagPrivate)
!466 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UdpSocket", scope: !435, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !467, templateParams: !18, identifier: "c873f5eb4761681c1ccfbdfdbb761073")
!467 = !{!468}
!468 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !466, file: !2, baseType: !439, size: 32, align: 32, flags: DIFlagPrivate)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "read_buf", scope: !458, file: !2, baseType: !470, size: 192, align: 64, flags: DIFlagPrivate)
!470 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<u8, alloc::alloc::Global>", scope: !222, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !471, templateParams: !477, identifier: "6a9b334118d58c39299dd55b2f68c4c2")
!471 = !{!472, !478}
!472 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !470, file: !2, baseType: !473, size: 128, align: 64, flags: DIFlagPrivate)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<u8, alloc::alloc::Global>", scope: !226, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !474, templateParams: !477, identifier: "2799711429c43f0cf4b69e8f3427468")
!474 = !{!475, !476}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !473, file: !2, baseType: !229, size: 128, align: 64, flags: DIFlagPrivate)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !473, file: !2, baseType: !241, align: 8, offset: 128, flags: DIFlagPrivate)
!477 = !{!208, !251}
!478 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !470, file: !2, baseType: !9, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!479 = !DIDerivedType(tag: DW_TAG_member, name: "write_buf", scope: !458, file: !2, baseType: !470, size: 192, align: 64, offset: 192, flags: DIFlagPrivate)
!480 = !DIDerivedType(tag: DW_TAG_member, name: "request_id", scope: !458, file: !2, baseType: !481, size: 16, align: 16, offset: 416, flags: DIFlagPrivate)
!481 = !DIBasicType(name: "u16", size: 16, encoding: DW_ATE_unsigned)
!482 = !DIDerivedType(tag: DW_TAG_member, name: "Unix", scope: !423, file: !2, baseType: !483, size: 448, align: 64, extraData: i128 9223372036854775810)
!483 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Unix", scope: !420, file: !2, size: 448, align: 64, flags: DIFlagPublic, elements: !484, templateParams: !18, identifier: "de11aba4a2b6d2336cec861023129310")
!484 = !{!485}
!485 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !483, file: !2, baseType: !486, size: 32, align: 32, offset: 64, flags: DIFlagPublic)
!486 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UnixStream", scope: !487, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !490, templateParams: !18, identifier: "b85c5f95d9c7fc28ab9405bcddc88fce")
!487 = !DINamespace(name: "stream", scope: !488)
!488 = !DINamespace(name: "net", scope: !489)
!489 = !DINamespace(name: "unix", scope: !450)
!490 = !{!491}
!491 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !486, file: !2, baseType: !439, size: 32, align: 32, flags: DIFlagProtected)
!492 = !DIDerivedType(tag: DW_TAG_member, name: "Tls", scope: !423, file: !2, baseType: !493, size: 448, align: 64, extraData: i128 9223372036854775811)
!493 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tls", scope: !420, file: !2, size: 448, align: 64, flags: DIFlagPublic, elements: !494, templateParams: !18, identifier: "45c02e51218b1ec5730376e1ab9b2478")
!494 = !{!495}
!495 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !493, file: !2, baseType: !496, size: 128, align: 64, offset: 64, flags: DIFlagPublic)
!496 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SslStream<std::net::tcp::TcpStream>", scope: !497, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !499, templateParams: !541, identifier: "64522c8199eb9dcb9340817b178773a0")
!497 = !DINamespace(name: "ssl", scope: !498)
!498 = !DINamespace(name: "openssl", scope: null)
!499 = !{!500, !519, !537}
!500 = !DIDerivedType(tag: DW_TAG_member, name: "ssl", scope: !496, file: !2, baseType: !501, size: 64, align: 64, flags: DIFlagPrivate)
!501 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ManuallyDrop<openssl::ssl::Ssl>", scope: !502, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !504, templateParams: !517, identifier: "19de8906cb2700c6937737dd50b0bfc1")
!502 = !DINamespace(name: "manually_drop", scope: !503)
!503 = !DINamespace(name: "mem", scope: !56)
!504 = !{!505}
!505 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !501, file: !2, baseType: !506, size: 64, align: 64, flags: DIFlagPrivate)
!506 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Ssl", scope: !497, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !507, templateParams: !18, identifier: "4e748ba7ba9b86bd925896658ed3fe49")
!507 = !{!508}
!508 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !506, file: !2, baseType: !509, size: 64, align: 64, flags: DIFlagPrivate)
!509 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut openssl_sys::openssl::handwritten::types::SSL", baseType: !510, size: 64, align: 64, dwarfAddressSpace: 0)
!510 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SSL", scope: !511, file: !2, align: 8, flags: DIFlagPublic, elements: !515, templateParams: !18, identifier: "11eac6d6436b6342bc8aa23eb598e3d0")
!511 = !DINamespace(name: "types", scope: !512)
!512 = !DINamespace(name: "handwritten", scope: !513)
!513 = !DINamespace(name: "openssl", scope: !514)
!514 = !DINamespace(name: "openssl_sys", scope: null)
!515 = !{!516}
!516 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !510, file: !2, align: 8, elements: !18, identifier: "4027cb952381d0dac83d31ed0a8542bf")
!517 = !{!518}
!518 = !DITemplateTypeParameter(name: "T", type: !506)
!519 = !DIDerivedType(tag: DW_TAG_member, name: "method", scope: !496, file: !2, baseType: !520, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!520 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ManuallyDrop<openssl::ssl::bio::BioMethod>", scope: !502, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !521, templateParams: !535, identifier: "f2e22326c87b324629c7ef2dddf8a575")
!521 = !{!522}
!522 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !520, file: !2, baseType: !523, size: 64, align: 64, flags: DIFlagPrivate)
!523 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BioMethod", scope: !524, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !525, templateParams: !18, identifier: "97a509ce7efd53b3104e085d14822e3")
!524 = !DINamespace(name: "bio", scope: !497)
!525 = !{!526}
!526 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !523, file: !2, baseType: !527, size: 64, align: 64, flags: DIFlagPrivate)
!527 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BIO_METHOD", scope: !524, file: !2, size: 64, align: 64, flags: DIFlagPrivate, elements: !528, templateParams: !18, identifier: "f394a8314f2b43d8e7c2cfbf8748d3a")
!528 = !{!529}
!529 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !527, file: !2, baseType: !530, size: 64, align: 64, flags: DIFlagPrivate)
!530 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*mut openssl_sys::openssl::handwritten::bio::BIO_METHOD", baseType: !531, size: 64, align: 64, dwarfAddressSpace: 0)
!531 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BIO_METHOD", scope: !532, file: !2, align: 8, flags: DIFlagPublic, elements: !533, templateParams: !18, identifier: "5eb5bbf56b30c08c4ae3c64474077737")
!532 = !DINamespace(name: "bio", scope: !512)
!533 = !{!534}
!534 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !531, file: !2, align: 8, elements: !18, identifier: "58ccc028c87572d5f686a63cd3edc5ca")
!535 = !{!536}
!536 = !DITemplateTypeParameter(name: "T", type: !523)
!537 = !DIDerivedType(tag: DW_TAG_member, name: "_p", scope: !496, file: !2, baseType: !538, align: 8, offset: 128, flags: DIFlagPrivate)
!538 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<std::net::tcp::TcpStream>", scope: !242, file: !2, align: 8, flags: DIFlagPublic, elements: !18, templateParams: !539, identifier: "6a4da1b88b49fd223ffc0c5ac77b0478")
!539 = !{!540}
!540 = !DITemplateTypeParameter(name: "T", type: !429)
!541 = !{!542}
!542 = !DITemplateTypeParameter(name: "S", type: !429)
!543 = !DIDerivedType(tag: DW_TAG_member, scope: !420, file: !2, baseType: !114, size: 64, align: 64, flags: DIFlagArtificial)
!544 = !DIDerivedType(tag: DW_TAG_member, name: "filled", scope: !417, file: !2, baseType: !9, size: 64, align: 64, offset: 448, flags: DIFlagPrivate)
!545 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !417, file: !2, baseType: !546, size: 16384, align: 8, offset: 512, flags: DIFlagPrivate)
!546 = !DICompositeType(tag: DW_TAG_array_type, baseType: !31, size: 16384, align: 8, elements: !547)
!547 = !{!548}
!548 = !DISubrange(count: 2048, lowerBound: 0)
!549 = !{!550}
!550 = !DITemplateTypeParameter(name: "C", type: !420)
!551 = !DIDerivedType(tag: DW_TAG_member, name: "Binary", scope: !407, file: !2, baseType: !552, size: 16896, align: 64, extraData: i128 9223372036854775812)
!552 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Binary", scope: !404, file: !2, size: 16896, align: 64, flags: DIFlagPublic, elements: !553, templateParams: !18, identifier: "2e8fccba1cdf418f79d568371eb37d14")
!553 = !{!554}
!554 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !552, file: !2, baseType: !555, size: 448, align: 64, offset: 64, flags: DIFlagPublic)
!555 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BinaryProtocol", scope: !556, file: !2, size: 448, align: 64, flags: DIFlagPublic, elements: !557, templateParams: !18, identifier: "acd76dffe056f30957404f3848cb895b")
!556 = !DINamespace(name: "binary", scope: !405)
!557 = !{!558}
!558 = !DIDerivedType(tag: DW_TAG_member, name: "stream", scope: !555, file: !2, baseType: !420, size: 448, align: 64, flags: DIFlagPublic)
!559 = !DIDerivedType(tag: DW_TAG_member, scope: !404, file: !2, baseType: !114, size: 64, align: 64, flags: DIFlagArtificial)
!560 = !DIDerivedType(tag: DW_TAG_member, name: "url", scope: !399, file: !2, baseType: !561, size: 64, align: 64, offset: 16896, flags: DIFlagPublic)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<alloc::string::String, alloc::alloc::Global>", scope: !49, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !562, templateParams: !584, identifier: "29bd369b15b8a05fad9a6e12024a1ed2")
!562 = !{!563, !581, !583}
!563 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !561, file: !2, baseType: !564, size: 64, align: 64, flags: DIFlagPrivate)
!564 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<alloc::string::String>>", scope: !54, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !565, templateParams: !579, identifier: "e538b7ae75ebd8cd8c0a9899886693b")
!565 = !{!566}
!566 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !564, file: !2, baseType: !567, size: 64, align: 64, flags: DIFlagPrivate)
!567 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<alloc::string::String>", baseType: !568, size: 64, align: 64, dwarfAddressSpace: 0)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<alloc::string::String>", scope: !49, file: !2, size: 320, align: 64, flags: DIFlagPrivate, elements: !569, templateParams: !577, identifier: "90d25ec027b13e1ab73de407926f31bd")
!569 = !{!570, !571, !572}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !568, file: !2, baseType: !63, size: 64, align: 64, flags: DIFlagPrivate)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !568, file: !2, baseType: !63, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!572 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !568, file: !2, baseType: !573, size: 192, align: 64, offset: 128, flags: DIFlagPrivate)
!573 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "String", scope: !574, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !575, templateParams: !18, identifier: "3543478f9d8178e55b9780d6b517ce6b")
!574 = !DINamespace(name: "string", scope: !50)
!575 = !{!576}
!576 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !573, file: !2, baseType: !470, size: 192, align: 64, flags: DIFlagPrivate)
!577 = !{!578}
!578 = !DITemplateTypeParameter(name: "T", type: !573)
!579 = !{!580}
!580 = !DITemplateTypeParameter(name: "T", type: !568)
!581 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !561, file: !2, baseType: !582, align: 8, offset: 64, flags: DIFlagPrivate)
!582 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<alloc::string::String>>", scope: !242, file: !2, align: 8, flags: DIFlagPublic, elements: !18, templateParams: !579, identifier: "965e907faf0365e3731843e4ec14f43")
!583 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !561, file: !2, baseType: !248, align: 8, offset: 64, flags: DIFlagPrivate)
!584 = !{!578, !251}
!585 = !DITemplateTypeParameter(name: "E", type: !586)
!586 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MemcacheError", scope: !587, file: !2, size: 448, align: 64, flags: DIFlagPublic, elements: !588, templateParams: !18, identifier: "db643b9736f45c4d42fe095a57b1fc3e")
!587 = !DINamespace(name: "error", scope: !401)
!588 = !{!589}
!589 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !586, file: !2, size: 448, align: 64, elements: !590, templateParams: !18, identifier: "fa687b827944704388f15cb811837955", discriminator: !1000)
!590 = !{!591, !595, !704, !735, !756, !781, !894, !982}
!591 = !DIDerivedType(tag: DW_TAG_member, name: "BadURL", scope: !589, file: !2, baseType: !592, size: 448, align: 64, extraData: i128 3)
!592 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BadURL", scope: !586, file: !2, size: 448, align: 64, flags: DIFlagPublic, elements: !593, templateParams: !18, identifier: "87bf895629ed8952c6a2f06fde571c5a")
!593 = !{!594}
!594 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !592, file: !2, baseType: !573, size: 192, align: 64, offset: 64, flags: DIFlagPublic)
!595 = !DIDerivedType(tag: DW_TAG_member, name: "IOError", scope: !589, file: !2, baseType: !596, size: 448, align: 64, extraData: i128 4)
!596 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IOError", scope: !586, file: !2, size: 448, align: 64, flags: DIFlagPublic, elements: !597, templateParams: !18, identifier: "eff70592904f3b813c7c931c0f99786a")
!597 = !{!598}
!598 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !596, file: !2, baseType: !599, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !600, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !602, templateParams: !18, identifier: "ecc4f0422ebd245827cc9408cc3115cf")
!600 = !DINamespace(name: "error", scope: !601)
!601 = !DINamespace(name: "io", scope: !311)
!602 = !{!603}
!603 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !599, file: !2, baseType: !604, size: 64, align: 64, flags: DIFlagPrivate)
!604 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Repr", scope: !605, file: !2, size: 64, align: 64, flags: DIFlagProtected, elements: !606, templateParams: !18, identifier: "f9171ae77d01e2aa1d3b54c98c9f3a5e")
!605 = !DINamespace(name: "repr_bitpacked", scope: !600)
!606 = !{!607, !613}
!607 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !604, file: !2, baseType: !608, size: 64, align: 64, flags: DIFlagPrivate)
!608 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<()>", scope: !54, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !609, templateParams: !611, identifier: "c51e1494c8f57d5ac0b27f086d3b1cbd")
!609 = !{!610}
!610 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !608, file: !2, baseType: !6, size: 64, align: 64, flags: DIFlagPrivate)
!611 = !{!612}
!612 = !DITemplateTypeParameter(name: "T", type: !7)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !604, file: !2, baseType: !614, align: 8, offset: 64, flags: DIFlagPrivate)
!614 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<std::io::error::ErrorData<alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>>>", scope: !242, file: !2, align: 8, flags: DIFlagPublic, elements: !18, templateParams: !615, identifier: "efb9500539eaf2aa94ff4fc0d90020b6")
!615 = !{!616}
!616 = !DITemplateTypeParameter(name: "T", type: !617)
!617 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ErrorData<alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>>", scope: !600, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !618, templateParams: !18, identifier: "1816e4f78d4a9671ac3a9a4b2c372edd")
!618 = !{!619}
!619 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !617, file: !2, size: 128, align: 64, elements: !620, templateParams: !18, identifier: "cba42fbe423ea1d33dfa89734a0cd470", discriminator: !703)
!620 = !{!621, !686, !690, !699}
!621 = !DIDerivedType(tag: DW_TAG_member, name: "Os", scope: !619, file: !2, baseType: !622, size: 128, align: 64, extraData: i128 0)
!622 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Os", scope: !617, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !623, templateParams: !625, identifier: "bb1b0710e727cef1f5368786585adba4")
!623 = !{!624}
!624 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !622, file: !2, baseType: !453, size: 32, align: 32, offset: 32, flags: DIFlagPrivate)
!625 = !{!626}
!626 = !DITemplateTypeParameter(name: "C", type: !627)
!627 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>", baseType: !628, size: 64, align: 64, dwarfAddressSpace: 0)
!628 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !600, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !629, templateParams: !18, identifier: "adb9abebbe7b54834e03ff1533fd9814")
!629 = !{!630, !675}
!630 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !628, file: !2, baseType: !631, size: 8, align: 8, offset: 128, flags: DIFlagPrivate)
!631 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ErrorKind", scope: !600, file: !2, baseType: !31, size: 8, align: 8, flags: DIFlagEnumClass, elements: !632)
!632 = !{!633, !634, !635, !636, !637, !638, !639, !640, !641, !642, !643, !644, !645, !646, !647, !648, !649, !650, !651, !652, !653, !654, !655, !656, !657, !658, !659, !660, !661, !662, !663, !664, !665, !666, !667, !668, !669, !670, !671, !672, !673, !674}
!633 = !DIEnumerator(name: "NotFound", value: 0, isUnsigned: true)
!634 = !DIEnumerator(name: "PermissionDenied", value: 1, isUnsigned: true)
!635 = !DIEnumerator(name: "ConnectionRefused", value: 2, isUnsigned: true)
!636 = !DIEnumerator(name: "ConnectionReset", value: 3, isUnsigned: true)
!637 = !DIEnumerator(name: "HostUnreachable", value: 4, isUnsigned: true)
!638 = !DIEnumerator(name: "NetworkUnreachable", value: 5, isUnsigned: true)
!639 = !DIEnumerator(name: "ConnectionAborted", value: 6, isUnsigned: true)
!640 = !DIEnumerator(name: "NotConnected", value: 7, isUnsigned: true)
!641 = !DIEnumerator(name: "AddrInUse", value: 8, isUnsigned: true)
!642 = !DIEnumerator(name: "AddrNotAvailable", value: 9, isUnsigned: true)
!643 = !DIEnumerator(name: "NetworkDown", value: 10, isUnsigned: true)
!644 = !DIEnumerator(name: "BrokenPipe", value: 11, isUnsigned: true)
!645 = !DIEnumerator(name: "AlreadyExists", value: 12, isUnsigned: true)
!646 = !DIEnumerator(name: "WouldBlock", value: 13, isUnsigned: true)
!647 = !DIEnumerator(name: "NotADirectory", value: 14, isUnsigned: true)
!648 = !DIEnumerator(name: "IsADirectory", value: 15, isUnsigned: true)
!649 = !DIEnumerator(name: "DirectoryNotEmpty", value: 16, isUnsigned: true)
!650 = !DIEnumerator(name: "ReadOnlyFilesystem", value: 17, isUnsigned: true)
!651 = !DIEnumerator(name: "FilesystemLoop", value: 18, isUnsigned: true)
!652 = !DIEnumerator(name: "StaleNetworkFileHandle", value: 19, isUnsigned: true)
!653 = !DIEnumerator(name: "InvalidInput", value: 20, isUnsigned: true)
!654 = !DIEnumerator(name: "InvalidData", value: 21, isUnsigned: true)
!655 = !DIEnumerator(name: "TimedOut", value: 22, isUnsigned: true)
!656 = !DIEnumerator(name: "WriteZero", value: 23, isUnsigned: true)
!657 = !DIEnumerator(name: "StorageFull", value: 24, isUnsigned: true)
!658 = !DIEnumerator(name: "NotSeekable", value: 25, isUnsigned: true)
!659 = !DIEnumerator(name: "QuotaExceeded", value: 26, isUnsigned: true)
!660 = !DIEnumerator(name: "FileTooLarge", value: 27, isUnsigned: true)
!661 = !DIEnumerator(name: "ResourceBusy", value: 28, isUnsigned: true)
!662 = !DIEnumerator(name: "ExecutableFileBusy", value: 29, isUnsigned: true)
!663 = !DIEnumerator(name: "Deadlock", value: 30, isUnsigned: true)
!664 = !DIEnumerator(name: "CrossesDevices", value: 31, isUnsigned: true)
!665 = !DIEnumerator(name: "TooManyLinks", value: 32, isUnsigned: true)
!666 = !DIEnumerator(name: "InvalidFilename", value: 33, isUnsigned: true)
!667 = !DIEnumerator(name: "ArgumentListTooLong", value: 34, isUnsigned: true)
!668 = !DIEnumerator(name: "Interrupted", value: 35, isUnsigned: true)
!669 = !DIEnumerator(name: "Unsupported", value: 36, isUnsigned: true)
!670 = !DIEnumerator(name: "UnexpectedEof", value: 37, isUnsigned: true)
!671 = !DIEnumerator(name: "OutOfMemory", value: 38, isUnsigned: true)
!672 = !DIEnumerator(name: "InProgress", value: 39, isUnsigned: true)
!673 = !DIEnumerator(name: "Other", value: 40, isUnsigned: true)
!674 = !DIEnumerator(name: "Uncategorized", value: 41, isUnsigned: true)
!675 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !628, file: !2, baseType: !676, size: 128, align: 64, flags: DIFlagPrivate)
!676 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<(dyn core::error::Error + core::marker::Send + core::marker::Sync), alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !677, templateParams: !18, identifier: "50ed0b914246be383378bdbeb9952528")
!677 = !{!678, !681}
!678 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !676, file: !2, baseType: !679, size: 64, align: 64)
!679 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !680, size: 64, align: 64, dwarfAddressSpace: 0)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn core::error::Error + core::marker::Send + core::marker::Sync)", file: !2, align: 8, elements: !18, identifier: "348ef7647c21af37bb908e218266fe3")
!681 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !676, file: !2, baseType: !682, size: 64, align: 64, offset: 64)
!682 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 10]", baseType: !683, size: 64, align: 64, dwarfAddressSpace: 0)
!683 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 640, align: 64, elements: !684)
!684 = !{!685}
!685 = !DISubrange(count: 10, lowerBound: 0)
!686 = !DIDerivedType(tag: DW_TAG_member, name: "Simple", scope: !619, file: !2, baseType: !687, size: 128, align: 64, extraData: i128 1)
!687 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Simple", scope: !617, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !688, templateParams: !625, identifier: "de749897ded9e9c9fecc4ffc0278e436")
!688 = !{!689}
!689 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !687, file: !2, baseType: !631, size: 8, align: 8, offset: 8, flags: DIFlagPrivate)
!690 = !DIDerivedType(tag: DW_TAG_member, name: "SimpleMessage", scope: !619, file: !2, baseType: !691, size: 128, align: 64, extraData: i128 2)
!691 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SimpleMessage", scope: !617, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !692, templateParams: !625, identifier: "44b1f0c24030a4c04c8331584cd7d9f8")
!692 = !{!693}
!693 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !691, file: !2, baseType: !694, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!694 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::io::error::SimpleMessage", baseType: !695, size: 64, align: 64, dwarfAddressSpace: 0)
!695 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SimpleMessage", scope: !600, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !696, templateParams: !18, identifier: "58518d9eb11cce3c6a44328e67394d1")
!696 = !{!697, !698}
!697 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !695, file: !2, baseType: !631, size: 8, align: 8, offset: 128, flags: DIFlagPublic)
!698 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !695, file: !2, baseType: !27, size: 128, align: 64, flags: DIFlagPublic)
!699 = !DIDerivedType(tag: DW_TAG_member, name: "Custom", scope: !619, file: !2, baseType: !700, size: 128, align: 64, extraData: i128 3)
!700 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !617, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !701, templateParams: !625, identifier: "79e233cd92fa5bf1a1ed7ada4c873b46")
!701 = !{!702}
!702 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !700, file: !2, baseType: !627, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!703 = !DIDerivedType(tag: DW_TAG_member, scope: !617, file: !2, baseType: !31, size: 8, align: 8, flags: DIFlagArtificial)
!704 = !DIDerivedType(tag: DW_TAG_member, name: "ClientError", scope: !589, file: !2, baseType: !705, size: 448, align: 64, extraData: i128 5)
!705 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ClientError", scope: !586, file: !2, size: 448, align: 64, flags: DIFlagPublic, elements: !706, templateParams: !18, identifier: "980723920f912f812cbecb8796f69f5")
!706 = !{!707}
!707 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !705, file: !2, baseType: !708, size: 192, align: 64, offset: 64, flags: DIFlagPublic)
!708 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ClientError", scope: !587, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !709, templateParams: !18, identifier: "2aac3a63fd76407191cf163e1527816d")
!709 = !{!710}
!710 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !708, file: !2, size: 192, align: 64, elements: !711, templateParams: !18, identifier: "1c3f7d6f4942bb3d7da3beebd427cb82", discriminator: !734)
!711 = !{!712, !714}
!712 = !DIDerivedType(tag: DW_TAG_member, name: "KeyTooLong", scope: !710, file: !2, baseType: !713, size: 192, align: 64, extraData: i128 9223372036854775809)
!713 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "KeyTooLong", scope: !708, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !18, identifier: "f6ac8785ca6e661dac4b6aec1d2778c2")
!714 = !DIDerivedType(tag: DW_TAG_member, name: "Error", scope: !710, file: !2, baseType: !715, size: 192, align: 64)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !708, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !716, templateParams: !18, identifier: "faf7321513096f4f641ede0fb195ad6e")
!716 = !{!717}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !715, file: !2, baseType: !718, size: 192, align: 64, flags: DIFlagPublic)
!718 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Cow<str>", scope: !719, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !720, templateParams: !18, identifier: "d7e94e3b32b2b2f231d508ddad018c66")
!719 = !DINamespace(name: "borrow", scope: !50)
!720 = !{!721}
!721 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !718, file: !2, size: 192, align: 64, elements: !722, templateParams: !18, identifier: "d526a9eae6c75f5dcbab70b019ecdf43", discriminator: !733)
!722 = !{!723, !729}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "Borrowed", scope: !721, file: !2, baseType: !724, size: 192, align: 64, extraData: i128 9223372036854775808)
!724 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Borrowed", scope: !718, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !725, templateParams: !727, identifier: "144a934a0860b9befe0524fe96dacadc")
!725 = !{!726}
!726 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !724, file: !2, baseType: !27, size: 128, align: 64, offset: 64, flags: DIFlagPublic)
!727 = !{!728}
!728 = !DITemplateTypeParameter(name: "B", type: !31)
!729 = !DIDerivedType(tag: DW_TAG_member, name: "Owned", scope: !721, file: !2, baseType: !730, size: 192, align: 64)
!730 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Owned", scope: !718, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !731, templateParams: !727, identifier: "9fd3d023fab3750ce3da840c5c1f16a4")
!731 = !{!732}
!732 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !730, file: !2, baseType: !573, size: 192, align: 64, flags: DIFlagPublic)
!733 = !DIDerivedType(tag: DW_TAG_member, scope: !718, file: !2, baseType: !114, size: 64, align: 64, flags: DIFlagArtificial)
!734 = !DIDerivedType(tag: DW_TAG_member, scope: !708, file: !2, baseType: !114, size: 64, align: 64, flags: DIFlagArtificial)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "ServerError", scope: !589, file: !2, baseType: !736, size: 448, align: 64, extraData: i128 6)
!736 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ServerError", scope: !586, file: !2, size: 448, align: 64, flags: DIFlagPublic, elements: !737, templateParams: !18, identifier: "ad4e50050d414f90ff142d49d89d2bb5")
!737 = !{!738}
!738 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !736, file: !2, baseType: !739, size: 256, align: 64, offset: 64, flags: DIFlagPublic)
!739 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ServerError", scope: !587, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !740, templateParams: !18, identifier: "dca7d3d8ad0c498bd046ffd6e2ef75a1")
!740 = !{!741}
!741 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !739, file: !2, size: 256, align: 64, elements: !742, templateParams: !18, identifier: "d1e46dcf746322761c839c3c818dd110", discriminator: !755)
!742 = !{!743, !747, !751}
!743 = !DIDerivedType(tag: DW_TAG_member, name: "BadMagic", scope: !741, file: !2, baseType: !744, size: 256, align: 64, extraData: i128 0)
!744 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BadMagic", scope: !739, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !745, templateParams: !18, identifier: "357917e562d6065541a45b32b1ffe528")
!745 = !{!746}
!746 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !744, file: !2, baseType: !31, size: 8, align: 8, offset: 8, flags: DIFlagPublic)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "BadResponse", scope: !741, file: !2, baseType: !748, size: 256, align: 64, extraData: i128 1)
!748 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "BadResponse", scope: !739, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !749, templateParams: !18, identifier: "7b79d7b4fa4755c08842cf85d2fb4be3")
!749 = !{!750}
!750 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !748, file: !2, baseType: !718, size: 192, align: 64, offset: 64, flags: DIFlagPublic)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "Error", scope: !741, file: !2, baseType: !752, size: 256, align: 64, extraData: i128 2)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !739, file: !2, size: 256, align: 64, flags: DIFlagPublic, elements: !753, templateParams: !18, identifier: "b93bc9f2b8446e51e3994deae9074af5")
!753 = !{!754}
!754 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !752, file: !2, baseType: !573, size: 192, align: 64, offset: 64, flags: DIFlagPublic)
!755 = !DIDerivedType(tag: DW_TAG_member, scope: !739, file: !2, baseType: !31, size: 8, align: 8, flags: DIFlagArtificial)
!756 = !DIDerivedType(tag: DW_TAG_member, name: "CommandError", scope: !589, file: !2, baseType: !757, size: 448, align: 64, extraData: i128 7)
!757 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CommandError", scope: !586, file: !2, size: 448, align: 64, flags: DIFlagPublic, elements: !758, templateParams: !18, identifier: "dc4277b3494fffdfaf2385453dc23173")
!758 = !{!759}
!759 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !757, file: !2, baseType: !760, size: 32, align: 16, offset: 64, flags: DIFlagPublic)
!760 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CommandError", scope: !587, file: !2, size: 32, align: 16, flags: DIFlagPublic, elements: !761, templateParams: !18, identifier: "e6d8c6970c0279058d1312f9f6dd24ff")
!761 = !{!762}
!762 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !760, file: !2, size: 32, align: 16, elements: !763, templateParams: !18, identifier: "1c07671d48efa275d0872ab95ba39837", discriminator: !780)
!763 = !{!764, !766, !768, !770, !772, !774, !778}
!764 = !DIDerivedType(tag: DW_TAG_member, name: "KeyExists", scope: !762, file: !2, baseType: !765, size: 32, align: 16, extraData: i128 0)
!765 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "KeyExists", scope: !760, file: !2, size: 32, align: 16, flags: DIFlagPublic, elements: !18, identifier: "b3d862596ded05b136c4a67237482d87")
!766 = !DIDerivedType(tag: DW_TAG_member, name: "KeyNotFound", scope: !762, file: !2, baseType: !767, size: 32, align: 16, extraData: i128 1)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "KeyNotFound", scope: !760, file: !2, size: 32, align: 16, flags: DIFlagPublic, elements: !18, identifier: "ef5987cc5f223d99275c1e34f0bca0a8")
!768 = !DIDerivedType(tag: DW_TAG_member, name: "ValueTooLarge", scope: !762, file: !2, baseType: !769, size: 32, align: 16, extraData: i128 2)
!769 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ValueTooLarge", scope: !760, file: !2, size: 32, align: 16, flags: DIFlagPublic, elements: !18, identifier: "51bff76a5be4a579ca82435572cf9b8")
!770 = !DIDerivedType(tag: DW_TAG_member, name: "InvalidArguments", scope: !762, file: !2, baseType: !771, size: 32, align: 16, extraData: i128 3)
!771 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "InvalidArguments", scope: !760, file: !2, size: 32, align: 16, flags: DIFlagPublic, elements: !18, identifier: "eec122f030d6779d3993abb0b442d4bd")
!772 = !DIDerivedType(tag: DW_TAG_member, name: "AuthenticationRequired", scope: !762, file: !2, baseType: !773, size: 32, align: 16, extraData: i128 4)
!773 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AuthenticationRequired", scope: !760, file: !2, size: 32, align: 16, flags: DIFlagPublic, elements: !18, identifier: "d53178d0d1100d3fc44398823e8a07a5")
!774 = !DIDerivedType(tag: DW_TAG_member, name: "Unknown", scope: !762, file: !2, baseType: !775, size: 32, align: 16, extraData: i128 5)
!775 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Unknown", scope: !760, file: !2, size: 32, align: 16, flags: DIFlagPublic, elements: !776, templateParams: !18, identifier: "8484c3134d72ee9c29c1bd43a1b4ac6")
!776 = !{!777}
!777 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !775, file: !2, baseType: !481, size: 16, align: 16, offset: 16, flags: DIFlagPublic)
!778 = !DIDerivedType(tag: DW_TAG_member, name: "InvalidCommand", scope: !762, file: !2, baseType: !779, size: 32, align: 16, extraData: i128 6)
!779 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "InvalidCommand", scope: !760, file: !2, size: 32, align: 16, flags: DIFlagPublic, elements: !18, identifier: "21d862d1eed70c975e41221420c253e7")
!780 = !DIDerivedType(tag: DW_TAG_member, scope: !760, file: !2, baseType: !481, size: 16, align: 16, flags: DIFlagArtificial)
!781 = !DIDerivedType(tag: DW_TAG_member, name: "OpensslError", scope: !589, file: !2, baseType: !782, size: 448, align: 64)
!782 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "OpensslError", scope: !586, file: !2, size: 448, align: 64, flags: DIFlagPublic, elements: !783, templateParams: !18, identifier: "12123d0637e65cea31855fa24a3f152b")
!783 = !{!784}
!784 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !782, file: !2, baseType: !785, size: 448, align: 64, flags: DIFlagPublic)
!785 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "HandshakeError<std::net::tcp::TcpStream>", scope: !786, file: !2, size: 448, align: 64, flags: DIFlagPublic, elements: !787, templateParams: !18, identifier: "7ea53c8a95687cce9ee1a5e411c99eba")
!786 = !DINamespace(name: "error", scope: !497)
!787 = !{!788}
!788 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !785, file: !2, size: 448, align: 64, elements: !789, templateParams: !18, identifier: "43fa3fc9d6f5eb13b57d9f70b9d7b0be", discriminator: !893)
!789 = !{!790, !848, !889}
!790 = !DIDerivedType(tag: DW_TAG_member, name: "SetupFailure", scope: !788, file: !2, baseType: !791, size: 448, align: 64, extraData: i128 0)
!791 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SetupFailure", scope: !785, file: !2, size: 448, align: 64, flags: DIFlagPublic, elements: !792, templateParams: !541, identifier: "25a3c209675dccbba38adfeb29bb24a7")
!792 = !{!793}
!793 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !791, file: !2, baseType: !794, size: 192, align: 64, offset: 64, flags: DIFlagPublic)
!794 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ErrorStack", scope: !795, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !796, templateParams: !18, identifier: "e51c787fb75b86f71a77d32b13acc75")
!795 = !DINamespace(name: "error", scope: !498)
!796 = !{!797}
!797 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !794, file: !2, baseType: !798, size: 192, align: 64, flags: DIFlagPrivate)
!798 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<openssl::error::Error, alloc::alloc::Global>", scope: !222, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !799, templateParams: !846, identifier: "3142e55b4ca4afd98839bc9c08be339d")
!799 = !{!800, !847}
!800 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !798, file: !2, baseType: !801, size: 128, align: 64, flags: DIFlagPrivate)
!801 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<openssl::error::Error, alloc::alloc::Global>", scope: !226, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !802, templateParams: !846, identifier: "eaa34da03f1889cae265130efefbef89")
!802 = !{!803, !804}
!803 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !801, file: !2, baseType: !229, size: 128, align: 64, flags: DIFlagPrivate)
!804 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !801, file: !2, baseType: !805, align: 8, offset: 128, flags: DIFlagPrivate)
!805 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<openssl::error::Error>", scope: !242, file: !2, align: 8, flags: DIFlagPublic, elements: !18, templateParams: !806, identifier: "154498194ec279d8a6257fbf4524f007")
!806 = !{!807}
!807 = !DITemplateTypeParameter(name: "T", type: !808)
!808 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !795, file: !2, size: 512, align: 64, flags: DIFlagPublic, elements: !809, templateParams: !18, identifier: "ee293c83332657c5cbfb3ecadb6d6306")
!809 = !{!810, !811, !817, !818, !832}
!810 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !808, file: !2, baseType: !114, size: 64, align: 64, offset: 320, flags: DIFlagPrivate)
!811 = !DIDerivedType(tag: DW_TAG_member, name: "file", scope: !808, file: !2, baseType: !812, size: 64, align: 64, offset: 384, flags: DIFlagPrivate)
!812 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ShimStr", scope: !795, file: !2, size: 64, align: 64, flags: DIFlagPrivate, elements: !813, templateParams: !18, identifier: "7f1a7be56fa17e22a99fe8b661cf23b5")
!813 = !{!814}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !812, file: !2, baseType: !815, size: 64, align: 64, flags: DIFlagPrivate)
!815 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const i8", baseType: !816, size: 64, align: 64, dwarfAddressSpace: 0)
!816 = !DIBasicType(name: "i8", size: 8, encoding: DW_ATE_signed)
!817 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !808, file: !2, baseType: !453, size: 32, align: 32, offset: 448, flags: DIFlagPrivate)
!818 = !DIDerivedType(tag: DW_TAG_member, name: "func", scope: !808, file: !2, baseType: !819, size: 128, align: 64, flags: DIFlagPrivate)
!819 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Option<openssl::error::ShimStr>", scope: !86, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !820, templateParams: !18, identifier: "712251e49370f6297c40eec772fdfcfd")
!820 = !{!821}
!821 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !819, file: !2, size: 128, align: 64, elements: !822, templateParams: !18, identifier: "b26ecc681540039ad0274a45119096d6", discriminator: !831)
!822 = !{!823, !827}
!823 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !821, file: !2, baseType: !824, size: 128, align: 64, extraData: i128 0)
!824 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !819, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !18, templateParams: !825, identifier: "45bfe5c01b96b795b6120979afa8a434")
!825 = !{!826}
!826 = !DITemplateTypeParameter(name: "T", type: !812)
!827 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !821, file: !2, baseType: !828, size: 128, align: 64, extraData: i128 1)
!828 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !819, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !829, templateParams: !825, identifier: "21c4b4c11f924f93fcccbe093a64215e")
!829 = !{!830}
!830 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !828, file: !2, baseType: !812, size: 64, align: 64, offset: 64, flags: DIFlagPublic)
!831 = !DIDerivedType(tag: DW_TAG_member, scope: !819, file: !2, baseType: !114, size: 64, align: 64, flags: DIFlagArtificial)
!832 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !808, file: !2, baseType: !833, size: 192, align: 64, offset: 128, flags: DIFlagPrivate)
!833 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Option<alloc::borrow::Cow<str>>", scope: !86, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !834, templateParams: !18, identifier: "2a19b8c3422ed81a57c9f86b6b65b5a6")
!834 = !{!835}
!835 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !833, file: !2, size: 192, align: 64, elements: !836, templateParams: !18, identifier: "2ed834d9068184fda84467ac1fc5f6a4", discriminator: !845)
!836 = !{!837, !841}
!837 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !835, file: !2, baseType: !838, size: 192, align: 64, extraData: i128 9223372036854775809)
!838 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !833, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !18, templateParams: !839, identifier: "ac3e729d63b14a5df29e4d896bd95ebc")
!839 = !{!840}
!840 = !DITemplateTypeParameter(name: "T", type: !718)
!841 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !835, file: !2, baseType: !842, size: 192, align: 64)
!842 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !833, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !843, templateParams: !839, identifier: "e97e0dfee68da45f6e8357ac0efce140")
!843 = !{!844}
!844 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !842, file: !2, baseType: !718, size: 192, align: 64, flags: DIFlagPublic)
