; ModuleID = 'function-22ad8eae67534948.bc'
source_filename = "e26wc5euu2o1o4dh7ysa3oqdb"
target datalayout = "e-m:e-p270:32:32-p271:32:32-p272:64:64-i64:64-i128:128-f80:128-n8:16:32:64-S128"
target triple = "x86_64-unknown-linux-gnu"

%"core::sync::atomic::AtomicUsize" = type { i64 }
%"alloc::sync::SliceArcInnerForStatic" = type { %"alloc::sync::ArcInner<[u8; 1]>", [1 x i64] }
%"alloc::sync::ArcInner<[u8; 1]>" = type { %"core::sync::atomic::AtomicUsize", %"core::sync::atomic::AtomicUsize", [1 x i8], [7 x i8] }

@vtable.0 = private constant <{ [24 x i8], ptr }> <{ [24 x i8] c"\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00\01\00\00\00\00\00\00\00", ptr @"_ZN41_$LT$T$u20$as$u20$serde..de..Expected$GT$3fmt17h9b5b9f1da8ecac16E" }>, align 8, !dbg !0
@alloc_4192ed3b92b550c0d82c6e919997c0e9 = private unnamed_addr constant <{ [10 x i8] }> <{ [10 x i8] c"<redacted>" }>, align 1
@alloc_ae52e422ab29884b58622d79788975fe = private unnamed_addr constant <{ ptr, [16 x i8] }> <{ ptr @alloc_4192ed3b92b550c0d82c6e919997c0e9, [16 x i8] c"\0A\00\00\00\00\00\00\00\00\00\00\00\00\00\00\00" }>, align 8
@alloc_8654d27ce1e18ede425bdb1be5d1281e = private unnamed_addr constant <{ [21 x i8] }> <{ [21 x i8] c"WriteHomeTimelineArgs" }>, align 1
@alloc_fbf529a31431d812ea51987957c18fdb = private unnamed_addr constant <{ [7 x i8] }> <{ [7 x i8] c"post_id" }>, align 1
@alloc_17c2596754a11fa444906090c11cb050 = private unnamed_addr constant <{ [7 x i8] }> <{ [7 x i8] c"user_id" }>, align 1

!0 = !DIGlobalVariableExpression(var: !1, expr: !DIExpression())
!1 = distinct !DIGlobalVariable(name: "<serde::de::impls::{impl#56}::deserialize::PrimitiveVisitor as serde::de::Expected>::{vtable}", scope: null, file: !2, type: !3, isLocal: true, isDefinition: true)
!2 = !DIFile(filename: "<unknown>", directory: "")
!3 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<serde::de::impls::{impl#56}::deserialize::PrimitiveVisitor as serde::de::Expected>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !4, vtableHolder: !12, templateParams: !18, identifier: "bae54b5ea4340ac2915486ae8a71a003")
!4 = !{!5, !8, !10, !11}
!5 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !3, file: !2, baseType: !6, size: 64, align: 64)
!6 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const ()", baseType: !7, size: 64, align: 64, dwarfAddressSpace: 0)
!7 = !DIBasicType(name: "()", encoding: DW_ATE_unsigned)
!8 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!9 = !DIBasicType(name: "usize", size: 64, encoding: DW_ATE_unsigned)
!10 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !3, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!11 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !3, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!12 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PrimitiveVisitor", scope: !13, file: !2, align: 8, flags: DIFlagProtected, elements: !18, identifier: "9ac9f16a1816f561b56061afc5222841")
!13 = !DINamespace(name: "deserialize", scope: !14)
!14 = !DINamespace(name: "{impl#56}", scope: !15)
!15 = !DINamespace(name: "impls", scope: !16)
!16 = !DINamespace(name: "de", scope: !17)
!17 = !DINamespace(name: "serde", scope: null)
!18 = !{}
!19 = !DIGlobalVariableExpression(var: !20, expr: !DIExpression())
!20 = distinct !DIGlobalVariable(name: "<&str as serde::de::Expected>::{vtable}", scope: null, file: !2, type: !21, isLocal: true, isDefinition: true)
!21 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<&str as serde::de::Expected>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !22, vtableHolder: !27, templateParams: !18, identifier: "ac7d269918305f93affcf98e75a47afd")
!22 = !{!23, !24, !25, !26}
!23 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !21, file: !2, baseType: !6, size: 64, align: 64)
!24 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !21, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!25 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !21, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!26 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !21, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!27 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "&str", file: !2, size: 128, align: 64, elements: !28, templateParams: !18, identifier: "9277eecd40495f85161460476aacc992")
!28 = !{!29, !32}
!29 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !27, file: !2, baseType: !30, size: 64, align: 64)
!30 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !31, size: 64, align: 64, dwarfAddressSpace: 0)
!31 = !DIBasicType(name: "u8", size: 8, encoding: DW_ATE_unsigned)
!32 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !27, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!33 = !DIGlobalVariableExpression(var: !34, expr: !DIExpression())
!34 = distinct !DIGlobalVariable(name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable}", scope: null, file: !2, type: !35, isLocal: true, isDefinition: true)
!35 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<std::rt::lang_start::{closure_env#0}<()> as core::ops::function::Fn<()>>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !36, vtableHolder: !43, templateParams: !18, identifier: "75c835d45ec3845b6357738c91f422a2")
!36 = !{!37, !38, !39, !40, !41, !42}
!37 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !35, file: !2, baseType: !6, size: 64, align: 64)
!38 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !35, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!39 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !35, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!40 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !35, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!41 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !35, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!42 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !35, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!43 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}<()>", scope: !44, file: !2, size: 64, align: 64, elements: !47, templateParams: !18, identifier: "5a3638dc470e86c7bd83a8a7b11bdf77")
!44 = !DINamespace(name: "lang_start", scope: !45)
!45 = !DINamespace(name: "rt", scope: !46)
!46 = !DINamespace(name: "std", scope: null)
!47 = !{!48}
!48 = !DIDerivedType(tag: DW_TAG_member, name: "main", scope: !43, file: !2, baseType: !49, size: 64, align: 64)
!49 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "fn()", baseType: !50, size: 64, align: 64, dwarfAddressSpace: 0)
!50 = !DISubroutineType(types: !51)
!51 = !{null}
!52 = !DIGlobalVariableExpression(var: !53, expr: !DIExpression())
!53 = distinct !DIGlobalVariable(name: "<std::thread::{impl#0}::spawn_unchecked_::{closure_env#1}<function::main::{closure_env#0}, alloc::string::String> as core::ops::function::FnOnce<()>>::{vtable}", scope: null, file: !2, type: !54, isLocal: true, isDefinition: true)
!54 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<std::thread::{impl#0}::spawn_unchecked_::{closure_env#1}<function::main::{closure_env#0}, alloc::string::String> as core::ops::function::FnOnce<()>>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !55, vtableHolder: !60, templateParams: !18, identifier: "bf83035788965caa8e98382fb72e2a67")
!55 = !{!56, !57, !58, !59}
!56 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !54, file: !2, baseType: !6, size: 64, align: 64)
!57 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !54, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!58 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !54, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!59 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !54, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!60 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#1}<function::main::{closure_env#0}, alloc::string::String>", scope: !61, file: !2, size: 640, align: 64, elements: !64, templateParams: !18, identifier: "4ac18e09064849b147ac98d15d23952")
!61 = !DINamespace(name: "spawn_unchecked_", scope: !62)
!62 = !DINamespace(name: "{impl#0}", scope: !63)
!63 = !DINamespace(name: "thread", scope: !46)
!64 = !{!65, !196, !253, !331}
!65 = !DIDerivedType(tag: DW_TAG_member, name: "their_thread", scope: !60, file: !2, baseType: !66, size: 128, align: 64)
!66 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Thread", scope: !63, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !67, templateParams: !18, identifier: "7e68460eac5b6a554b903eeb000d3587")
!67 = !{!68}
!68 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !66, file: !2, baseType: !69, size: 128, align: 64, flags: DIFlagPrivate)
!69 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Inner", scope: !63, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !70, templateParams: !18, identifier: "d6971be6f4ae42599dadc5d8b5a8666d")
!70 = !{!71}
!71 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !69, file: !2, size: 128, align: 64, elements: !72, templateParams: !18, identifier: "375a926e15d62b1fd7ad34323f60a9c4", discriminator: !195)
!72 = !{!73, !117}
!73 = !DIDerivedType(tag: DW_TAG_member, name: "Main", scope: !71, file: !2, baseType: !74, size: 128, align: 64, extraData: i128 0)
!74 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Main", scope: !69, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !75, templateParams: !18, identifier: "76f49e9093459769bfa404ba8f79c4d2")
!75 = !{!76}
!76 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !74, file: !2, baseType: !77, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!77 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&(std::thread::ThreadId, std::sys::sync::thread_parking::futex::Parker)", baseType: !78, size: 64, align: 64, dwarfAddressSpace: 0)
!78 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "(std::thread::ThreadId, std::sys::sync::thread_parking::futex::Parker)", file: !2, size: 128, align: 64, elements: !79, templateParams: !18, identifier: "8d2e61420e4c7784efd9db6dfe18aa06")
!79 = !{!80, !97}
!80 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !78, file: !2, baseType: !81, size: 64, align: 64)
!81 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ThreadId", scope: !63, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !82, templateParams: !18, identifier: "696222e7c1910a5ef54bd914a19283fd")
!82 = !{!83}
!83 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !81, file: !2, baseType: !84, size: 64, align: 64, flags: DIFlagPrivate)
!84 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NonZero<u64>", scope: !85, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !88, templateParams: !95, identifier: "4b3eeea3bd97f783b900fa7d60f1fe65")
!85 = !DINamespace(name: "nonzero", scope: !86)
!86 = !DINamespace(name: "num", scope: !87)
!87 = !DINamespace(name: "core", scope: null)
!88 = !{!89}
!89 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !84, file: !2, baseType: !90, size: 64, align: 64, flags: DIFlagPrivate)
!90 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NonZeroU64Inner", scope: !91, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !92, templateParams: !18, identifier: "7ba061e63f1d4d38818cdc86e6660fe2")
!91 = !DINamespace(name: "private", scope: !85)
!92 = !{!93}
!93 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !90, file: !2, baseType: !94, size: 64, align: 64, flags: DIFlagPrivate)
!94 = !DIBasicType(name: "u64", size: 64, encoding: DW_ATE_unsigned)
!95 = !{!96}
!96 = !DITemplateTypeParameter(name: "T", type: !94)
!97 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !78, file: !2, baseType: !98, size: 32, align: 32, offset: 64)
!98 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Parker", scope: !99, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !103, templateParams: !18, identifier: "b9052408eb7c940c84158600be1d7c9e")
!99 = !DINamespace(name: "futex", scope: !100)
!100 = !DINamespace(name: "thread_parking", scope: !101)
!101 = !DINamespace(name: "sync", scope: !102)
!102 = !DINamespace(name: "sys", scope: !46)
!103 = !{!104}
!104 = !DIDerivedType(tag: DW_TAG_member, name: "state", scope: !98, file: !2, baseType: !105, size: 32, align: 32, flags: DIFlagPrivate)
!105 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicU32", scope: !106, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !108, templateParams: !18, identifier: "451fc188b8fe8bfd1634b64add62811c")
!106 = !DINamespace(name: "atomic", scope: !107)
!107 = !DINamespace(name: "sync", scope: !87)
!108 = !{!109}
!109 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !105, file: !2, baseType: !110, size: 32, align: 32, flags: DIFlagPrivate)
!110 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u32>", scope: !111, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !112, templateParams: !115, identifier: "8496947ab5894ae9c038ce14557831d")
!111 = !DINamespace(name: "cell", scope: !87)
!112 = !{!113}
!113 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !110, file: !2, baseType: !114, size: 32, align: 32, flags: DIFlagPrivate)
!114 = !DIBasicType(name: "u32", size: 32, encoding: DW_ATE_unsigned)
!115 = !{!116}
!116 = !DITemplateTypeParameter(name: "T", type: !114)
!117 = !DIDerivedType(tag: DW_TAG_member, name: "Other", scope: !71, file: !2, baseType: !118, size: 128, align: 64, extraData: i128 1)
!118 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Other", scope: !69, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !119, templateParams: !18, identifier: "4f45885389e5c5859ef84b3f852ba4c9")
!119 = !{!120}
!120 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !118, file: !2, baseType: !121, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!121 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Pin<alloc::sync::Arc<std::thread::OtherInner, alloc::alloc::Global>>", scope: !122, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !123, templateParams: !193, identifier: "9d4557ce0a409e43a938fa5745f91a8e")
!122 = !DINamespace(name: "pin", scope: !87)
!123 = !{!124}
!124 = !DIDerivedType(tag: DW_TAG_member, name: "__pointer", scope: !121, file: !2, baseType: !125, size: 64, align: 64, flags: DIFlagPublic)
!125 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<std::thread::OtherInner, alloc::alloc::Global>", scope: !126, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !128, templateParams: !191, identifier: "eeebc4c1e913eafdfce858cf51136fb6")
!126 = !DINamespace(name: "sync", scope: !127)
!127 = !DINamespace(name: "alloc", scope: null)
!128 = !{!129, !185, !188}
!129 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !125, file: !2, baseType: !130, size: 64, align: 64, flags: DIFlagPrivate)
!130 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<std::thread::OtherInner>>", scope: !131, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !133, templateParams: !183, identifier: "5f8d5b4a6fafc7e272476d131ac1d8b8")
!131 = !DINamespace(name: "non_null", scope: !132)
!132 = !DINamespace(name: "ptr", scope: !87)
!133 = !{!134}
!134 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !130, file: !2, baseType: !135, size: 64, align: 64, flags: DIFlagPrivate)
!135 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<std::thread::OtherInner>", baseType: !136, size: 64, align: 64, dwarfAddressSpace: 0)
!136 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<std::thread::OtherInner>", scope: !126, file: !2, size: 384, align: 64, flags: DIFlagPrivate, elements: !137, templateParams: !181, identifier: "7c01005b2694b7219f1df7062fb7ab48")
!137 = !{!138, !147, !148}
!138 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !136, file: !2, baseType: !139, size: 64, align: 64, flags: DIFlagPrivate)
!139 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicUsize", scope: !106, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !140, templateParams: !18, identifier: "7895742ee1c683d59df9ab63ad4ac5e3")
!140 = !{!141}
!141 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !139, file: !2, baseType: !142, size: 64, align: 64, flags: DIFlagPrivate)
!142 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<usize>", scope: !111, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !143, templateParams: !145, identifier: "b2c1878745bff3418ec36c32186fb94c")
!143 = !{!144}
!144 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !142, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!145 = !{!146}
!146 = !DITemplateTypeParameter(name: "T", type: !9)
!147 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !136, file: !2, baseType: !139, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!148 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !136, file: !2, baseType: !149, size: 256, align: 64, offset: 128, flags: DIFlagPrivate)
!149 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "OtherInner", scope: !63, file: !2, size: 256, align: 64, flags: DIFlagPrivate, elements: !150, templateParams: !18, identifier: "fc7b316bc40b15d14de8b92f3fffd7c5")
!150 = !{!151, !179, !180}
!151 = !DIDerivedType(tag: DW_TAG_member, name: "name", scope: !149, file: !2, baseType: !152, size: 128, align: 64, offset: 64, flags: DIFlagPrivate)
!152 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Option<std::thread::thread_name_string::ThreadNameString>", scope: !153, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !154, templateParams: !18, identifier: "7634e2885c4d1ad0f4544f5f9aafcb48")
!153 = !DINamespace(name: "option", scope: !87)
!154 = !{!155}
!155 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !152, file: !2, size: 128, align: 64, elements: !156, templateParams: !18, identifier: "5aaf41694ce9162b2c82bcd7f72acb67", discriminator: !178)
!156 = !{!157, !174}
!157 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !155, file: !2, baseType: !158, size: 128, align: 64, extraData: i128 0)
!158 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !152, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !18, templateParams: !159, identifier: "94f5241f3f08401a817a2be332842ecd")
!159 = !{!160}
!160 = !DITemplateTypeParameter(name: "T", type: !161)
!161 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ThreadNameString", scope: !162, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !163, templateParams: !18, identifier: "de0b0ca6c67bd393fab41b2b90d8ab02")
!162 = !DINamespace(name: "thread_name_string", scope: !63)
!163 = !{!164}
!164 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !161, file: !2, baseType: !165, size: 128, align: 64, flags: DIFlagPrivate)
!165 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "CString", scope: !166, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !168, templateParams: !18, identifier: "ee93160a9c01b76466c1f98ab8f7b51e")
!166 = !DINamespace(name: "c_str", scope: !167)
!167 = !DINamespace(name: "ffi", scope: !127)
!168 = !{!169}
!169 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !165, file: !2, baseType: !170, size: 128, align: 64, flags: DIFlagPrivate)
!170 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<[u8], alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !171, templateParams: !18, identifier: "690b38d85ed73887aa25014825f9b673")
!171 = !{!172, !173}
!172 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !170, file: !2, baseType: !30, size: 64, align: 64)
!173 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !170, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!174 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !155, file: !2, baseType: !175, size: 128, align: 64)
!175 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !152, file: !2, size: 128, align: 64, flags: DIFlagPublic, elements: !176, templateParams: !159, identifier: "a388ab8843fa8afb79d43c5e255ffd33")
!176 = !{!177}
!177 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !175, file: !2, baseType: !161, size: 128, align: 64, flags: DIFlagPublic)
!178 = !DIDerivedType(tag: DW_TAG_member, scope: !152, file: !2, baseType: !94, size: 64, align: 64, flags: DIFlagArtificial)
!179 = !DIDerivedType(tag: DW_TAG_member, name: "id", scope: !149, file: !2, baseType: !81, size: 64, align: 64, flags: DIFlagPrivate)
!180 = !DIDerivedType(tag: DW_TAG_member, name: "parker", scope: !149, file: !2, baseType: !98, size: 32, align: 32, offset: 192, flags: DIFlagPrivate)
!181 = !{!182}
!182 = !DITemplateTypeParameter(name: "T", type: !149)
!183 = !{!184}
!184 = !DITemplateTypeParameter(name: "T", type: !136)
!185 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !125, file: !2, baseType: !186, align: 8, offset: 64, flags: DIFlagPrivate)
!186 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<std::thread::OtherInner>>", scope: !187, file: !2, align: 8, flags: DIFlagPublic, elements: !18, templateParams: !183, identifier: "9688cfdde391526ea384c42ccd69d9f4")
!187 = !DINamespace(name: "marker", scope: !87)
!188 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !125, file: !2, baseType: !189, align: 8, offset: 64, flags: DIFlagPrivate)
!189 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Global", scope: !190, file: !2, align: 8, flags: DIFlagPublic, elements: !18, identifier: "5e9c32a9496c2cdfe285ed82771e12cb")
!190 = !DINamespace(name: "alloc", scope: !127)
!191 = !{!182, !192}
!192 = !DITemplateTypeParameter(name: "A", type: !189)
!193 = !{!194}
!194 = !DITemplateTypeParameter(name: "Ptr", type: !125)
!195 = !DIDerivedType(tag: DW_TAG_member, scope: !69, file: !2, baseType: !94, size: 64, align: 64, flags: DIFlagArtificial)
!196 = !DIDerivedType(tag: DW_TAG_member, name: "f", scope: !60, file: !2, baseType: !197, size: 192, align: 64, offset: 448)
!197 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "MaybeDangling<function::main::{closure_env#0}>", scope: !61, file: !2, size: 192, align: 64, flags: DIFlagProtected, elements: !198, templateParams: !251, identifier: "1ab2da1363d3e80797e6c38cebd2ecb0")
!198 = !{!199}
!199 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !197, file: !2, baseType: !200, size: 192, align: 64, flags: DIFlagProtected)
!200 = distinct !DICompositeType(tag: DW_TAG_union_type, name: "MaybeUninit<function::main::{closure_env#0}>", scope: !201, file: !2, size: 192, align: 64, elements: !203, templateParams: !251, identifier: "3b3dfe6d1c9d62c5c89a155dd67fe272")
!201 = !DINamespace(name: "maybe_uninit", scope: !202)
!202 = !DINamespace(name: "mem", scope: !87)
!203 = !{!204, !205}
!204 = !DIDerivedType(tag: DW_TAG_member, name: "uninit", scope: !200, file: !2, baseType: !7, align: 8)
!205 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !200, file: !2, baseType: !206, size: 192, align: 64)
!206 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ManuallyDrop<function::main::{closure_env#0}>", scope: !207, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !208, templateParams: !251, identifier: "cfb614cf171340f5486b565bc5cbace8")
!207 = !DINamespace(name: "manually_drop", scope: !202)
!208 = !{!209}
!209 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !206, file: !2, baseType: !210, size: 192, align: 64, flags: DIFlagPrivate)
!210 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "{closure_env#0}", scope: !211, file: !2, size: 192, align: 64, elements: !213, templateParams: !18, identifier: "1543a610656ab37dfb2822fc12ce1b1e")
!211 = !DINamespace(name: "main", scope: !212)
!212 = !DINamespace(name: "function", scope: null)
!213 = !{!214}
!214 = !DIDerivedType(tag: DW_TAG_member, name: "args_str", scope: !210, file: !2, baseType: !215, size: 192, align: 64)
!215 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "String", scope: !216, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !217, templateParams: !18, identifier: "3543478f9d8178e55b9780d6b517ce6b")
!216 = !DINamespace(name: "string", scope: !127)
!217 = !{!218}
!218 = !DIDerivedType(tag: DW_TAG_member, name: "vec", scope: !215, file: !2, baseType: !219, size: 192, align: 64, flags: DIFlagPrivate)
!219 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<u8, alloc::alloc::Global>", scope: !220, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !221, templateParams: !249, identifier: "6a9b334118d58c39299dd55b2f68c4c2")
!220 = !DINamespace(name: "vec", scope: !127)
!221 = !{!222, !250}
!222 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !219, file: !2, baseType: !223, size: 128, align: 64, flags: DIFlagPrivate)
!223 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<u8, alloc::alloc::Global>", scope: !224, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !225, templateParams: !249, identifier: "2799711429c43f0cf4b69e8f3427468")
!224 = !DINamespace(name: "raw_vec", scope: !127)
!225 = !{!226, !248}
!226 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !223, file: !2, baseType: !227, size: 128, align: 64, flags: DIFlagPrivate)
!227 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RawVecInner<alloc::alloc::Global>", scope: !224, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !228, templateParams: !247, identifier: "8795a9b9afc5c3d5c816ccd0b1f2254a")
!228 = !{!229, !242, !246}
!229 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !227, file: !2, baseType: !230, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!230 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Unique<u8>", scope: !231, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !232, templateParams: !238, identifier: "45d3d32c3fa3ed011283cc027c70b446")
!231 = !DINamespace(name: "unique", scope: !132)
!232 = !{!233, !240}
!233 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !230, file: !2, baseType: !234, size: 64, align: 64, flags: DIFlagPrivate)
!234 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<u8>", scope: !131, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !235, templateParams: !238, identifier: "e4dd93bbf61e57243c4526436a25a1a7")
!235 = !{!236}
!236 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !234, file: !2, baseType: !237, size: 64, align: 64, flags: DIFlagPrivate)
!237 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const u8", baseType: !31, size: 64, align: 64, dwarfAddressSpace: 0)
!238 = !{!239}
!239 = !DITemplateTypeParameter(name: "T", type: !31)
!240 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !230, file: !2, baseType: !241, align: 8, offset: 64, flags: DIFlagPrivate)
!241 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<u8>", scope: !187, file: !2, align: 8, flags: DIFlagPublic, elements: !18, templateParams: !238, identifier: "bf56aa13654ce739a584ce5bf3966456")
!242 = !DIDerivedType(tag: DW_TAG_member, name: "cap", scope: !227, file: !2, baseType: !243, size: 64, align: 64, flags: DIFlagPrivate)
!243 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Cap", scope: !224, file: !2, size: 64, align: 64, flags: DIFlagPrivate, elements: !244, templateParams: !18, identifier: "49a4dd7d735085543d7b927df1dec353")
!244 = !{!245}
!245 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !243, file: !2, baseType: !9, size: 64, align: 64, flags: DIFlagPrivate)
!246 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !227, file: !2, baseType: !189, align: 8, offset: 128, flags: DIFlagPrivate)
!247 = !{!192}
!248 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !223, file: !2, baseType: !241, align: 8, offset: 128, flags: DIFlagPrivate)
!249 = !{!239, !192}
!250 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !219, file: !2, baseType: !9, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!251 = !{!252}
!252 = !DITemplateTypeParameter(name: "T", type: !210)
!253 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !60, file: !2, baseType: !254, size: 256, align: 64, offset: 128)
!254 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ChildSpawnHooks", scope: !255, file: !2, size: 256, align: 64, flags: DIFlagProtected, elements: !256, templateParams: !18, identifier: "1013db8fe096ad286d51569b064cee90")
!255 = !DINamespace(name: "spawnhook", scope: !63)
!256 = !{!257, !308}
!257 = !DIDerivedType(tag: DW_TAG_member, name: "hooks", scope: !254, file: !2, baseType: !258, size: 64, align: 64, offset: 192, flags: DIFlagPrivate)
!258 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpawnHooks", scope: !255, file: !2, size: 64, align: 64, flags: DIFlagPrivate, elements: !259, templateParams: !18, identifier: "46d9bb5c21e3baac6ac4824399781481")
!259 = !{!260}
!260 = !DIDerivedType(tag: DW_TAG_member, name: "first", scope: !258, file: !2, baseType: !261, size: 64, align: 64, flags: DIFlagPrivate)
!261 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Option<alloc::sync::Arc<std::thread::spawnhook::SpawnHook, alloc::alloc::Global>>", scope: !153, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !262, templateParams: !18, identifier: "ec108a062adff0c2f9b6e5907894b66")
!262 = !{!263}
!263 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !261, file: !2, size: 64, align: 64, elements: !264, templateParams: !18, identifier: "8f7eceb50ab615869ad7a29354630bae", discriminator: !307)
!264 = !{!265, !303}
!265 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !263, file: !2, baseType: !266, size: 64, align: 64, extraData: i128 0)
!266 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !261, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !18, templateParams: !267, identifier: "7cc1e3f66549be45dbefa6a292940824")
!267 = !{!268}
!268 = !DITemplateTypeParameter(name: "T", type: !269)
!269 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<std::thread::spawnhook::SpawnHook, alloc::alloc::Global>", scope: !126, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !270, templateParams: !302, identifier: "800a3312153b9580ce7ee3e35132d7a9")
!270 = !{!271, !299, !301}
!271 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !269, file: !2, baseType: !272, size: 64, align: 64, flags: DIFlagPrivate)
!272 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<std::thread::spawnhook::SpawnHook>>", scope: !131, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !273, templateParams: !297, identifier: "330407b158bdb4d190ea5cd7d9416c0d")
!273 = !{!274}
!274 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !272, file: !2, baseType: !275, size: 64, align: 64, flags: DIFlagPrivate)
!275 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<std::thread::spawnhook::SpawnHook>", baseType: !276, size: 64, align: 64, dwarfAddressSpace: 0)
!276 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<std::thread::spawnhook::SpawnHook>", scope: !126, file: !2, size: 320, align: 64, flags: DIFlagPrivate, elements: !277, templateParams: !295, identifier: "1470bebdf1b0a5c5269a42d3e31b6d04")
!277 = !{!278, !279, !280}
!278 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !276, file: !2, baseType: !139, size: 64, align: 64, flags: DIFlagPrivate)
!279 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !276, file: !2, baseType: !139, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!280 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !276, file: !2, baseType: !281, size: 192, align: 64, offset: 128, flags: DIFlagPrivate)
!281 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SpawnHook", scope: !255, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !282, templateParams: !18, identifier: "cd9cbe5b5330aa5fc302e6e4042790ff")
!282 = !{!283, !294}
!283 = !DIDerivedType(tag: DW_TAG_member, name: "hook", scope: !281, file: !2, baseType: !284, size: 128, align: 64, flags: DIFlagPrivate)
!284 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<(dyn core::ops::function::Fn<(&std::thread::Thread), Output=alloc::boxed::Box<(dyn core::ops::function::FnOnce<(), Output=()> + core::marker::Send), alloc::alloc::Global>> + core::marker::Send + core::marker::Sync), alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !285, templateParams: !18, identifier: "b9e0acbb450eaa689ea5b95c50960064")
!285 = !{!286, !289}
!286 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !284, file: !2, baseType: !287, size: 64, align: 64)
!287 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !288, size: 64, align: 64, dwarfAddressSpace: 0)
!288 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn core::ops::function::Fn<(&std::thread::Thread), Output=alloc::boxed::Box<(dyn core::ops::function::FnOnce<(), Output=()> + core::marker::Send), alloc::alloc::Global>> + core::marker::Send + core::marker::Sync)", file: !2, align: 8, elements: !18, identifier: "9a78891514742105a654e3af2db1c5")
!289 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !284, file: !2, baseType: !290, size: 64, align: 64, offset: 64)
!290 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 6]", baseType: !291, size: 64, align: 64, dwarfAddressSpace: 0)
!291 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 384, align: 64, elements: !292)
!292 = !{!293}
!293 = !DISubrange(count: 6, lowerBound: 0)
!294 = !DIDerivedType(tag: DW_TAG_member, name: "next", scope: !281, file: !2, baseType: !261, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!295 = !{!296}
!296 = !DITemplateTypeParameter(name: "T", type: !281)
!297 = !{!298}
!298 = !DITemplateTypeParameter(name: "T", type: !276)
!299 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !269, file: !2, baseType: !300, align: 8, offset: 64, flags: DIFlagPrivate)
!300 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<std::thread::spawnhook::SpawnHook>>", scope: !187, file: !2, align: 8, flags: DIFlagPublic, elements: !18, templateParams: !297, identifier: "8a4f8346da9d5305a06cede5113f225b")
!301 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !269, file: !2, baseType: !189, align: 8, offset: 64, flags: DIFlagPrivate)
!302 = !{!296, !192}
!303 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !263, file: !2, baseType: !304, size: 64, align: 64)
!304 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !261, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !305, templateParams: !267, identifier: "5b3ad7041a0263121b2dfdfccba19b6")
!305 = !{!306}
!306 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !304, file: !2, baseType: !269, size: 64, align: 64, flags: DIFlagPublic)
!307 = !DIDerivedType(tag: DW_TAG_member, scope: !261, file: !2, baseType: !94, size: 64, align: 64, flags: DIFlagArtificial)
!308 = !DIDerivedType(tag: DW_TAG_member, name: "to_run", scope: !254, file: !2, baseType: !309, size: 192, align: 64, flags: DIFlagPrivate)
!309 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Vec<alloc::boxed::Box<(dyn core::ops::function::FnOnce<(), Output=()> + core::marker::Send), alloc::alloc::Global>, alloc::alloc::Global>", scope: !220, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !310, templateParams: !329, identifier: "6dbe4556b74f14b468f71c3725e0876f")
!310 = !{!311, !330}
!311 = !DIDerivedType(tag: DW_TAG_member, name: "buf", scope: !309, file: !2, baseType: !312, size: 128, align: 64, flags: DIFlagPrivate)
!312 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RawVec<alloc::boxed::Box<(dyn core::ops::function::FnOnce<(), Output=()> + core::marker::Send), alloc::alloc::Global>, alloc::alloc::Global>", scope: !224, file: !2, size: 128, align: 64, flags: DIFlagProtected, elements: !313, templateParams: !329, identifier: "c940eb5c9e19dba35c00acc137122953")
!313 = !{!314, !315}
!314 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !312, file: !2, baseType: !227, size: 128, align: 64, flags: DIFlagPrivate)
!315 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !312, file: !2, baseType: !316, align: 8, offset: 128, flags: DIFlagPrivate)
!316 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::boxed::Box<(dyn core::ops::function::FnOnce<(), Output=()> + core::marker::Send), alloc::alloc::Global>>", scope: !187, file: !2, align: 8, flags: DIFlagPublic, elements: !18, templateParams: !317, identifier: "c8c055fc7ad7d7b1ffba2b5b0bd3c2b8")
!317 = !{!318}
!318 = !DITemplateTypeParameter(name: "T", type: !319)
!319 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<(dyn core::ops::function::FnOnce<(), Output=()> + core::marker::Send), alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !320, templateParams: !18, identifier: "4b9f4a66c25b8ce3b8c21ce0921f43a")
!320 = !{!321, !324}
!321 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !319, file: !2, baseType: !322, size: 64, align: 64)
!322 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !323, size: 64, align: 64, dwarfAddressSpace: 0)
!323 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn core::ops::function::FnOnce<(), Output=()> + core::marker::Send)", file: !2, align: 8, elements: !18, identifier: "43838b18cb2c894c6aea89633b3ab532")
!324 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !319, file: !2, baseType: !325, size: 64, align: 64, offset: 64)
!325 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 4]", baseType: !326, size: 64, align: 64, dwarfAddressSpace: 0)
!326 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 256, align: 64, elements: !327)
!327 = !{!328}
!328 = !DISubrange(count: 4, lowerBound: 0)
!329 = !{!318, !192}
!330 = !DIDerivedType(tag: DW_TAG_member, name: "len", scope: !309, file: !2, baseType: !9, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!331 = !DIDerivedType(tag: DW_TAG_member, name: "their_packet", scope: !60, file: !2, baseType: !332, size: 64, align: 64, offset: 384)
!332 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<std::thread::Packet<alloc::string::String>, alloc::alloc::Global>", scope: !126, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !333, templateParams: !460, identifier: "c446dd393f201b3e9f53a50f7991d90f")
!333 = !{!334, !457, !459}
!334 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !332, file: !2, baseType: !335, size: 64, align: 64, flags: DIFlagPrivate)
!335 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<std::thread::Packet<alloc::string::String>>>", scope: !131, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !336, templateParams: !455, identifier: "492f01b7c0b0505d31ad335accf67e0c")
!336 = !{!337}
!337 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !335, file: !2, baseType: !338, size: 64, align: 64, flags: DIFlagPrivate)
!338 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<std::thread::Packet<alloc::string::String>>", baseType: !339, size: 64, align: 64, dwarfAddressSpace: 0)
!339 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<std::thread::Packet<alloc::string::String>>", scope: !126, file: !2, size: 384, align: 64, flags: DIFlagPrivate, elements: !340, templateParams: !453, identifier: "8d191a4e0de4d3314789a287403fb21e")
!340 = !{!341, !342, !343}
!341 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !339, file: !2, baseType: !139, size: 64, align: 64, flags: DIFlagPrivate)
!342 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !339, file: !2, baseType: !139, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!343 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !339, file: !2, baseType: !344, size: 256, align: 64, offset: 128, flags: DIFlagPrivate)
!344 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Packet<alloc::string::String>", scope: !63, file: !2, size: 256, align: 64, flags: DIFlagPrivate, elements: !345, templateParams: !452, identifier: "d6b7c5f6f89ca034586cebe266431bc8")
!345 = !{!346, !392, !434}
!346 = !DIDerivedType(tag: DW_TAG_member, name: "scope", scope: !344, file: !2, baseType: !347, size: 64, align: 64, flags: DIFlagPrivate)
!347 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Option<alloc::sync::Arc<std::thread::scoped::ScopeData, alloc::alloc::Global>>", scope: !153, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !348, templateParams: !18, identifier: "7550bf6ecafee27290eb044fec9d5da6")
!348 = !{!349}
!349 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !347, file: !2, size: 64, align: 64, elements: !350, templateParams: !18, identifier: "9b32d7292a34b98f26015b8b5ee6dc65", discriminator: !391)
!350 = !{!351, !387}
!351 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !349, file: !2, baseType: !352, size: 64, align: 64, extraData: i128 0)
!352 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !347, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !18, templateParams: !353, identifier: "c51083f3eaaf27a6a30227370efb2fd")
!353 = !{!354}
!354 = !DITemplateTypeParameter(name: "T", type: !355)
!355 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Arc<std::thread::scoped::ScopeData, alloc::alloc::Global>", scope: !126, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !356, templateParams: !386, identifier: "67eab9f20c35b24fa50ad72987ab3d6a")
!356 = !{!357, !383, !385}
!357 = !DIDerivedType(tag: DW_TAG_member, name: "ptr", scope: !355, file: !2, baseType: !358, size: 64, align: 64, flags: DIFlagPrivate)
!358 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<alloc::sync::ArcInner<std::thread::scoped::ScopeData>>", scope: !131, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !359, templateParams: !381, identifier: "94a3ec476125d916ef60863941ec166d")
!359 = !{!360}
!360 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !358, file: !2, baseType: !361, size: 64, align: 64, flags: DIFlagPrivate)
!361 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "*const alloc::sync::ArcInner<std::thread::scoped::ScopeData>", baseType: !362, size: 64, align: 64, dwarfAddressSpace: 0)
!362 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ArcInner<std::thread::scoped::ScopeData>", scope: !126, file: !2, size: 384, align: 64, flags: DIFlagPrivate, elements: !363, templateParams: !379, identifier: "8c913a58393fe378c77b48512380b3f2")
!363 = !{!364, !365, !366}
!364 = !DIDerivedType(tag: DW_TAG_member, name: "strong", scope: !362, file: !2, baseType: !139, size: 64, align: 64, flags: DIFlagPrivate)
!365 = !DIDerivedType(tag: DW_TAG_member, name: "weak", scope: !362, file: !2, baseType: !139, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!366 = !DIDerivedType(tag: DW_TAG_member, name: "data", scope: !362, file: !2, baseType: !367, size: 256, align: 64, offset: 128, flags: DIFlagPrivate)
!367 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ScopeData", scope: !368, file: !2, size: 256, align: 64, flags: DIFlagProtected, elements: !369, templateParams: !18, identifier: "4bce437f54bf65ae4786ef0869a7685d")
!368 = !DINamespace(name: "scoped", scope: !63)
!369 = !{!370, !371, !378}
!370 = !DIDerivedType(tag: DW_TAG_member, name: "num_running_threads", scope: !367, file: !2, baseType: !139, size: 64, align: 64, offset: 128, flags: DIFlagPrivate)
!371 = !DIDerivedType(tag: DW_TAG_member, name: "a_thread_panicked", scope: !367, file: !2, baseType: !372, size: 8, align: 8, offset: 192, flags: DIFlagPrivate)
!372 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "AtomicBool", scope: !106, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !373, templateParams: !18, identifier: "ddb2f54188924ff11438b5023cfea5db")
!373 = !{!374}
!374 = !DIDerivedType(tag: DW_TAG_member, name: "v", scope: !372, file: !2, baseType: !375, size: 8, align: 8, flags: DIFlagPrivate)
!375 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<u8>", scope: !111, file: !2, size: 8, align: 8, flags: DIFlagPublic, elements: !376, templateParams: !238, identifier: "d0c6d3efd144a12e8c44524fbf620a5d")
!376 = !{!377}
!377 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !375, file: !2, baseType: !31, size: 8, align: 8, flags: DIFlagPrivate)
!378 = !DIDerivedType(tag: DW_TAG_member, name: "main_thread", scope: !367, file: !2, baseType: !66, size: 128, align: 64, flags: DIFlagPrivate)
!379 = !{!380}
!380 = !DITemplateTypeParameter(name: "T", type: !367)
!381 = !{!382}
!382 = !DITemplateTypeParameter(name: "T", type: !362)
!383 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !355, file: !2, baseType: !384, align: 8, offset: 64, flags: DIFlagPrivate)
!384 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<std::thread::scoped::ScopeData>>", scope: !187, file: !2, align: 8, flags: DIFlagPublic, elements: !18, templateParams: !381, identifier: "6450a9dff9d13f5e1c6950e1fc1618a3")
!385 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !355, file: !2, baseType: !189, align: 8, offset: 64, flags: DIFlagPrivate)
!386 = !{!380, !192}
!387 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !349, file: !2, baseType: !388, size: 64, align: 64)
!388 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !347, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !389, templateParams: !353, identifier: "ff82dccd75291121f2abadfdcfeed5")
!389 = !{!390}
!390 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !388, file: !2, baseType: !355, size: 64, align: 64, flags: DIFlagPublic)
!391 = !DIDerivedType(tag: DW_TAG_member, scope: !347, file: !2, baseType: !94, size: 64, align: 64, flags: DIFlagArtificial)
!392 = !DIDerivedType(tag: DW_TAG_member, name: "result", scope: !344, file: !2, baseType: !393, size: 192, align: 64, offset: 64, flags: DIFlagPrivate)
!393 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UnsafeCell<core::option::Option<core::result::Result<alloc::string::String, alloc::boxed::Box<(dyn core::any::Any + core::marker::Send), alloc::alloc::Global>>>>", scope: !111, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !394, templateParams: !432, identifier: "c98b2f68474a17674e8393f1bda1557")
!394 = !{!395}
!395 = !DIDerivedType(tag: DW_TAG_member, name: "value", scope: !393, file: !2, baseType: !396, size: 192, align: 64, flags: DIFlagPrivate)
!396 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Option<core::result::Result<alloc::string::String, alloc::boxed::Box<(dyn core::any::Any + core::marker::Send), alloc::alloc::Global>>>", scope: !153, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !397, templateParams: !18, identifier: "b3504c8dcaf937e8de141c7b9fcbea3")
!397 = !{!398}
!398 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !396, file: !2, size: 192, align: 64, elements: !399, templateParams: !18, identifier: "2e9e4db817576eb6de769325723fedd7", discriminator: !431)
!399 = !{!400, !427}
!400 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !398, file: !2, baseType: !401, size: 192, align: 64, extraData: i128 9223372036854775809)
!401 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !396, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !18, templateParams: !402, identifier: "3aa8e7293a67fc77895cfec1057767b8")
!402 = !{!403}
!403 = !DITemplateTypeParameter(name: "T", type: !404)
!404 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Result<alloc::string::String, alloc::boxed::Box<(dyn core::any::Any + core::marker::Send), alloc::alloc::Global>>", scope: !405, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !406, templateParams: !18, identifier: "100b68ed5998ac6d1390a07750ea7ea5")
!405 = !DINamespace(name: "result", scope: !87)
!406 = !{!407}
!407 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !404, file: !2, size: 192, align: 64, elements: !408, templateParams: !18, identifier: "d4f7fb5ff939fbf7e99641c1149917ca", discriminator: !426)
!408 = !{!409, !422}
!409 = !DIDerivedType(tag: DW_TAG_member, name: "Ok", scope: !407, file: !2, baseType: !410, size: 192, align: 64)
!410 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Ok", scope: !404, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !411, templateParams: !413, identifier: "2f8e0f379c6dcf398561097bff2fa165")
!411 = !{!412}
!412 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !410, file: !2, baseType: !215, size: 192, align: 64, flags: DIFlagPublic)
!413 = !{!414, !415}
!414 = !DITemplateTypeParameter(name: "T", type: !215)
!415 = !DITemplateTypeParameter(name: "E", type: !416)
!416 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<(dyn core::any::Any + core::marker::Send), alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !417, templateParams: !18, identifier: "a86d87c58475796bb21562457f27e066")
!417 = !{!418, !421}
!418 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !416, file: !2, baseType: !419, size: 64, align: 64)
!419 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !420, size: 64, align: 64, dwarfAddressSpace: 0)
!420 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn core::any::Any + core::marker::Send)", file: !2, align: 8, elements: !18, identifier: "87c934ae46cc152d920ca0b1bc2b5827")
!421 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !416, file: !2, baseType: !325, size: 64, align: 64, offset: 64)
!422 = !DIDerivedType(tag: DW_TAG_member, name: "Err", scope: !407, file: !2, baseType: !423, size: 192, align: 64, extraData: i128 9223372036854775808)
!423 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Err", scope: !404, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !424, templateParams: !413, identifier: "40d140f70bed6e95e3c2d4f75a643611")
!424 = !{!425}
!425 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !423, file: !2, baseType: !416, size: 128, align: 64, offset: 64, flags: DIFlagPublic)
!426 = !DIDerivedType(tag: DW_TAG_member, scope: !404, file: !2, baseType: !94, size: 64, align: 64, flags: DIFlagArtificial)
!427 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !398, file: !2, baseType: !428, size: 192, align: 64)
!428 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !396, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !429, templateParams: !402, identifier: "426793f384a35f324d003862466530aa")
!429 = !{!430}
!430 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !428, file: !2, baseType: !404, size: 192, align: 64, flags: DIFlagPublic)
!431 = !DIDerivedType(tag: DW_TAG_member, scope: !396, file: !2, baseType: !94, size: 64, align: 64, flags: DIFlagArtificial)
!432 = !{!433}
!433 = !DITemplateTypeParameter(name: "T", type: !396)
!434 = !DIDerivedType(tag: DW_TAG_member, name: "_marker", scope: !344, file: !2, baseType: !435, align: 8, offset: 256, flags: DIFlagPrivate)
!435 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<core::option::Option<&std::thread::scoped::ScopeData>>", scope: !187, file: !2, align: 8, flags: DIFlagPublic, elements: !18, templateParams: !436, identifier: "b7c9bb9a7cf2a26435f64bbeacb5a055")
!436 = !{!437}
!437 = !DITemplateTypeParameter(name: "T", type: !438)
!438 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Option<&std::thread::scoped::ScopeData>", scope: !153, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !439, templateParams: !18, identifier: "2d12a3098a6732f0c863ce61a94a7545")
!439 = !{!440}
!440 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !438, file: !2, size: 64, align: 64, elements: !441, templateParams: !18, identifier: "669b5d96fc2c50fb13e9f0da0b7f0def", discriminator: !451)
!441 = !{!442, !447}
!442 = !DIDerivedType(tag: DW_TAG_member, name: "None", scope: !440, file: !2, baseType: !443, size: 64, align: 64, extraData: i128 0)
!443 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "None", scope: !438, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !18, templateParams: !444, identifier: "d23ef971b91e59533d1ebba5d461f495")
!444 = !{!445}
!445 = !DITemplateTypeParameter(name: "T", type: !446)
!446 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::thread::scoped::ScopeData", baseType: !367, size: 64, align: 64, dwarfAddressSpace: 0)
!447 = !DIDerivedType(tag: DW_TAG_member, name: "Some", scope: !440, file: !2, baseType: !448, size: 64, align: 64)
!448 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Some", scope: !438, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !449, templateParams: !444, identifier: "37c9e11609b9b73174e6fbcc8f7dff17")
!449 = !{!450}
!450 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !448, file: !2, baseType: !446, size: 64, align: 64, flags: DIFlagPublic)
!451 = !DIDerivedType(tag: DW_TAG_member, scope: !438, file: !2, baseType: !94, size: 64, align: 64, flags: DIFlagArtificial)
!452 = !{!414}
!453 = !{!454}
!454 = !DITemplateTypeParameter(name: "T", type: !344)
!455 = !{!456}
!456 = !DITemplateTypeParameter(name: "T", type: !339)
!457 = !DIDerivedType(tag: DW_TAG_member, name: "phantom", scope: !332, file: !2, baseType: !458, align: 8, offset: 64, flags: DIFlagPrivate)
!458 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<alloc::sync::ArcInner<std::thread::Packet<alloc::string::String>>>", scope: !187, file: !2, align: 8, flags: DIFlagPublic, elements: !18, templateParams: !455, identifier: "a46ce30443255d8252e6437ff17e2967")
!459 = !DIDerivedType(tag: DW_TAG_member, name: "alloc", scope: !332, file: !2, baseType: !189, align: 8, offset: 64, flags: DIFlagPrivate)
!460 = !{!454, !192}
!461 = !DIGlobalVariableExpression(var: !462, expr: !DIExpression())
!462 = distinct !DIGlobalVariable(name: "<alloc::string::String as core::fmt::Write>::{vtable}", scope: null, file: !2, type: !463, isLocal: true, isDefinition: true)
!463 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<alloc::string::String as core::fmt::Write>::{vtable_type}", file: !2, size: 384, align: 64, flags: DIFlagArtificial, elements: !464, vtableHolder: !215, templateParams: !18, identifier: "2f928d3f62b714864721090890b04ef1")
!464 = !{!465, !466, !467, !468, !469, !470}
!465 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !463, file: !2, baseType: !6, size: 64, align: 64)
!466 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !463, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!467 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !463, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!468 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !463, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!469 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !463, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!470 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !463, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!471 = !DIGlobalVariableExpression(var: !472, expr: !DIExpression())
!472 = distinct !DIGlobalVariable(name: "<std::io::error::Error as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !473, isLocal: true, isDefinition: true)
!473 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<std::io::error::Error as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !474, vtableHolder: !479, templateParams: !18, identifier: "7aa66347231427cc63ab7b4478a415a2")
!474 = !{!475, !476, !477, !478}
!475 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !473, file: !2, baseType: !6, size: 64, align: 64)
!476 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !473, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!477 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !473, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!478 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !473, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!479 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !480, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !482, templateParams: !18, identifier: "ecc4f0422ebd245827cc9408cc3115cf")
!480 = !DINamespace(name: "error", scope: !481)
!481 = !DINamespace(name: "io", scope: !46)
!482 = !{!483}
!483 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !479, file: !2, baseType: !484, size: 64, align: 64, flags: DIFlagPrivate)
!484 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Repr", scope: !485, file: !2, size: 64, align: 64, flags: DIFlagProtected, elements: !486, templateParams: !18, identifier: "f9171ae77d01e2aa1d3b54c98c9f3a5e")
!485 = !DINamespace(name: "repr_bitpacked", scope: !480)
!486 = !{!487, !493}
!487 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !484, file: !2, baseType: !488, size: 64, align: 64, flags: DIFlagPrivate)
!488 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NonNull<()>", scope: !131, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !489, templateParams: !491, identifier: "c51e1494c8f57d5ac0b27f086d3b1cbd")
!489 = !{!490}
!490 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !488, file: !2, baseType: !6, size: 64, align: 64, flags: DIFlagPrivate)
!491 = !{!492}
!492 = !DITemplateTypeParameter(name: "T", type: !7)
!493 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !484, file: !2, baseType: !494, align: 8, offset: 64, flags: DIFlagPrivate)
!494 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "PhantomData<std::io::error::ErrorData<alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>>>", scope: !187, file: !2, align: 8, flags: DIFlagPublic, elements: !18, templateParams: !495, identifier: "efb9500539eaf2aa94ff4fc0d90020b6")
!495 = !{!496}
!496 = !DITemplateTypeParameter(name: "T", type: !497)
!497 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ErrorData<alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>>", scope: !480, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !498, templateParams: !18, identifier: "1816e4f78d4a9671ac3a9a4b2c372edd")
!498 = !{!499}
!499 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !497, file: !2, size: 128, align: 64, elements: !500, templateParams: !18, identifier: "cba42fbe423ea1d33dfa89734a0cd470", discriminator: !584)
!500 = !{!501, !567, !571, !580}
!501 = !DIDerivedType(tag: DW_TAG_member, name: "Os", scope: !499, file: !2, baseType: !502, size: 128, align: 64, extraData: i128 0)
!502 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Os", scope: !497, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !503, templateParams: !506, identifier: "bb1b0710e727cef1f5368786585adba4")
!503 = !{!504}
!504 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !502, file: !2, baseType: !505, size: 32, align: 32, offset: 32, flags: DIFlagPrivate)
!505 = !DIBasicType(name: "i32", size: 32, encoding: DW_ATE_signed)
!506 = !{!507}
!507 = !DITemplateTypeParameter(name: "C", type: !508)
!508 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "alloc::boxed::Box<std::io::error::Custom, alloc::alloc::Global>", baseType: !509, size: 64, align: 64, dwarfAddressSpace: 0)
!509 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !480, file: !2, size: 192, align: 64, flags: DIFlagPrivate, elements: !510, templateParams: !18, identifier: "adb9abebbe7b54834e03ff1533fd9814")
!510 = !{!511, !556}
!511 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !509, file: !2, baseType: !512, size: 8, align: 8, offset: 128, flags: DIFlagPrivate)
!512 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ErrorKind", scope: !480, file: !2, baseType: !31, size: 8, align: 8, flags: DIFlagEnumClass, elements: !513)
!513 = !{!514, !515, !516, !517, !518, !519, !520, !521, !522, !523, !524, !525, !526, !527, !528, !529, !530, !531, !532, !533, !534, !535, !536, !537, !538, !539, !540, !541, !542, !543, !544, !545, !546, !547, !548, !549, !550, !551, !552, !553, !554, !555}
!514 = !DIEnumerator(name: "NotFound", value: 0, isUnsigned: true)
!515 = !DIEnumerator(name: "PermissionDenied", value: 1, isUnsigned: true)
!516 = !DIEnumerator(name: "ConnectionRefused", value: 2, isUnsigned: true)
!517 = !DIEnumerator(name: "ConnectionReset", value: 3, isUnsigned: true)
!518 = !DIEnumerator(name: "HostUnreachable", value: 4, isUnsigned: true)
!519 = !DIEnumerator(name: "NetworkUnreachable", value: 5, isUnsigned: true)
!520 = !DIEnumerator(name: "ConnectionAborted", value: 6, isUnsigned: true)
!521 = !DIEnumerator(name: "NotConnected", value: 7, isUnsigned: true)
!522 = !DIEnumerator(name: "AddrInUse", value: 8, isUnsigned: true)
!523 = !DIEnumerator(name: "AddrNotAvailable", value: 9, isUnsigned: true)
!524 = !DIEnumerator(name: "NetworkDown", value: 10, isUnsigned: true)
!525 = !DIEnumerator(name: "BrokenPipe", value: 11, isUnsigned: true)
!526 = !DIEnumerator(name: "AlreadyExists", value: 12, isUnsigned: true)
!527 = !DIEnumerator(name: "WouldBlock", value: 13, isUnsigned: true)
!528 = !DIEnumerator(name: "NotADirectory", value: 14, isUnsigned: true)
!529 = !DIEnumerator(name: "IsADirectory", value: 15, isUnsigned: true)
!530 = !DIEnumerator(name: "DirectoryNotEmpty", value: 16, isUnsigned: true)
!531 = !DIEnumerator(name: "ReadOnlyFilesystem", value: 17, isUnsigned: true)
!532 = !DIEnumerator(name: "FilesystemLoop", value: 18, isUnsigned: true)
!533 = !DIEnumerator(name: "StaleNetworkFileHandle", value: 19, isUnsigned: true)
!534 = !DIEnumerator(name: "InvalidInput", value: 20, isUnsigned: true)
!535 = !DIEnumerator(name: "InvalidData", value: 21, isUnsigned: true)
!536 = !DIEnumerator(name: "TimedOut", value: 22, isUnsigned: true)
!537 = !DIEnumerator(name: "WriteZero", value: 23, isUnsigned: true)
!538 = !DIEnumerator(name: "StorageFull", value: 24, isUnsigned: true)
!539 = !DIEnumerator(name: "NotSeekable", value: 25, isUnsigned: true)
!540 = !DIEnumerator(name: "QuotaExceeded", value: 26, isUnsigned: true)
!541 = !DIEnumerator(name: "FileTooLarge", value: 27, isUnsigned: true)
!542 = !DIEnumerator(name: "ResourceBusy", value: 28, isUnsigned: true)
!543 = !DIEnumerator(name: "ExecutableFileBusy", value: 29, isUnsigned: true)
!544 = !DIEnumerator(name: "Deadlock", value: 30, isUnsigned: true)
!545 = !DIEnumerator(name: "CrossesDevices", value: 31, isUnsigned: true)
!546 = !DIEnumerator(name: "TooManyLinks", value: 32, isUnsigned: true)
!547 = !DIEnumerator(name: "InvalidFilename", value: 33, isUnsigned: true)
!548 = !DIEnumerator(name: "ArgumentListTooLong", value: 34, isUnsigned: true)
!549 = !DIEnumerator(name: "Interrupted", value: 35, isUnsigned: true)
!550 = !DIEnumerator(name: "Unsupported", value: 36, isUnsigned: true)
!551 = !DIEnumerator(name: "UnexpectedEof", value: 37, isUnsigned: true)
!552 = !DIEnumerator(name: "OutOfMemory", value: 38, isUnsigned: true)
!553 = !DIEnumerator(name: "InProgress", value: 39, isUnsigned: true)
!554 = !DIEnumerator(name: "Other", value: 40, isUnsigned: true)
!555 = !DIEnumerator(name: "Uncategorized", value: 41, isUnsigned: true)
!556 = !DIDerivedType(tag: DW_TAG_member, name: "error", scope: !509, file: !2, baseType: !557, size: 128, align: 64, flags: DIFlagPrivate)
!557 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<(dyn core::error::Error + core::marker::Send + core::marker::Sync), alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !558, templateParams: !18, identifier: "50ed0b914246be383378bdbeb9952528")
!558 = !{!559, !562}
!559 = !DIDerivedType(tag: DW_TAG_member, name: "pointer", scope: !557, file: !2, baseType: !560, size: 64, align: 64)
!560 = !DIDerivedType(tag: DW_TAG_pointer_type, baseType: !561, size: 64, align: 64, dwarfAddressSpace: 0)
!561 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "(dyn core::error::Error + core::marker::Send + core::marker::Sync)", file: !2, align: 8, elements: !18, identifier: "348ef7647c21af37bb908e218266fe3")
!562 = !DIDerivedType(tag: DW_TAG_member, name: "vtable", scope: !557, file: !2, baseType: !563, size: 64, align: 64, offset: 64)
!563 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&[usize; 10]", baseType: !564, size: 64, align: 64, dwarfAddressSpace: 0)
!564 = !DICompositeType(tag: DW_TAG_array_type, baseType: !9, size: 640, align: 64, elements: !565)
!565 = !{!566}
!566 = !DISubrange(count: 10, lowerBound: 0)
!567 = !DIDerivedType(tag: DW_TAG_member, name: "Simple", scope: !499, file: !2, baseType: !568, size: 128, align: 64, extraData: i128 1)
!568 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Simple", scope: !497, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !569, templateParams: !506, identifier: "de749897ded9e9c9fecc4ffc0278e436")
!569 = !{!570}
!570 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !568, file: !2, baseType: !512, size: 8, align: 8, offset: 8, flags: DIFlagPrivate)
!571 = !DIDerivedType(tag: DW_TAG_member, name: "SimpleMessage", scope: !499, file: !2, baseType: !572, size: 128, align: 64, extraData: i128 2)
!572 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SimpleMessage", scope: !497, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !573, templateParams: !506, identifier: "44b1f0c24030a4c04c8331584cd7d9f8")
!573 = !{!574}
!574 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !572, file: !2, baseType: !575, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!575 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "&std::io::error::SimpleMessage", baseType: !576, size: 64, align: 64, dwarfAddressSpace: 0)
!576 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "SimpleMessage", scope: !480, file: !2, size: 192, align: 64, flags: DIFlagPublic, elements: !577, templateParams: !18, identifier: "58518d9eb11cce3c6a44328e67394d1")
!577 = !{!578, !579}
!578 = !DIDerivedType(tag: DW_TAG_member, name: "kind", scope: !576, file: !2, baseType: !512, size: 8, align: 8, offset: 128, flags: DIFlagPublic)
!579 = !DIDerivedType(tag: DW_TAG_member, name: "message", scope: !576, file: !2, baseType: !27, size: 128, align: 64, flags: DIFlagPublic)
!580 = !DIDerivedType(tag: DW_TAG_member, name: "Custom", scope: !499, file: !2, baseType: !581, size: 128, align: 64, extraData: i128 3)
!581 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Custom", scope: !497, file: !2, size: 128, align: 64, flags: DIFlagPrivate, elements: !582, templateParams: !506, identifier: "79e233cd92fa5bf1a1ed7ada4c873b46")
!582 = !{!583}
!583 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !581, file: !2, baseType: !508, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!584 = !DIDerivedType(tag: DW_TAG_member, scope: !497, file: !2, baseType: !31, size: 8, align: 8, flags: DIFlagArtificial)
!585 = !DIGlobalVariableExpression(var: !586, expr: !DIExpression())
!586 = distinct !DIGlobalVariable(name: "<serde_json::error::Error as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !587, isLocal: true, isDefinition: true)
!587 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<serde_json::error::Error as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !588, vtableHolder: !593, templateParams: !18, identifier: "fdd49dd588e9a50abff16e1f9b3c0abb")
!588 = !{!589, !590, !591, !592}
!589 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !587, file: !2, baseType: !6, size: 64, align: 64)
!590 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !587, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!591 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !587, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!592 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !587, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!593 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Error", scope: !594, file: !2, size: 64, align: 64, flags: DIFlagPublic, elements: !596, templateParams: !18, identifier: "51d5564175d3719d732a781e93d9df97")
!594 = !DINamespace(name: "error", scope: !595)
!595 = !DINamespace(name: "serde_json", scope: null)
!596 = !{!597}
!597 = !DIDerivedType(tag: DW_TAG_member, name: "err", scope: !593, file: !2, baseType: !598, size: 64, align: 64, flags: DIFlagPrivate)
!598 = !DIDerivedType(tag: DW_TAG_pointer_type, name: "alloc::boxed::Box<serde_json::error::ErrorImpl, alloc::alloc::Global>", baseType: !599, size: 64, align: 64, dwarfAddressSpace: 0)
!599 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ErrorImpl", scope: !594, file: !2, size: 320, align: 64, flags: DIFlagPrivate, elements: !600, templateParams: !18, identifier: "a6dd08d386b27e7d8b80cb89b868918d")
!600 = !{!601, !665, !666}
!601 = !DIDerivedType(tag: DW_TAG_member, name: "code", scope: !599, file: !2, baseType: !602, size: 192, align: 64, flags: DIFlagPrivate)
!602 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ErrorCode", scope: !594, file: !2, size: 192, align: 64, flags: DIFlagProtected, elements: !603, templateParams: !18, identifier: "36236bb200c8a8a79317d100d62f905c")
!603 = !{!604}
!604 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !602, file: !2, size: 192, align: 64, elements: !605, templateParams: !18, identifier: "ed1507213e27b717289613bd42a8faea", discriminator: !664)
!605 = !{!606, !614, !618, !620, !622, !624, !626, !628, !630, !632, !634, !636, !638, !640, !642, !644, !646, !648, !650, !652, !654, !656, !658, !660, !662}
!606 = !DIDerivedType(tag: DW_TAG_member, name: "Message", scope: !604, file: !2, baseType: !607, size: 192, align: 64, extraData: i128 0)
!607 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Message", scope: !602, file: !2, size: 192, align: 64, flags: DIFlagProtected, elements: !608, templateParams: !18, identifier: "9af12a312996dff29d86fbb34bc3298a")
!608 = !{!609}
!609 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !607, file: !2, baseType: !610, size: 128, align: 64, offset: 64, flags: DIFlagProtected)
!610 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "alloc::boxed::Box<str, alloc::alloc::Global>", file: !2, size: 128, align: 64, elements: !611, templateParams: !18, identifier: "7936981cd78bafd3fba2c785280ae208")
!611 = !{!612, !613}
!612 = !DIDerivedType(tag: DW_TAG_member, name: "data_ptr", scope: !610, file: !2, baseType: !30, size: 64, align: 64)
!613 = !DIDerivedType(tag: DW_TAG_member, name: "length", scope: !610, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!614 = !DIDerivedType(tag: DW_TAG_member, name: "Io", scope: !604, file: !2, baseType: !615, size: 192, align: 64, extraData: i128 1)
!615 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Io", scope: !602, file: !2, size: 192, align: 64, flags: DIFlagProtected, elements: !616, templateParams: !18, identifier: "5db3497ab4d912bb459725b68155e9b2")
!616 = !{!617}
!617 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !615, file: !2, baseType: !479, size: 64, align: 64, offset: 64, flags: DIFlagProtected)
!618 = !DIDerivedType(tag: DW_TAG_member, name: "EofWhileParsingList", scope: !604, file: !2, baseType: !619, size: 192, align: 64, extraData: i128 2)
!619 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EofWhileParsingList", scope: !602, file: !2, size: 192, align: 64, flags: DIFlagProtected, elements: !18, identifier: "f54358d0cfd32d48aadce7759f48303c")
!620 = !DIDerivedType(tag: DW_TAG_member, name: "EofWhileParsingObject", scope: !604, file: !2, baseType: !621, size: 192, align: 64, extraData: i128 3)
!621 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EofWhileParsingObject", scope: !602, file: !2, size: 192, align: 64, flags: DIFlagProtected, elements: !18, identifier: "fe47143ca681d32165250743fa20186")
!622 = !DIDerivedType(tag: DW_TAG_member, name: "EofWhileParsingString", scope: !604, file: !2, baseType: !623, size: 192, align: 64, extraData: i128 4)
!623 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EofWhileParsingString", scope: !602, file: !2, size: 192, align: 64, flags: DIFlagProtected, elements: !18, identifier: "5b6d861c89f1d090bfbe69b16f718040")
!624 = !DIDerivedType(tag: DW_TAG_member, name: "EofWhileParsingValue", scope: !604, file: !2, baseType: !625, size: 192, align: 64, extraData: i128 5)
!625 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "EofWhileParsingValue", scope: !602, file: !2, size: 192, align: 64, flags: DIFlagProtected, elements: !18, identifier: "9a36fb0806ec37317f866a42f5afe3ac")
!626 = !DIDerivedType(tag: DW_TAG_member, name: "ExpectedColon", scope: !604, file: !2, baseType: !627, size: 192, align: 64, extraData: i128 6)
!627 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExpectedColon", scope: !602, file: !2, size: 192, align: 64, flags: DIFlagProtected, elements: !18, identifier: "f86e4bb7ae91fc2e91439ba35b819b09")
!628 = !DIDerivedType(tag: DW_TAG_member, name: "ExpectedListCommaOrEnd", scope: !604, file: !2, baseType: !629, size: 192, align: 64, extraData: i128 7)
!629 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExpectedListCommaOrEnd", scope: !602, file: !2, size: 192, align: 64, flags: DIFlagProtected, elements: !18, identifier: "12b5e8ebe6a703437b7c71048e03468a")
!630 = !DIDerivedType(tag: DW_TAG_member, name: "ExpectedObjectCommaOrEnd", scope: !604, file: !2, baseType: !631, size: 192, align: 64, extraData: i128 8)
!631 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExpectedObjectCommaOrEnd", scope: !602, file: !2, size: 192, align: 64, flags: DIFlagProtected, elements: !18, identifier: "b22d9b8e9ea5f31d6dbd03ed02185ea5")
!632 = !DIDerivedType(tag: DW_TAG_member, name: "ExpectedSomeIdent", scope: !604, file: !2, baseType: !633, size: 192, align: 64, extraData: i128 9)
!633 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExpectedSomeIdent", scope: !602, file: !2, size: 192, align: 64, flags: DIFlagProtected, elements: !18, identifier: "224813a4733d06473ddc93815c996e1a")
!634 = !DIDerivedType(tag: DW_TAG_member, name: "ExpectedSomeValue", scope: !604, file: !2, baseType: !635, size: 192, align: 64, extraData: i128 10)
!635 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExpectedSomeValue", scope: !602, file: !2, size: 192, align: 64, flags: DIFlagProtected, elements: !18, identifier: "e2532b1f14c468f57a1dfe621bd74f5f")
!636 = !DIDerivedType(tag: DW_TAG_member, name: "ExpectedDoubleQuote", scope: !604, file: !2, baseType: !637, size: 192, align: 64, extraData: i128 11)
!637 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExpectedDoubleQuote", scope: !602, file: !2, size: 192, align: 64, flags: DIFlagProtected, elements: !18, identifier: "1ba59bdaa43c5d371e466426b6605911")
!638 = !DIDerivedType(tag: DW_TAG_member, name: "InvalidEscape", scope: !604, file: !2, baseType: !639, size: 192, align: 64, extraData: i128 12)
!639 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "InvalidEscape", scope: !602, file: !2, size: 192, align: 64, flags: DIFlagProtected, elements: !18, identifier: "4e479254dcb78f6d75321d5cd83f8983")
!640 = !DIDerivedType(tag: DW_TAG_member, name: "InvalidNumber", scope: !604, file: !2, baseType: !641, size: 192, align: 64, extraData: i128 13)
!641 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "InvalidNumber", scope: !602, file: !2, size: 192, align: 64, flags: DIFlagProtected, elements: !18, identifier: "842111d2262f2c377880110524a63222")
!642 = !DIDerivedType(tag: DW_TAG_member, name: "NumberOutOfRange", scope: !604, file: !2, baseType: !643, size: 192, align: 64, extraData: i128 14)
!643 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "NumberOutOfRange", scope: !602, file: !2, size: 192, align: 64, flags: DIFlagProtected, elements: !18, identifier: "3249a0d7e432f652c43a13df38c912f6")
!644 = !DIDerivedType(tag: DW_TAG_member, name: "InvalidUnicodeCodePoint", scope: !604, file: !2, baseType: !645, size: 192, align: 64, extraData: i128 15)
!645 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "InvalidUnicodeCodePoint", scope: !602, file: !2, size: 192, align: 64, flags: DIFlagProtected, elements: !18, identifier: "803a86f2ca5bd153e6c223aad880c3fe")
!646 = !DIDerivedType(tag: DW_TAG_member, name: "ControlCharacterWhileParsingString", scope: !604, file: !2, baseType: !647, size: 192, align: 64, extraData: i128 16)
!647 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ControlCharacterWhileParsingString", scope: !602, file: !2, size: 192, align: 64, flags: DIFlagProtected, elements: !18, identifier: "3402ccb8567f215e7ee81b8bb6434f3")
!648 = !DIDerivedType(tag: DW_TAG_member, name: "KeyMustBeAString", scope: !604, file: !2, baseType: !649, size: 192, align: 64, extraData: i128 17)
!649 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "KeyMustBeAString", scope: !602, file: !2, size: 192, align: 64, flags: DIFlagProtected, elements: !18, identifier: "d6f30b01f6fcab875be97b76139d8f60")
!650 = !DIDerivedType(tag: DW_TAG_member, name: "ExpectedNumericKey", scope: !604, file: !2, baseType: !651, size: 192, align: 64, extraData: i128 18)
!651 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExpectedNumericKey", scope: !602, file: !2, size: 192, align: 64, flags: DIFlagProtected, elements: !18, identifier: "9d029fe3f86f157cda11d3196636a87")
!652 = !DIDerivedType(tag: DW_TAG_member, name: "FloatKeyMustBeFinite", scope: !604, file: !2, baseType: !653, size: 192, align: 64, extraData: i128 19)
!653 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FloatKeyMustBeFinite", scope: !602, file: !2, size: 192, align: 64, flags: DIFlagProtected, elements: !18, identifier: "294c839ec0317124f5306cf45279a844")
!654 = !DIDerivedType(tag: DW_TAG_member, name: "LoneLeadingSurrogateInHexEscape", scope: !604, file: !2, baseType: !655, size: 192, align: 64, extraData: i128 20)
!655 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "LoneLeadingSurrogateInHexEscape", scope: !602, file: !2, size: 192, align: 64, flags: DIFlagProtected, elements: !18, identifier: "44e7ed93854a296a1349485e7a2de83")
!656 = !DIDerivedType(tag: DW_TAG_member, name: "TrailingComma", scope: !604, file: !2, baseType: !657, size: 192, align: 64, extraData: i128 21)
!657 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TrailingComma", scope: !602, file: !2, size: 192, align: 64, flags: DIFlagProtected, elements: !18, identifier: "5d2377d98d573fff5d0633d61989ba7c")
!658 = !DIDerivedType(tag: DW_TAG_member, name: "TrailingCharacters", scope: !604, file: !2, baseType: !659, size: 192, align: 64, extraData: i128 22)
!659 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TrailingCharacters", scope: !602, file: !2, size: 192, align: 64, flags: DIFlagProtected, elements: !18, identifier: "756413924cedde678fb44a2ff3ee3ce7")
!660 = !DIDerivedType(tag: DW_TAG_member, name: "UnexpectedEndOfHexEscape", scope: !604, file: !2, baseType: !661, size: 192, align: 64, extraData: i128 23)
!661 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UnexpectedEndOfHexEscape", scope: !602, file: !2, size: 192, align: 64, flags: DIFlagProtected, elements: !18, identifier: "d8b85965abe9dfd13dbc1b17dffe7907")
!662 = !DIDerivedType(tag: DW_TAG_member, name: "RecursionLimitExceeded", scope: !604, file: !2, baseType: !663, size: 192, align: 64, extraData: i128 24)
!663 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RecursionLimitExceeded", scope: !602, file: !2, size: 192, align: 64, flags: DIFlagProtected, elements: !18, identifier: "144798e1dcc22f1ce24aca3afdf53b53")
!664 = !DIDerivedType(tag: DW_TAG_member, scope: !602, file: !2, baseType: !94, size: 64, align: 64, flags: DIFlagArtificial)
!665 = !DIDerivedType(tag: DW_TAG_member, name: "line", scope: !599, file: !2, baseType: !9, size: 64, align: 64, offset: 192, flags: DIFlagPrivate)
!666 = !DIDerivedType(tag: DW_TAG_member, name: "column", scope: !599, file: !2, baseType: !9, size: 64, align: 64, offset: 256, flags: DIFlagPrivate)
!667 = !DIGlobalVariableExpression(var: !668, expr: !DIExpression())
!668 = distinct !DIGlobalVariable(name: "<redis::types::RedisError as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !669, isLocal: true, isDefinition: true)
!669 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<redis::types::RedisError as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !670, vtableHolder: !675, templateParams: !18, identifier: "3d50291bb7f276e68e66a9260510901c")
!670 = !{!671, !672, !673, !674}
!671 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !669, file: !2, baseType: !6, size: 64, align: 64)
!672 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !669, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!673 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !669, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!674 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !669, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!675 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "RedisError", scope: !676, file: !2, size: 448, align: 64, flags: DIFlagPublic, elements: !678, templateParams: !18, identifier: "2d8a714b96f2fe14574f675105c45dba")
!676 = !DINamespace(name: "types", scope: !677)
!677 = !DINamespace(name: "redis", scope: null)
!678 = !{!679}
!679 = !DIDerivedType(tag: DW_TAG_member, name: "repr", scope: !675, file: !2, baseType: !680, size: 448, align: 64, flags: DIFlagPrivate)
!680 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ErrorRepr", scope: !676, file: !2, size: 448, align: 64, flags: DIFlagPrivate, elements: !681, templateParams: !18, identifier: "eb5f7022de90809df851d2318aed57f8")
!681 = !{!682}
!682 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !680, file: !2, size: 448, align: 64, elements: !683, templateParams: !18, identifier: "6a383bd98efcdcad9f121c169192f36d", discriminator: !729)
!683 = !{!684, !714, !720, !725}
!684 = !DIDerivedType(tag: DW_TAG_member, name: "WithDescription", scope: !682, file: !2, baseType: !685, size: 448, align: 64, extraData: i128 0)
!685 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "WithDescription", scope: !680, file: !2, size: 448, align: 64, flags: DIFlagPrivate, elements: !686, templateParams: !18, identifier: "d2759fe594e202e84fdfd7300026ab2a")
!686 = !{!687, !713}
!687 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !685, file: !2, baseType: !688, size: 8, align: 8, offset: 8, flags: DIFlagPrivate)
!688 = !DICompositeType(tag: DW_TAG_enumeration_type, name: "ErrorKind", scope: !676, file: !2, baseType: !31, size: 8, align: 8, flags: DIFlagEnumClass, elements: !689)
!689 = !{!690, !691, !692, !693, !694, !695, !696, !697, !698, !699, !700, !701, !702, !703, !704, !705, !706, !707, !708, !709, !710, !711, !712}
!690 = !DIEnumerator(name: "ResponseError", value: 0, isUnsigned: true)
!691 = !DIEnumerator(name: "ParseError", value: 1, isUnsigned: true)
!692 = !DIEnumerator(name: "AuthenticationFailed", value: 2, isUnsigned: true)
!693 = !DIEnumerator(name: "TypeError", value: 3, isUnsigned: true)
!694 = !DIEnumerator(name: "ExecAbortError", value: 4, isUnsigned: true)
!695 = !DIEnumerator(name: "BusyLoadingError", value: 5, isUnsigned: true)
!696 = !DIEnumerator(name: "NoScriptError", value: 6, isUnsigned: true)
!697 = !DIEnumerator(name: "InvalidClientConfig", value: 7, isUnsigned: true)
!698 = !DIEnumerator(name: "Moved", value: 8, isUnsigned: true)
!699 = !DIEnumerator(name: "Ask", value: 9, isUnsigned: true)
!700 = !DIEnumerator(name: "TryAgain", value: 10, isUnsigned: true)
!701 = !DIEnumerator(name: "ClusterDown", value: 11, isUnsigned: true)
!702 = !DIEnumerator(name: "CrossSlot", value: 12, isUnsigned: true)
!703 = !DIEnumerator(name: "MasterDown", value: 13, isUnsigned: true)
!704 = !DIEnumerator(name: "IoError", value: 14, isUnsigned: true)
!705 = !DIEnumerator(name: "ClientError", value: 15, isUnsigned: true)
!706 = !DIEnumerator(name: "ExtensionError", value: 16, isUnsigned: true)
!707 = !DIEnumerator(name: "ReadOnly", value: 17, isUnsigned: true)
!708 = !DIEnumerator(name: "MasterNameNotFoundBySentinel", value: 18, isUnsigned: true)
!709 = !DIEnumerator(name: "NoValidReplicasFoundBySentinel", value: 19, isUnsigned: true)
!710 = !DIEnumerator(name: "EmptySentinelList", value: 20, isUnsigned: true)
!711 = !DIEnumerator(name: "NotBusy", value: 21, isUnsigned: true)
!712 = !DIEnumerator(name: "ClusterConnectionNotFound", value: 22, isUnsigned: true)
!713 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !685, file: !2, baseType: !27, size: 128, align: 64, offset: 64, flags: DIFlagPrivate)
!714 = !DIDerivedType(tag: DW_TAG_member, name: "WithDescriptionAndDetail", scope: !682, file: !2, baseType: !715, size: 448, align: 64, extraData: i128 1)
!715 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "WithDescriptionAndDetail", scope: !680, file: !2, size: 448, align: 64, flags: DIFlagPrivate, elements: !716, templateParams: !18, identifier: "14b89171b1babb68fb2fb9359325df99")
!716 = !{!717, !718, !719}
!717 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !715, file: !2, baseType: !688, size: 8, align: 8, offset: 8, flags: DIFlagPrivate)
!718 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !715, file: !2, baseType: !27, size: 128, align: 64, offset: 64, flags: DIFlagPrivate)
!719 = !DIDerivedType(tag: DW_TAG_member, name: "__2", scope: !715, file: !2, baseType: !215, size: 192, align: 64, offset: 192, flags: DIFlagPrivate)
!720 = !DIDerivedType(tag: DW_TAG_member, name: "ExtensionError", scope: !682, file: !2, baseType: !721, size: 448, align: 64, extraData: i128 2)
!721 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ExtensionError", scope: !680, file: !2, size: 448, align: 64, flags: DIFlagPrivate, elements: !722, templateParams: !18, identifier: "db31e83d774d16fac614711dc52d551")
!722 = !{!723, !724}
!723 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !721, file: !2, baseType: !215, size: 192, align: 64, offset: 64, flags: DIFlagPrivate)
!724 = !DIDerivedType(tag: DW_TAG_member, name: "__1", scope: !721, file: !2, baseType: !215, size: 192, align: 64, offset: 256, flags: DIFlagPrivate)
!725 = !DIDerivedType(tag: DW_TAG_member, name: "IoError", scope: !682, file: !2, baseType: !726, size: 448, align: 64, extraData: i128 3)
!726 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "IoError", scope: !680, file: !2, size: 448, align: 64, flags: DIFlagPrivate, elements: !727, templateParams: !18, identifier: "31080e43c0bb0794954dda63e1ca2184")
!727 = !{!728}
!728 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !726, file: !2, baseType: !479, size: 64, align: 64, offset: 64, flags: DIFlagPrivate)
!729 = !DIDerivedType(tag: DW_TAG_member, scope: !680, file: !2, baseType: !31, size: 8, align: 8, flags: DIFlagArtificial)
!730 = !DIGlobalVariableExpression(var: !731, expr: !DIExpression())
!731 = distinct !DIGlobalVariable(name: "<alloc::boxed::Box<(dyn core::any::Any + core::marker::Send), alloc::alloc::Global> as core::fmt::Debug>::{vtable}", scope: null, file: !2, type: !732, isLocal: true, isDefinition: true)
!732 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<alloc::boxed::Box<(dyn core::any::Any + core::marker::Send), alloc::alloc::Global> as core::fmt::Debug>::{vtable_type}", file: !2, size: 256, align: 64, flags: DIFlagArtificial, elements: !733, vtableHolder: !416, templateParams: !18, identifier: "d4593e1d8d7d1a1d1e62aac3eb563abd")
!733 = !{!734, !735, !736, !737}
!734 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !732, file: !2, baseType: !6, size: 64, align: 64)
!735 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !732, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!736 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !732, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!737 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !732, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!738 = !DIGlobalVariableExpression(var: !739, expr: !DIExpression())
!739 = distinct !DIGlobalVariable(name: "<redis::connection::Connection as redis::connection::ConnectionLike>::{vtable}", scope: null, file: !2, type: !740, isLocal: true, isDefinition: true)
!740 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "<redis::connection::Connection as redis::connection::ConnectionLike>::{vtable_type}", file: !2, size: 640, align: 64, flags: DIFlagArtificial, elements: !741, vtableHolder: !752, templateParams: !18, identifier: "c4864cb42676aee49d8cb46bf72e20d3")
!741 = !{!742, !743, !744, !745, !746, !747, !748, !749, !750, !751}
!742 = !DIDerivedType(tag: DW_TAG_member, name: "drop_in_place", scope: !740, file: !2, baseType: !6, size: 64, align: 64)
!743 = !DIDerivedType(tag: DW_TAG_member, name: "size", scope: !740, file: !2, baseType: !9, size: 64, align: 64, offset: 64)
!744 = !DIDerivedType(tag: DW_TAG_member, name: "align", scope: !740, file: !2, baseType: !9, size: 64, align: 64, offset: 128)
!745 = !DIDerivedType(tag: DW_TAG_member, name: "__method3", scope: !740, file: !2, baseType: !6, size: 64, align: 64, offset: 192)
!746 = !DIDerivedType(tag: DW_TAG_member, name: "__method4", scope: !740, file: !2, baseType: !6, size: 64, align: 64, offset: 256)
!747 = !DIDerivedType(tag: DW_TAG_member, name: "__method5", scope: !740, file: !2, baseType: !6, size: 64, align: 64, offset: 320)
!748 = !DIDerivedType(tag: DW_TAG_member, name: "__method6", scope: !740, file: !2, baseType: !6, size: 64, align: 64, offset: 384)
!749 = !DIDerivedType(tag: DW_TAG_member, name: "__method7", scope: !740, file: !2, baseType: !6, size: 64, align: 64, offset: 448)
!750 = !DIDerivedType(tag: DW_TAG_member, name: "__method8", scope: !740, file: !2, baseType: !6, size: 64, align: 64, offset: 512)
!751 = !DIDerivedType(tag: DW_TAG_member, name: "__method9", scope: !740, file: !2, baseType: !6, size: 64, align: 64, offset: 576)
!752 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Connection", scope: !753, file: !2, size: 704, align: 64, flags: DIFlagPublic, elements: !754, templateParams: !18, identifier: "9e88e436a99a8d13326399422ef982f5")
!753 = !DINamespace(name: "connection", scope: !677)
!754 = !{!755, !810, !875, !877}
!755 = !DIDerivedType(tag: DW_TAG_member, name: "con", scope: !752, file: !2, baseType: !756, size: 96, align: 32, offset: 576, flags: DIFlagPrivate)
!756 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "ActualConnection", scope: !753, file: !2, size: 96, align: 32, flags: DIFlagPrivate, elements: !757, templateParams: !18, identifier: "89124f8abc387d4365f3248f6c677bce")
!757 = !{!758}
!758 = distinct !DICompositeType(tag: DW_TAG_variant_part, scope: !756, file: !2, size: 96, align: 32, elements: !759, templateParams: !18, identifier: "2c2d5218e44437bd1c5285749ded6512", discriminator: !809)
!759 = !{!760, !795}
!760 = !DIDerivedType(tag: DW_TAG_member, name: "Tcp", scope: !758, file: !2, baseType: !761, size: 96, align: 32, extraData: i128 0)
!761 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Tcp", scope: !756, file: !2, size: 96, align: 32, flags: DIFlagPrivate, elements: !762, templateParams: !18, identifier: "9e2b14743e1855b61abd1eee3908a53e")
!762 = !{!763}
!763 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !761, file: !2, baseType: !764, size: 64, align: 32, offset: 32, flags: DIFlagPrivate)
!764 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TcpConnection", scope: !753, file: !2, size: 64, align: 32, flags: DIFlagPrivate, elements: !765, templateParams: !18, identifier: "5ead86b4db8bdeecf5450a38486d4c21")
!765 = !{!766, !793}
!766 = !DIDerivedType(tag: DW_TAG_member, name: "reader", scope: !764, file: !2, baseType: !767, size: 32, align: 32, flags: DIFlagPrivate)
!767 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TcpStream", scope: !768, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !770, templateParams: !18, identifier: "8097b0e899a257d15dbdb0eda0d0d9c4")
!768 = !DINamespace(name: "tcp", scope: !769)
!769 = !DINamespace(name: "net", scope: !46)
!770 = !{!771}
!771 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !767, file: !2, baseType: !772, size: 32, align: 32, flags: DIFlagPrivate)
!772 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "TcpStream", scope: !773, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !775, templateParams: !18, identifier: "5dab18c89e4dca9b1098cdcb3d8e5696")
!773 = !DINamespace(name: "net", scope: !774)
!774 = !DINamespace(name: "sys_common", scope: !46)
!775 = !{!776}
!776 = !DIDerivedType(tag: DW_TAG_member, name: "inner", scope: !772, file: !2, baseType: !777, size: 32, align: 32, flags: DIFlagPrivate)
!777 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Socket", scope: !778, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !781, templateParams: !18, identifier: "8a168da92db623f475f94d7f638956c3")
!778 = !DINamespace(name: "net", scope: !779)
!779 = !DINamespace(name: "unix", scope: !780)
!780 = !DINamespace(name: "pal", scope: !102)
!781 = !{!782}
!782 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !777, file: !2, baseType: !783, size: 32, align: 32, flags: DIFlagPrivate)
!783 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "FileDesc", scope: !784, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !785, templateParams: !18, identifier: "400ffb2c62627bb89e28adc3da4847dd")
!784 = !DINamespace(name: "fd", scope: !779)
!785 = !{!786}
!786 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !783, file: !2, baseType: !787, size: 32, align: 32, flags: DIFlagPrivate)
!787 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "OwnedFd", scope: !788, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !791, templateParams: !18, identifier: "cab55d4e44c9ab51d4a67e8af5c4be7e")
!788 = !DINamespace(name: "owned", scope: !789)
!789 = !DINamespace(name: "fd", scope: !790)
!790 = !DINamespace(name: "os", scope: !46)
!791 = !{!792}
!792 = !DIDerivedType(tag: DW_TAG_member, name: "fd", scope: !787, file: !2, baseType: !505, size: 32, align: 32, flags: DIFlagPrivate)
!793 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !764, file: !2, baseType: !794, size: 8, align: 8, offset: 32, flags: DIFlagPrivate)
!794 = !DIBasicType(name: "bool", size: 8, encoding: DW_ATE_boolean)
!795 = !DIDerivedType(tag: DW_TAG_member, name: "Unix", scope: !758, file: !2, baseType: !796, size: 96, align: 32, extraData: i128 1)
!796 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Unix", scope: !756, file: !2, size: 96, align: 32, flags: DIFlagPrivate, elements: !797, templateParams: !18, identifier: "7645f560b7020afb4383d43a2be580a3")
!797 = !{!798}
!798 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !796, file: !2, baseType: !799, size: 64, align: 32, offset: 32, flags: DIFlagPrivate)
!799 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UnixConnection", scope: !753, file: !2, size: 64, align: 32, flags: DIFlagPrivate, elements: !800, templateParams: !18, identifier: "aff2b80613b65a33b0ddbd59fd3da723")
!800 = !{!801, !808}
!801 = !DIDerivedType(tag: DW_TAG_member, name: "sock", scope: !799, file: !2, baseType: !802, size: 32, align: 32, flags: DIFlagPrivate)
!802 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "UnixStream", scope: !803, file: !2, size: 32, align: 32, flags: DIFlagPublic, elements: !806, templateParams: !18, identifier: "b85c5f95d9c7fc28ab9405bcddc88fce")
!803 = !DINamespace(name: "stream", scope: !804)
!804 = !DINamespace(name: "net", scope: !805)
!805 = !DINamespace(name: "unix", scope: !790)
!806 = !{!807}
!807 = !DIDerivedType(tag: DW_TAG_member, name: "__0", scope: !802, file: !2, baseType: !777, size: 32, align: 32, flags: DIFlagProtected)
!808 = !DIDerivedType(tag: DW_TAG_member, name: "open", scope: !799, file: !2, baseType: !794, size: 8, align: 8, offset: 32, flags: DIFlagPrivate)
!809 = !DIDerivedType(tag: DW_TAG_member, scope: !756, file: !2, baseType: !114, size: 32, align: 32, flags: DIFlagArtificial)
!810 = !DIDerivedType(tag: DW_TAG_member, name: "parser", scope: !752, file: !2, baseType: !811, size: 512, align: 64, flags: DIFlagPrivate)
!811 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Parser", scope: !812, file: !2, size: 512, align: 64, flags: DIFlagPublic, elements: !813, templateParams: !18, identifier: "cdb68ccee30c7e569a84854454d95968")
!812 = !DINamespace(name: "parser", scope: !677)
!813 = !{!814}
!814 = !DIDerivedType(tag: DW_TAG_member, name: "decoder", scope: !811, file: !2, baseType: !815, size: 512, align: 64, flags: DIFlagPrivate)
!815 = distinct !DICompositeType(tag: DW_TAG_structure_type, name: "Decoder<combine::parser::combinator::AnySendSyncPartialState, combine::stream::PointerOffset<[u8]>, combine::stream::buf_reader::Buffer>", scope: !816, file: !2, size: 512, align: 64, flags: DIFlagPublic, elements: !819, templateParams: !871, identifier: "19623f1872d80dd55845642ca94329bf")
!816 = !DINamespace(name: "decoder", scope: !817)
!817 = !DINamespace(name: "stream", scope: !818)
!818 = !DINamespace(name: "combine", scope: null)
!819 = !{!820, !826, !851, !870}
!820 = !DIDerivedType(tag: DW_TAG_member, name: "position", scope: !815, file: !2, baseType: !821, size: 64, align: 64, offset: 256, flags: DIFlagPrivate)
